{"ir_version": 3, "engine": "TFLITE", "graph": [{"description": "QUANTIZE", "op_type": "QUANTIZE", "name": "QUANTIZE", "inputs": [{"scale": null, "zero_point": null, "tensor": {"shape": [1, 5], "dtype": "FLOAT32", "name": "serving_default_input_15:0", "tensor": null}}], "outputs": [{"scale": 0.003921568859368563, "zero_point": -128, "tensor": {"shape": [1, 5], "dtype": "INT8", "name": "tfl.quantize", "tensor": null}}]}, {"description": "FULLY_CONNECTED", "op_type": "FULLY_CONNECTED", "name": "FULLY_CONNECTED", "inputs": [{"scale": 0.003921568859368563, "zero_point": -128, "tensor": {"shape": [1, 5], "dtype": "INT8", "name": "tfl.quantize", "tensor": null}}, {"scale": 0.005120374262332916, "zero_point": 0, "tensor": {"shape": [8, 5], "dtype": "INT8", "name": "sequential_14/dense_104/MatMul", "tensor": [[-115, -38, -30, 7, 2], [-58, -121, 98, -79, 85], [-78, -55, 12, -110, 120], [4, -63, -66, -6, -77], [81, -10, 68, 89, 58], [-78, -31, 15, 50, 67], [127, -40, 38, -43, -51], [-72, -105, 86, -39, -54]]}}, {"scale": 2.007990042329766e-05, "zero_point": 0, "tensor": {"shape": [8], "dtype": "INT32", "name": "sequential_14/dense_104/BiasAdd/ReadVariableOp", "tensor": [3157, 3106, 2828, -1236, 1576, 3617, -3801, -1730]}}], "outputs": [{"scale": 0.009560832753777504, "zero_point": -3, "tensor": {"shape": [1, 8], "dtype": "INT8", "name": "sequential_14/dense_104/MatMul;sequential_14/dense_104/BiasAdd", "tensor": null}}]}, {"description": "TANH", "op_type": "TANHLUT", "name": "TANHLUT", "inputs": [{"scale": 0.009560832753777504, "zero_point": -3, "tensor": {"shape": [1, 8], "dtype": "INT8", "name": "sequential_14/dense_104/MatMul;sequential_14/dense_104/BiasAdd", "tensor": null}, "LUT": {"LUT": [-107, -106, -106, -105, -105, -105, -104, -104, -103, -103, -102, -102, -102, -101, -101, -100, -100, -99, -99, -98, -98, -97, -97, -96, -96, -95, -94, -94, -93, -93, -92, -92, -91, -90, -90, -89, -89, -88, -87, -87, -86, -85, -85, -84, -83, -82, -82, -81, -80, -79, -79, -78, -77, -76, -76, -75, -74, -73, -72, -72, -71, -70, -69, -68, -67, -66, -65, -65, -64, -63, -62, -61, -60, -59, -58, -57, -56, -55, -54, -53, -52, -51, -50, -49, -48, -47, -46, -45, -43, -42, -41, -40, -39, -38, -37, -36, -35, -33, -32, -31, -30, -29, -28, -27, -25, -24, -23, -22, -21, -19, -18, -17, -16, -15, -13, -12, -11, -10, -9, -7, -6, -5, -4, -2, -1, 0, 1, 2, 4, 5, 6, 7, 9, 10, 11, 12, 13, 15, 16, 17, 18, 19, 21, 22, 23, 24, 25, 27, 28, 29, 30, 31, 32, 33, 35, 36, 37, 38, 39, 40, 41, 42, 43, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 65, 66, 67, 68, 69, 70, 71, 72, 72, 73, 74, 75, 76, 76, 77, 78, 79, 79, 80, 81, 82, 82, 83, 84, 85, 85, 86, 87, 87, 88, 89, 89, 90, 90, 91, 92, 92, 93, 93, 94, 94, 95, 96, 96, 97, 97, 98, 98, 99, 99, 100, 100, 101, 101, 102, 102, 102, 103, 103, 104, 104, 105, 105, 105, 106, 106, 107, 107, 107, 108, 108, 108], "offset": 128, "reduced_LUT": {"reduced_lut_len": 242, "reduced_lut": [-104, -104, -103, -103, -102, -102, -102, -101, -101, -100, -100, -99, -99, -98, -98, -97, -97, -96, -96, -95, -94, -94, -93, -93, -92, -92, -91, -90, -90, -89, -89, -88, -87, -87, -86, -85, -85, -84, -83, -82, -82, -81, -80, -79, -79, -78, -77, -76, -76, -75, -74, -73, -72, -72, -71, -70, -69, -68, -67, -66, -65, -65, -64, -63, -62, -61, -60, -59, -58, -57, -56, -55, -54, -53, -52, -51, -50, -49, -48, -47, -46, -45, -43, -42, -41, -40, -39, -38, -37, -36, -35, -33, -32, -31, -30, -29, -28, -27, -25, -24, -23, -22, -21, -19, -18, -17, -16, -15, -13, -12, -11, -10, -9, -7, -6, -5, -4, -2, -1, 0, 1, 2, 4, 5, 6, 7, 9, 10, 11, 12, 13, 15, 16, 17, 18, 19, 21, 22, 23, 24, 25, 27, 28, 29, 30, 31, 32, 33, 35, 36, 37, 38, 39, 40, 41, 42, 43, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 65, 66, 67, 68, 69, 70, 71, 72, 72, 73, 74, 75, 76, 76, 77, 78, 79, 79, 80, 81, 82, 82, 83, 84, 85, 85, 86, 87, 87, 88, 89, 89, 90, 90, 91, 92, 92, 93, 93, 94, 94, 95, 96, 96, 97, 97, 98, 98, 99, 99, 100, 100, 101, 101, 102, 102, 102, 103, 103, 104, 104, 105, 105, 105], "head": {"shift": 6, "tuples_len": 3, "tuples": [[1, -107], [3, -106], [6, -105]]}, "tail": {"shift": 8, "tuples_len": 3, "tuples": [[253, 108], [250, 107], [248, 106]]}, "depth": 3, "min_reduce": 0, "asymmetric": false, "description": "Reduced LUT of depth 3 with 0 minimum reduce"}}}], "outputs": [{"scale": 0.0078125, "zero_point": 0, "tensor": {"shape": [1, 8], "dtype": "INT8", "name": "sequential_14/dense_104/Tanh", "tensor": null}}]}, {"description": "FULLY_CONNECTED", "op_type": "FULLY_CONNECTED", "name": "FULLY_CONNECTED", "inputs": [{"scale": 0.0078125, "zero_point": 0, "tensor": {"shape": [1, 8], "dtype": "INT8", "name": "sequential_14/dense_104/Tanh", "tensor": null}}, {"scale": 0.004367401823401451, "zero_point": 0, "tensor": {"shape": [16, 8], "dtype": "INT8", "name": "sequential_14/dense_105/MatMul", "tensor": [[87, 100, -15, -94, -19, -78, -22, -30], [-25, -65, -113, 122, -19, -91, 68, 94], [-94, 55, -14, -55, -37, 5, 56, 59], [107, 19, -26, -6, -58, 102, 35, -16], [-77, 105, 50, 8, 33, -86, -127, -50], [-82, 66, 99, 108, 27, 49, -28, -90], [43, -62, 29, 16, 39, 16, 66, -14], [41, 27, -44, -18, 105, 47, -79, 50], [-118, 24, 53, -1, -55, -104, -61, 44], [-1, 13, -33, 0, -93, -110, -6, 63], [52, -68, -113, -21, 112, -60, -15, -93], [29, -49, -81, -118, -88, -29, -11, 13], [-83, -38, 94, -77, 8, 118, 0, 11], [-92, -12, -35, -66, 54, -99, 51, -2], [-68, -66, 67, -73, 17, -83, -77, 1], [-65, 104, 39, -28, -64, -30, 81, 63]]}}, {"scale": 3.412032674532384e-05, "zero_point": 0, "tensor": {"shape": [16], "dtype": "INT32", "name": "sequential_14/dense_105/BiasAdd/ReadVariableOp", "tensor": [1037, -1492, -878, 123, 671, -506, -480, 1432, -459, -98, -1187, 1243, 1316, -1703, 324, -1025]}}], "outputs": [{"scale": 0.008450886234641075, "zero_point": 1, "tensor": {"shape": [1, 16], "dtype": "INT8", "name": "sequential_14/dense_105/MatMul;sequential_14/dense_105/BiasAdd", "tensor": null}}]}, {"description": "TANH", "op_type": "TANHLUT", "name": "TANHLUT", "inputs": [{"scale": 0.008450886234641075, "zero_point": 1, "tensor": {"shape": [1, 16], "dtype": "INT8", "name": "sequential_14/dense_105/MatMul;sequential_14/dense_105/BiasAdd", "tensor": null}, "LUT": {"LUT": [-102, -102, -101, -101, -100, -100, -100, -99, -99, -98, -98, -97, -97, -96, -96, -95, -95, -94, -94, -93, -93, -92, -92, -91, -91, -90, -90, -89, -89, -88, -88, -87, -86, -86, -85, -85, -84, -83, -83, -82, -81, -81, -80, -79, -79, -78, -77, -77, -76, -75, -75, -74, -73, -73, -72, -71, -70, -70, -69, -68, -67, -66, -66, -65, -64, -63, -62, -62, -61, -60, -59, -58, -57, -56, -56, -55, -54, -53, -52, -51, -50, -49, -48, -47, -46, -46, -45, -44, -43, -42, -41, -40, -39, -38, -37, -36, -35, -34, -33, -32, -31, -30, -29, -28, -27, -26, -25, -24, -22, -21, -20, -19, -18, -17, -16, -15, -14, -13, -12, -11, -10, -9, -8, -6, -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5, 6, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 56, 57, 58, 59, 60, 61, 62, 62, 63, 64, 65, 66, 66, 67, 68, 69, 70, 70, 71, 72, 73, 73, 74, 75, 75, 76, 77, 77, 78, 79, 79, 80, 81, 81, 82, 83, 83, 84, 85, 85, 86, 86, 87, 88, 88, 89, 89, 90, 90, 91, 91, 92, 92, 93, 93, 94, 94, 95, 95, 96, 96, 97, 97, 98, 98, 99, 99, 100, 100, 100, 101], "offset": 128, "reduced_LUT": {"reduced_lut_len": 243, "reduced_lut": [-99, -99, -98, -98, -97, -97, -96, -96, -95, -95, -94, -94, -93, -93, -92, -92, -91, -91, -90, -90, -89, -89, -88, -88, -87, -86, -86, -85, -85, -84, -83, -83, -82, -81, -81, -80, -79, -79, -78, -77, -77, -76, -75, -75, -74, -73, -73, -72, -71, -70, -70, -69, -68, -67, -66, -66, -65, -64, -63, -62, -62, -61, -60, -59, -58, -57, -56, -56, -55, -54, -53, -52, -51, -50, -49, -48, -47, -46, -46, -45, -44, -43, -42, -41, -40, -39, -38, -37, -36, -35, -34, -33, -32, -31, -30, -29, -28, -27, -26, -25, -24, -22, -21, -20, -19, -18, -17, -16, -15, -14, -13, -12, -11, -10, -9, -8, -6, -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5, 6, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 56, 57, 58, 59, 60, 61, 62, 62, 63, 64, 65, 66, 66, 67, 68, 69, 70, 70, 71, 72, 73, 73, 74, 75, 75, 76, 77, 77, 78, 79, 79, 80, 81, 81, 82, 83, 83, 84, 85, 85, 86, 86, 87, 88, 88, 89, 89, 90, 90, 91, 91, 92, 92, 93, 93, 94, 94, 95, 95, 96, 96, 97, 97, 98, 98], "head": {"shift": 7, "tuples_len": 3, "tuples": [[2, -102], [4, -101], [7, -100]]}, "tail": {"shift": 6, "tuples_len": 3, "tuples": [[255, 101], [252, 100], [250, 99]]}, "depth": 3, "min_reduce": 0, "asymmetric": false, "description": "Reduced LUT of depth 3 with 0 minimum reduce"}}}], "outputs": [{"scale": 0.0078125, "zero_point": 0, "tensor": {"shape": [1, 16], "dtype": "INT8", "name": "sequential_14/dense_105/Tanh", "tensor": null}}]}, {"description": "FULLY_CONNECTED", "op_type": "FULLY_CONNECTED", "name": "FULLY_CONNECTED", "inputs": [{"scale": 0.0078125, "zero_point": 0, "tensor": {"shape": [1, 16], "dtype": "INT8", "name": "sequential_14/dense_105/Tanh", "tensor": null}}, {"scale": 0.002739147050306201, "zero_point": 0, "tensor": {"shape": [64, 16], "dtype": "INT8", "name": "sequential_14/dense_106/MatMul", "tensor": [[-60, 15, -33, 10, 102, -2, 8, 117, 93, 8, 63, -27, 51, -79, -38, 42], [53, 27, -42, -94, 101, 0, 72, -73, -19, 83, 24, 44, -82, -31, -82, 40], [-60, 94, 14, -2, -74, 25, 3, -82, 75, -44, 50, 35, 17, 10, -14, 34], [113, -34, 43, 21, -75, 77, -15, 127, -23, -22, -4, 70, 111, -78, 40, -100], [56, -60, 66, -36, -13, -34, 1, 28, -25, 55, 75, 48, 23, -89, -95, -5], [-39, -120, -50, 17, 36, 76, -1, -24, 12, -17, 29, 66, 77, -87, -41, 42], [-18, 85, -2, 13, 73, 27, 78, 17, -46, 54, 84, -28, -19, -12, -70, 68], [-56, 9, -62, 77, 41, -22, 32, -85, 5, 31, -23, 15, -54, -1, -23, -60], [-89, 69, 83, 6, 52, -6, -77, -24, 4, 72, -32, -91, 46, -50, 21, 25], [-67, 57, -35, -58, 55, 49, -73, -74, -9, -2, 65, -84, -24, -19, -1, 21], [55, 44, -53, 16, -64, -97, -119, 104, 71, -53, -52, 18, 85, 82, 19, -69], [69, 116, -2, -48, -44, 26, -53, 73, 41, -88, 80, -84, -68, 13, -13, -34], [3, 9, -3, 17, -83, -38, 61, -36, 61, 68, -78, -69, 1, 13, 38, -93], [49, 74, -83, 28, 21, 18, -111, -60, 40, 5, 62, 99, 63, -24, 9, 5], [-80, -17, -71, 76, 77, -71, -41, 33, -68, -50, 24, -69, 43, -25, 13, 40], [69, 124, -8, -52, 24, -86, 15, -81, 53, 31, 9, -16, -10, -33, -97, -64], [40, 56, -91, -67, -9, 90, -113, 84, -42, -50, -31, 78, -3, 94, -1, 8], [-106, 98, 44, 22, -50, 75, 59, -105, 65, -82, 70, 13, 38, -81, -92, 31], [2, 54, 18, -8, -36, -36, 20, -104, -63, 101, 50, 17, -36, 84, -27, 93], [-30, 55, -16, 5, 34, -68, -29, -4, 37, 55, 85, 69, -45, -25, 1, -30], [-75, 121, 35, -32, 91, 84, 73, -6, -88, -20, -4, -45, 54, -31, -34, 45], [80, 114, -19, -45, 69, 41, -55, 34, 47, 46, -100, -75, -37, 94, 71, 30], [-48, -108, 9, 73, -47, -39, 8, 18, 83, 69, -70, -82, -71, 80, 61, -43], [-16, -110, -42, 77, 97, -42, 71, -13, 65, 18, -52, -30, 99, 9, -26, 84], [-22, 110, -76, -86, 49, -29, 104, 36, -32, -48, -99, 71, -56, 42, -15, -86], [-20, -5, 56, -63, 72, -9, 4, -43, -27, -62, 30, 27, 66, -38, 44, -47], [-26, 49, -83, 86, -6, -76, 13, 35, -6, 38, 76, -40, -99, 52, -43, 80], [62, -86, -70, -3, -25, 41, -64, 38, 49, -66, -16, 0, 1, 65, 12, -40], [-30, -91, -96, -16, 73, -85, -15, 29, 71, 83, 34, -81, -20, -81, 79, -20], [83, 58, 27, 32, -90, -36, 24, -39, 74, 77, 52, -25, -35, -96, -6, -18], [-37, -102, 56, 10, 10, 37, -68, 64, 0, -55, -65, -89, -22, 98, 69, -104], [-10, 39, 85, -12, -47, -50, -35, -29, -110, -16, 28, -14, -10, -15, -91, 66], [57, 118, 79, 20, -73, 106, 84, -42, 42, -64, 23, 34, -83, 26, 38, -31], [-61, 37, 11, -95, -3, 50, 53, -114, 68, 72, 83, -78, 43, 92, 33, -79], [42, 79, 36, 84, -39, 73, 70, 2, -37, 84, -27, -100, -74, -66, 31, -33], [107, 14, 80, 52, 24, -92, 37, 118, 84, -1, 49, 59, 80, -77, -62, 34], [-43, -66, 94, 38, 10, 8, -95, 78, -43, -69, 11, 78, 50, -11, 47, 116], [103, 36, 35, -51, 66, -14, -31, 64, -91, 2, -93, -72, 100, -97, -83, -35], [-48, -4, 89, -17, 56, -5, 18, 67, 48, 65, 59, -32, -47, -26, -13, 93], [18, 110, 23, 96, -6, -91, -56, -96, 83, -16, -32, -66, -97, -70, 79, -26], [-28, -52, -80, 95, 52, 16, -81, -34, -13, 34, -77, 94, -43, 92, -54, -93], [-28, -4, -74, -70, 90, -80, 9, -22, 52, -74, 48, -89, -84, 38, 80, 67], [-2, -13, -80, -1, 106, -24, 10, 10, -12, -88, -77, 9, -11, -90, 70, 71], [70, 3, 40, -66, -74, -57, -78, -8, -70, -3, 56, -8, 19, 22, 8, -79], [84, 48, -101, 88, 88, 16, 48, 57, 70, -29, -2, 23, -50, -32, -78, -23], [-37, 69, 37, 76, -20, 5, 61, -51, -53, 2, 32, 39, 57, 26, -33, 59], [20, -94, 75, -2, -71, -88, -101, -16, -11, 20, 14, -30, 49, -44, -28, 28], [-57, 100, 81, 56, -76, 90, 30, 26, 82, -56, -50, -72, 63, 33, 15, 73], [-18, -56, -26, -8, 34, 54, -102, 28, 86, -41, 53, 10, -35, 83, 29, 26], [-124, -49, 60, 33, 82, 17, 60, -109, 87, -87, 46, -10, -49, 100, 55, -75], [-10, 18, 96, 81, 8, 88, 15, -44, 92, 66, -14, -86, -30, 91, 69, -63], [-63, 19, 86, 96, 33, 50, 20, 82, 12, 6, 86, 30, -65, -94, -10, -15], [38, -7, -55, 25, 40, 24, 5, 102, 97, -52, -80, -70, -6, 92, 45, 63], [105, 58, 40, -16, -26, -6, -34, -38, 7, -94, 28, -47, -78, -17, 88, 34], [-107, 100, 46, 93, -58, -19, -55, -40, 60, -59, -64, -16, 76, -35, -23, 89], [40, -91, 55, -64, 99, 7, 25, 19, -15, -32, 29, 95, 46, -58, 13, 5], [-101, 92, 28, -3, 44, -8, 98, 51, 94, 0, 8, -104, -107, -12, -52, -56], [28, 52, 14, -9, 76, 91, -9, 22, -57, 55, -18, 104, 14, -47, -3, 78], [-74, -51, 41, -86, -5, -2, -94, -1, 49, -17, -17, -10, 115, -24, -2, -107], [77, 62, -73, -33, 71, 86, -104, -68, 17, -102, -78, 44, 64, 80, -33, 18], [29, 51, 61, -51, 56, 23, 4, -52, 43, 22, 17, -20, -62, -17, -37, 88], [18, 86, 0, -28, 83, 74, 107, -83, 35, -88, 63, -29, 27, 65, -12, -71], [-12, -96, -25, -42, -19, 53, -75, -75, 61, 22, 77, 64, 88, 15, 81, 5], [-6, 70, 23, -62, -68, -31, 63, 64, -2, 90, -30, -29, 11, -84, 36, 50]]}}, {"scale": 2.1399586330517195e-05, "zero_point": 0, "tensor": {"shape": [64], "dtype": "INT32", "name": "sequential_14/dense_106/BiasAdd/ReadVariableOp", "tensor": [1432, -1207, -1700, 2731, 249, 2310, -269, -1693, -1962, -1998, 1176, -1796, 126, 982, 2026, -1479, 1329, -1434, -2230, -1389, -1849, -1914, 1662, 1388, -2017, 314, -1523, 1387, 1671, 271, 1747, -1506, -744, -1944, 333, 2816, -1550, 327, -1495, -1527, 1582, -1390, 1518, -1598, 1373, -1727, 2044, -1458, 2316, -835, -1448, 1183, 1708, -497, -1175, 1839, -2574, 972, 1781, -98, -2005, -2008, 1549, 1430]}}], "outputs": [{"scale": 0.0052284724079072475, "zero_point": -3, "tensor": {"shape": [1, 64], "dtype": "INT8", "name": "sequential_14/dense_106/MatMul;sequential_14/dense_106/BiasAdd", "tensor": null}}]}, {"description": "TANH", "op_type": "TANHLUT", "name": "TANHLUT", "inputs": [{"scale": 0.0052284724079072475, "zero_point": -3, "tensor": {"shape": [1, 64], "dtype": "INT8", "name": "sequential_14/dense_106/MatMul;sequential_14/dense_106/BiasAdd", "tensor": null}, "LUT": {"LUT": [-73, -73, -73, -72, -72, -71, -71, -70, -70, -69, -69, -68, -68, -67, -67, -66, -66, -65, -65, -64, -64, -63, -63, -62, -62, -61, -61, -60, -60, -59, -59, -58, -58, -57, -57, -56, -56, -55, -55, -54, -53, -53, -52, -52, -51, -51, -50, -49, -49, -48, -48, -47, -47, -46, -45, -45, -44, -44, -43, -42, -42, -41, -41, -40, -39, -39, -38, -38, -37, -36, -36, -35, -35, -34, -33, -33, -32, -31, -31, -30, -30, -29, -28, -28, -27, -26, -26, -25, -24, -24, -23, -23, -22, -21, -21, -20, -19, -19, -18, -17, -17, -16, -15, -15, -14, -13, -13, -12, -11, -11, -10, -9, -9, -8, -7, -7, -6, -5, -5, -4, -3, -3, -2, -1, -1, 0, 1, 1, 2, 3, 3, 4, 5, 5, 6, 7, 7, 8, 9, 9, 10, 11, 11, 12, 13, 13, 14, 15, 15, 16, 17, 17, 18, 19, 19, 20, 21, 21, 22, 23, 23, 24, 24, 25, 26, 26, 27, 28, 28, 29, 30, 30, 31, 31, 32, 33, 33, 34, 35, 35, 36, 36, 37, 38, 38, 39, 39, 40, 41, 41, 42, 42, 43, 44, 44, 45, 45, 46, 47, 47, 48, 48, 49, 49, 50, 51, 51, 52, 52, 53, 53, 54, 55, 55, 56, 56, 57, 57, 58, 58, 59, 59, 60, 60, 61, 61, 62, 62, 63, 63, 64, 64, 65, 65, 66, 66, 67, 67, 68, 68, 69, 69, 70, 70, 71, 71, 72, 72, 73, 73, 73, 74, 74, 75, 75, 76], "offset": 128, "reduced_LUT": {"reduced_lut_len": 244, "reduced_lut": [-70, -70, -69, -69, -68, -68, -67, -67, -66, -66, -65, -65, -64, -64, -63, -63, -62, -62, -61, -61, -60, -60, -59, -59, -58, -58, -57, -57, -56, -56, -55, -55, -54, -53, -53, -52, -52, -51, -51, -50, -49, -49, -48, -48, -47, -47, -46, -45, -45, -44, -44, -43, -42, -42, -41, -41, -40, -39, -39, -38, -38, -37, -36, -36, -35, -35, -34, -33, -33, -32, -31, -31, -30, -30, -29, -28, -28, -27, -26, -26, -25, -24, -24, -23, -23, -22, -21, -21, -20, -19, -19, -18, -17, -17, -16, -15, -15, -14, -13, -13, -12, -11, -11, -10, -9, -9, -8, -7, -7, -6, -5, -5, -4, -3, -3, -2, -1, -1, 0, 1, 1, 2, 3, 3, 4, 5, 5, 6, 7, 7, 8, 9, 9, 10, 11, 11, 12, 13, 13, 14, 15, 15, 16, 17, 17, 18, 19, 19, 20, 21, 21, 22, 23, 23, 24, 24, 25, 26, 26, 27, 28, 28, 29, 30, 30, 31, 31, 32, 33, 33, 34, 35, 35, 36, 36, 37, 38, 38, 39, 39, 40, 41, 41, 42, 42, 43, 44, 44, 45, 45, 46, 47, 47, 48, 48, 49, 49, 50, 51, 51, 52, 52, 53, 53, 54, 55, 55, 56, 56, 57, 57, 58, 58, 59, 59, 60, 60, 61, 61, 62, 62, 63, 63, 64, 64, 65, 65, 66, 66, 67, 67, 68, 68, 69, 69, 70, 70, 71, 71, 72, 72, 73, 73, 73], "head": {"shift": 7, "tuples_len": 3, "tuples": [[3, -73], [5, -72], [7, -71]]}, "tail": {"shift": 5, "tuples_len": 3, "tuples": [[255, 76], [253, 75], [251, 74]]}, "depth": 3, "min_reduce": 0, "asymmetric": false, "description": "Reduced LUT of depth 3 with 0 minimum reduce"}}}], "outputs": [{"scale": 0.0078125, "zero_point": 0, "tensor": {"shape": [1, 64], "dtype": "INT8", "name": "sequential_14/dense_106/Tanh", "tensor": null}}]}, {"description": "FULLY_CONNECTED", "op_type": "FULLY_CONNECTED", "name": "FULLY_CONNECTED", "inputs": [{"scale": 0.0078125, "zero_point": 0, "tensor": {"shape": [1, 64], "dtype": "INT8", "name": "sequential_14/dense_106/Tanh", "tensor": null}}, {"scale": 0.0028266687877476215, "zero_point": 0, "tensor": {"shape": [16, 64], "dtype": "INT8", "name": "sequential_14/dense_107/MatMul", "tensor": [[-88, -12, -36, 18, 99, 46, 36, -66, 41, -80, -81, -85, 42, -30, 40, 34, 36, -87, -73, -81, -80, -24, 33, -8, 28, -61, 23, -69, 93, 3, -8, -94, -57, -35, 54, 56, -82, 54, -48, 61, -11, 68, 38, -47, -35, -69, 24, -69, -46, 36, 53, 17, 41, -70, -64, 108, -75, -61, 69, -34, -81, -49, 60, 45], [85, 81, 27, -115, 13, -79, -62, -84, 99, 86, 58, 60, 20, -54, 32, -40, -44, 55, 50, 70, -68, 105, 31, -42, 66, 15, -41, -53, -76, 99, -3, 22, -58, 80, -62, -42, 4, 67, 97, 103, 38, 37, -54, -18, 13, 63, -101, 72, -91, 66, -9, 14, -82, 95, -66, -51, 103, -73, -94, -31, 95, 78, 79, -25], [-19, -26, -23, 127, 31, -45, 14, -60, 20, -112, -52, -102, -78, -4, -6, 23, 80, -4, -102, -42, -16, -43, -11, -66, -43, -25, -109, -70, -71, 65, -40, -32, -93, -89, -66, -3, 41, -56, -18, 86, -72, 57, 62, 26, -62, -91, 38, -50, -53, 52, -4, 58, 20, 5, 17, -69, -52, -76, 63, 49, -68, -59, 86, -34], [-36, -45, -48, -102, -42, -44, 38, 23, -59, 97, -39, 60, 92, -5, -61, 74, -53, -83, 46, -90, -62, -9, 99, 48, -55, 19, -3, -96, 11, 4, -47, -15, 51, 69, 84, 45, 52, 102, 54, 71, -23, 84, 44, -9, -81, 66, -67, 8, 39, -55, -25, 22, -94, 4, -59, -2, 78, -64, 23, 67, -28, 25, -44, -29], [89, 59, -101, 8, 49, -55, -102, 35, -5, -92, 44, 88, 0, -62, 77, 27, 46, 31, -62, 29, -112, -20, 4, 66, -67, -32, 2, 43, 104, 30, 44, -56, 2, -70, 18, 77, 11, -26, -30, -30, 58, -82, 37, -64, 50, -66, 78, 21, 101, 11, -79, 41, 96, -72, -13, 99, 37, -54, 39, -64, 35, 72, 23, 59], [-81, 50, -81, 9, 24, -59, -18, 76, 20, 26, 69, 22, 84, 68, 111, 84, 5, -98, -20, -64, 20, 49, 7, 75, -75, 74, -75, -32, 5, 37, -60, -2, 34, -60, 78, 20, 21, -49, -29, -2, -97, -9, -41, -25, -85, -109, 68, -20, -37, 52, 6, -45, 77, 29, -89, -47, 26, -34, 52, 68, 60, 40, -46, -17], [-50, -72, 20, -12, 55, -58, -1, 68, -69, -45, -35, 63, 1, -8, -69, 80, -68, -2, 4, -1, 28, 48, -45, 9, -34, -12, -69, -20, -81, 3, -99, -58, -46, -70, -16, 74, -13, -59, 43, 76, -76, 47, 7, 10, -41, 85, -29, -16, 35, 84, 105, -56, 29, -87, 93, 29, -10, -13, 25, -2, -45, 20, 75, 36], [28, 64, 98, -18, -17, -22, -26, 66, 105, -58, -90, -25, -34, 79, -25, -36, -86, -12, -87, -11, 45, 64, -37, 46, 12, -98, 96, -97, 41, 13, -40, 52, 37, 39, -2, -57, 88, 53, 15, 0, -68, -13, 29, -20, 12, -73, 90, -51, 1, -84, -31, 77, 73, 83, 42, 61, 13, 2, -18, 5, 10, -19, 14, 104], [45, -18, -108, 67, -29, 55, -93, -77, -11, -63, -52, -99, -12, 68, -73, -62, 17, -74, -6, -27, -72, -82, 81, 83, -81, -82, -70, 85, 3, -58, 82, -71, -80, -48, 6, -67, 90, -69, -30, 41, 56, 4, 6, -12, -35, -56, -54, -49, -39, -11, -21, 40, -30, 80, 2, -74, -111, -74, 92, 30, -47, 5, 97, -39], [59, 54, -18, -60, 54, -11, 60, 78, -77, 9, -36, -71, 71, 14, -27, 44, 64, -12, -56, 34, 48, -21, 40, 84, 28, 45, -38, -85, -82, 92, -33, -31, -74, 13, -18, 55, -26, 88, -27, -58, 29, -69, 58, 26, 58, -97, -68, 10, -88, -33, -31, 19, 63, -89, -67, 62, 47, 78, -72, 2, 33, -62, -22, 12], [65, -67, -19, 83, 12, 97, 22, 1, -70, 42, -68, 93, 76, 21, 43, 44, -70, 14, -95, -26, -1, -71, 10, 94, 19, -9, 28, -34, -36, 0, 76, 34, -102, 58, -46, 66, -15, -58, 69, -81, -31, 91, -29, -52, -59, 22, -14, -79, 42, 28, -79, -20, -47, -80, 4, 41, 50, 3, 70, -28, -59, -82, 26, -16], [26, -71, -29, 79, -4, 1, -83, -38, 15, -41, 10, -76, -77, 53, 13, -72, -51, -81, -26, 65, -68, -38, 100, 23, -73, -48, -97, 25, 82, 36, -15, 18, -25, 62, -86, 75, 80, 88, -89, -5, 84, -46, 22, 7, 86, -19, -82, 82, 98, -68, -37, 45, 26, -23, 53, 9, 39, -43, 70, -77, -41, 95, 7, 60], [24, -18, -92, 74, 55, -31, -62, 91, -39, -37, 40, 67, -50, -61, 36, -69, 77, 10, -94, -15, -107, -109, -85, 76, 71, 16, -50, 33, 60, -77, 100, -77, -126, -46, 45, 22, -26, 30, 51, -61, -52, -85, -6, 64, 98, -43, 44, -72, 60, -68, -58, -79, -20, 16, -26, 5, 35, 93, -44, 5, -105, 8, -38, 22], [71, -88, 73, -60, 55, 95, 10, -24, 66, 80, 1, 62, 70, -66, 45, 16, 5, -108, 61, -94, 6, 28, 78, 71, -76, 48, -39, 64, -49, 2, -79, -65, -77, 69, 66, -84, -2, -31, -81, 48, 4, 95, -69, 67, 28, 10, -44, 0, -79, -49, -108, -8, 20, -61, -98, 46, -81, 60, -17, -23, -91, -74, 72, -70], [91, -28, -30, 28, -60, -30, 84, -69, -63, -94, 84, -81, -39, 67, -37, -70, 22, -25, 12, -43, -75, -88, 18, -82, 12, 75, -66, -53, 15, 12, -11, 75, 56, -7, -7, 35, -77, 74, -6, -96, -11, -63, 69, -5, 68, -96, -42, -48, 46, 27, -43, 5, -43, 86, -95, 57, -34, 85, 10, 74, -99, -38, 78, 46], [21, 9, 85, 9, -64, -107, -34, 75, -76, 5, -97, 2, -57, 48, -60, 104, -42, 105, 38, 63, -39, -57, 79, -44, -70, -81, 93, -1, -82, -69, 13, 85, 103, 92, 85, 18, -24, -74, 10, 32, -91, -57, -98, 26, -24, -11, -99, 43, 78, 10, 54, -33, 12, 4, -44, -12, 19, -28, -75, -50, 5, 27, -52, 99]]}}, {"scale": 2.2083349904278293e-05, "zero_point": 0, "tensor": {"shape": [16], "dtype": "INT32", "name": "sequential_14/dense_107/BiasAdd/ReadVariableOp", "tensor": [1798, -1828, 1591, -2454, 1373, 875, -1206, -2935, 1290, 155, 1759, 1697, 1083, 1139, 1362, -987]}}], "outputs": [{"scale": 0.012208198197185993, "zero_point": -7, "tensor": {"shape": [1, 16], "dtype": "INT8", "name": "sequential_14/dense_107/MatMul;sequential_14/dense_107/BiasAdd", "tensor": null}}]}, {"description": "TANH", "op_type": "TANHLUT", "name": "TANHLUT", "inputs": [{"scale": 0.012208198197185993, "zero_point": -7, "tensor": {"shape": [1, 16], "dtype": "INT8", "name": "sequential_14/dense_107/MatMul;sequential_14/dense_107/BiasAdd", "tensor": null}, "LUT": {"LUT": [-115, -115, -115, -114, -114, -114, -113, -113, -113, -112, -112, -112, -111, -111, -111, -110, -110, -109, -109, -108, -108, -108, -107, -107, -106, -106, -105, -105, -104, -104, -103, -102, -102, -101, -101, -100, -99, -99, -98, -98, -97, -96, -96, -95, -94, -93, -93, -92, -91, -90, -90, -89, -88, -87, -86, -85, -85, -84, -83, -82, -81, -80, -79, -78, -77, -76, -75, -74, -73, -72, -71, -70, -69, -67, -66, -65, -64, -63, -62, -60, -59, -58, -57, -55, -54, -53, -52, -50, -49, -48, -46, -45, -44, -42, -41, -39, -38, -36, -35, -34, -32, -31, -29, -28, -26, -25, -23, -22, -20, -19, -17, -16, -14, -12, -11, -9, -8, -6, -5, -3, -2, 0, 2, 3, 5, 6, 8, 9, 11, 12, 14, 16, 17, 19, 20, 22, 23, 25, 26, 28, 29, 31, 32, 34, 35, 36, 38, 39, 41, 42, 44, 45, 46, 48, 49, 50, 52, 53, 54, 55, 57, 58, 59, 60, 62, 63, 64, 65, 66, 67, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 85, 86, 87, 88, 89, 90, 90, 91, 92, 93, 93, 94, 95, 96, 96, 97, 98, 98, 99, 99, 100, 101, 101, 102, 102, 103, 104, 104, 105, 105, 106, 106, 107, 107, 108, 108, 108, 109, 109, 110, 110, 111, 111, 111, 112, 112, 112, 113, 113, 113, 114, 114, 114, 115, 115, 115, 116, 116, 116, 116, 117, 117, 117, 117, 118, 118, 118, 118, 119], "offset": 128, "reduced_LUT": {"reduced_lut_len": 238, "reduced_lut": [-112, -112, -112, -111, -111, -111, -110, -110, -109, -109, -108, -108, -108, -107, -107, -106, -106, -105, -105, -104, -104, -103, -102, -102, -101, -101, -100, -99, -99, -98, -98, -97, -96, -96, -95, -94, -93, -93, -92, -91, -90, -90, -89, -88, -87, -86, -85, -85, -84, -83, -82, -81, -80, -79, -78, -77, -76, -75, -74, -73, -72, -71, -70, -69, -67, -66, -65, -64, -63, -62, -60, -59, -58, -57, -55, -54, -53, -52, -50, -49, -48, -46, -45, -44, -42, -41, -39, -38, -36, -35, -34, -32, -31, -29, -28, -26, -25, -23, -22, -20, -19, -17, -16, -14, -12, -11, -9, -8, -6, -5, -3, -2, 0, 2, 3, 5, 6, 8, 9, 11, 12, 14, 16, 17, 19, 20, 22, 23, 25, 26, 28, 29, 31, 32, 34, 35, 36, 38, 39, 41, 42, 44, 45, 46, 48, 49, 50, 52, 53, 54, 55, 57, 58, 59, 60, 62, 63, 64, 65, 66, 67, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 85, 86, 87, 88, 89, 90, 90, 91, 92, 93, 93, 94, 95, 96, 96, 97, 98, 98, 99, 99, 100, 101, 101, 102, 102, 103, 104, 104, 105, 105, 106, 106, 107, 107, 108, 108, 108, 109, 109, 110, 110, 111, 111, 111, 112, 112, 112, 113, 113, 113, 114, 114, 114, 115, 115, 115, 116, 116, 116, 116], "head": {"shift": 9, "tuples_len": 3, "tuples": [[3, -115], [6, -114], [9, -113]]}, "tail": {"shift": 9, "tuples_len": 3, "tuples": [[255, 119], [251, 118], [247, 117]]}, "depth": 3, "min_reduce": 0, "asymmetric": false, "description": "Reduced LUT of depth 3 with 0 minimum reduce"}}}], "outputs": [{"scale": 0.0078125, "zero_point": 0, "tensor": {"shape": [1, 16], "dtype": "INT8", "name": "sequential_14/dense_107/Tanh", "tensor": null}}]}, {"description": "FULLY_CONNECTED", "op_type": "FULLY_CONNECTED", "name": "FULLY_CONNECTED", "inputs": [{"scale": 0.0078125, "zero_point": 0, "tensor": {"shape": [1, 16], "dtype": "INT8", "name": "sequential_14/dense_107/Tanh", "tensor": null}}, {"scale": 0.004308084957301617, "zero_point": 0, "tensor": {"shape": [8, 16], "dtype": "INT8", "name": "sequential_14/dense_108/MatMul", "tensor": [[108, -122, 43, 43, 117, 33, 20, 3, 89, -56, 29, 126, 41, -32, 12, -18], [-49, -69, 52, 46, -45, 118, -67, -22, 3, 92, -49, -114, -50, 14, -62, 28], [-87, 10, -31, 35, -48, -83, 103, -7, -44, -71, -61, 58, -55, -61, -67, 120], [11, -116, 24, -54, 84, 12, -41, -106, -5, 70, 39, -37, -67, -49, 108, 95], [8, 52, -28, 70, 100, 16, -19, -44, 102, -12, -7, 116, 127, 40, 21, 68], [-88, 20, 31, 19, 82, 12, -90, 83, 107, 86, -9, 38, 114, 70, 116, -124], [28, 49, -111, 64, 97, 15, 22, -5, -31, -77, -55, -103, 39, -119, 37, -97], [-39, 54, 42, 8, 20, -71, 35, 113, -15, 121, -69, 67, 90, 24, -11, 85]]}}, {"scale": 3.365691372891888e-05, "zero_point": 0, "tensor": {"shape": [8], "dtype": "INT32", "name": "sequential_14/dense_108/BiasAdd/ReadVariableOp", "tensor": [842, -1070, -806, 1100, 1041, 745, -1091, -1110]}}], "outputs": [{"scale": 0.01697501726448536, "zero_point": -5, "tensor": {"shape": [1, 8], "dtype": "INT8", "name": "sequential_14/dense_108/MatMul;sequential_14/dense_108/BiasAdd", "tensor": null}}]}, {"description": "TANH", "op_type": "TANHLUT", "name": "TANHLUT", "inputs": [{"scale": 0.01697501726448536, "zero_point": -5, "tensor": {"shape": [1, 8], "dtype": "INT8", "name": "sequential_14/dense_108/MatMul;sequential_14/dense_108/BiasAdd", "tensor": null}, "LUT": {"LUT": [-124, -124, -124, -124, -124, -123, -123, -123, -123, -123, -123, -122, -122, -122, -122, -122, -121, -121, -121, -121, -120, -120, -120, -120, -119, -119, -119, -119, -118, -118, -118, -117, -117, -116, -116, -116, -115, -115, -114, -114, -114, -113, -113, -112, -112, -111, -111, -110, -109, -109, -108, -108, -107, -106, -106, -105, -104, -103, -103, -102, -101, -100, -99, -98, -98, -97, -96, -95, -94, -93, -92, -91, -89, -88, -87, -86, -85, -84, -82, -81, -80, -78, -77, -76, -74, -73, -71, -70, -68, -67, -65, -63, -62, -60, -58, -57, -55, -53, -51, -49, -48, -46, -44, -42, -40, -38, -36, -34, -32, -30, -28, -26, -24, -22, -19, -17, -15, -13, -11, -9, -7, -4, -2, 0, 2, 4, 7, 9, 11, 13, 15, 17, 19, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 49, 51, 53, 55, 57, 58, 60, 62, 63, 65, 67, 68, 70, 71, 73, 74, 76, 77, 78, 80, 81, 82, 84, 85, 86, 87, 88, 89, 91, 92, 93, 94, 95, 96, 97, 98, 98, 99, 100, 101, 102, 103, 103, 104, 105, 106, 106, 107, 108, 108, 109, 109, 110, 111, 111, 112, 112, 113, 113, 114, 114, 114, 115, 115, 116, 116, 116, 117, 117, 118, 118, 118, 119, 119, 119, 119, 120, 120, 120, 120, 121, 121, 121, 121, 122, 122, 122, 122, 122, 123, 123, 123, 123, 123, 123, 124, 124, 124, 124, 124, 124, 124, 124, 125, 125, 125, 125, 125, 125], "offset": 128, "reduced_LUT": {"reduced_lut_len": 220, "reduced_lut": [-121, -121, -121, -121, -120, -120, -120, -120, -119, -119, -119, -119, -118, -118, -118, -117, -117, -116, -116, -116, -115, -115, -114, -114, -114, -113, -113, -112, -112, -111, -111, -110, -109, -109, -108, -108, -107, -106, -106, -105, -104, -103, -103, -102, -101, -100, -99, -98, -98, -97, -96, -95, -94, -93, -92, -91, -89, -88, -87, -86, -85, -84, -82, -81, -80, -78, -77, -76, -74, -73, -71, -70, -68, -67, -65, -63, -62, -60, -58, -57, -55, -53, -51, -49, -48, -46, -44, -42, -40, -38, -36, -34, -32, -30, -28, -26, -24, -22, -19, -17, -15, -13, -11, -9, -7, -4, -2, 0, 2, 4, 7, 9, 11, 13, 15, 17, 19, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 49, 51, 53, 55, 57, 58, 60, 62, 63, 65, 67, 68, 70, 71, 73, 74, 76, 77, 78, 80, 81, 82, 84, 85, 86, 87, 88, 89, 91, 92, 93, 94, 95, 96, 97, 98, 98, 99, 100, 101, 102, 103, 103, 104, 105, 106, 106, 107, 108, 108, 109, 109, 110, 111, 111, 112, 112, 113, 113, 114, 114, 114, 115, 115, 116, 116, 116, 117, 117, 118, 118, 118, 119, 119, 119, 119, 120, 120, 120, 120, 121, 121, 121, 121, 122, 122, 122, 122, 122], "head": {"shift": 16, "tuples_len": 3, "tuples": [[5, -124], [11, -123], [16, -122]]}, "tail": {"shift": 20, "tuples_len": 3, "tuples": [[250, 125], [242, 124], [236, 123]]}, "depth": 3, "min_reduce": 0, "asymmetric": false, "description": "Reduced LUT of depth 3 with 0 minimum reduce"}}}], "outputs": [{"scale": 0.0078125, "zero_point": 0, "tensor": {"shape": [1, 8], "dtype": "INT8", "name": "sequential_14/dense_108/Tanh", "tensor": null}}]}, {"description": "FULLY_CONNECTED", "op_type": "FULLY_CONNECTED", "name": "FULLY_CONNECTED", "inputs": [{"scale": 0.0078125, "zero_point": 0, "tensor": {"shape": [1, 8], "dtype": "INT8", "name": "sequential_14/dense_108/Tanh", "tensor": null}}, {"scale": 0.006607015151530504, "zero_point": 0, "tensor": {"shape": [1, 8], "dtype": "INT8", "name": "sequential_14/dense_109/MatMul", "tensor": [[-90, 112, 109, -103, -55, -127, 48, 89]]}}, {"scale": 5.1617305871332064e-05, "zero_point": 0, "tensor": {"shape": [1], "dtype": "INT32", "name": "sequential_14/dense_109/BiasAdd/ReadVariableOp", "tensor": [-717]}}], "outputs": [{"scale": 0.02119051106274128, "zero_point": 60, "tensor": {"shape": [1, 1], "dtype": "INT8", "name": "sequential_14/dense_109/MatMul;sequential_14/dense_109/BiasAdd", "tensor": null}}]}, {"description": "LOGISTIC", "op_type": "SIGMOIDLUT", "name": "SIGMOIDLUT", "inputs": [{"scale": 0.02119051106274128, "zero_point": 60, "tensor": {"shape": [1, 1], "dtype": "INT8", "name": "sequential_14/dense_109/MatMul;sequential_14/dense_109/BiasAdd", "tensor": null}, "LUT": {"LUT": [-123, -123, -123, -123, -123, -123, -123, -123, -122, -122, -122, -122, -122, -122, -122, -122, -121, -121, -121, -121, -121, -121, -121, -120, -120, -120, -120, -120, -120, -119, -119, -119, -119, -119, -119, -118, -118, -118, -118, -118, -117, -117, -117, -117, -116, -116, -116, -116, -115, -115, -115, -115, -114, -114, -114, -114, -113, -113, -113, -112, -112, -112, -111, -111, -111, -110, -110, -110, -109, -109, -109, -108, -108, -107, -107, -107, -106, -106, -105, -105, -104, -104, -104, -103, -103, -102, -102, -101, -101, -100, -99, -99, -98, -98, -97, -97, -96, -96, -95, -94, -94, -93, -92, -92, -91, -90, -90, -89, -88, -88, -87, -86, -85, -85, -84, -83, -82, -81, -81, -80, -79, -78, -77, -76, -76, -75, -74, -73, -72, -71, -70, -69, -68, -67, -66, -65, -64, -63, -62, -61, -60, -59, -58, -57, -56, -55, -53, -52, -51, -50, -49, -48, -47, -45, -44, -43, -42, -41, -39, -38, -37, -36, -34, -33, -32, -31, -29, -28, -27, -25, -24, -23, -21, -20, -19, -18, -16, -15, -14, -12, -11, -9, -8, -7, -5, -4, -3, -1, 0, 1, 3, 4, 5, 7, 8, 9, 11, 12, 14, 15, 16, 18, 19, 20, 21, 23, 24, 25, 27, 28, 29, 31, 32, 33, 34, 36, 37, 38, 39, 41, 42, 43, 44, 45, 47, 48, 49, 50, 51, 52, 53, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 76, 77, 78], "offset": 128, "reduced_LUT": {"reduced_lut_len": 229, "reduced_lut": [-120, -120, -120, -120, -120, -120, -119, -119, -119, -119, -119, -119, -118, -118, -118, -118, -118, -117, -117, -117, -117, -116, -116, -116, -116, -115, -115, -115, -115, -114, -114, -114, -114, -113, -113, -113, -112, -112, -112, -111, -111, -111, -110, -110, -110, -109, -109, -109, -108, -108, -107, -107, -107, -106, -106, -105, -105, -104, -104, -104, -103, -103, -102, -102, -101, -101, -100, -99, -99, -98, -98, -97, -97, -96, -96, -95, -94, -94, -93, -92, -92, -91, -90, -90, -89, -88, -88, -87, -86, -85, -85, -84, -83, -82, -81, -81, -80, -79, -78, -77, -76, -76, -75, -74, -73, -72, -71, -70, -69, -68, -67, -66, -65, -64, -63, -62, -61, -60, -59, -58, -57, -56, -55, -53, -52, -51, -50, -49, -48, -47, -45, -44, -43, -42, -41, -39, -38, -37, -36, -34, -33, -32, -31, -29, -28, -27, -25, -24, -23, -21, -20, -19, -18, -16, -15, -14, -12, -11, -9, -8, -7, -5, -4, -3, -1, 0, 1, 3, 4, 5, 7, 8, 9, 11, 12, 14, 15, 16, 18, 19, 20, 21, 23, 24, 25, 27, 28, 29, 31, 32, 33, 34, 36, 37, 38, 39, 41, 42, 43, 44, 45, 47, 48, 49, 50, 51, 52, 53, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75], "head": {"shift": 23, "tuples_len": 3, "tuples": [[8, -123], [16, -122], [23, -121]]}, "tail": {"shift": 4, "tuples_len": 3, "tuples": [[255, 78], [254, 77], [252, 76]]}, "depth": 3, "min_reduce": 0, "asymmetric": false, "description": "Reduced LUT of depth 3 with 0 minimum reduce"}}}], "outputs": [{"scale": 0.00390625, "zero_point": -128, "tensor": {"shape": [1, 1], "dtype": "INT8", "name": "StatefulPartitionedCall:01", "tensor": null}}]}, {"description": "DEQUANTIZE", "op_type": "DEQUANTIZE", "name": "DEQUANTIZE", "inputs": [{"scale": 0.00390625, "zero_point": -128, "tensor": {"shape": [1, 1], "dtype": "INT8", "name": "StatefulPartitionedCall:01", "tensor": null}}], "outputs": [{"scale": null, "zero_point": null, "tensor": {"shape": [1, 1], "dtype": "FLOAT32", "name": "StatefulPartitionedCall:0", "tensor": null}}]}], "operators": 14, "input": [{"scale": null, "zero_point": null, "tensor": {"shape": [1, 5], "dtype": "FLOAT32", "name": "serving_default_input_15:0", "tensor": null}}], "output": [{"scale": null, "zero_point": null, "tensor": {"shape": [1, 1], "dtype": "FLOAT32", "name": "StatefulPartitionedCall:0", "tensor": null}}]}