{"ir_version": 4, "engine": "ONNX", "graph": [{"op_type": "QuantizeLinear", "name": "QuantizeLinear", "inputs": [{"scale": 0.003921568859368563, "zero_point": 0, "tensor": null}], "outputs": [], "description": "Casts a float value into uint8"}, {"op_type": "QLinearMatMul", "name": "QLinearMatMul", "inputs": [{"scale": 0.003921568859368563, "zero_point": 0, "tensor": null}, {"scale": 0.0053586517460644245, "zero_point": 154, "tensor": {"shape": [5, 784], "dtype": "uint8", "tensor": [[147, 164, 166, 159, 144, 163, 150, 160, 150, 163, 140, 155, 154, 139, 162, 144, 144, 154, 151, 144, 138, 169, 144, 142, 144, 140, 154, 162, 144, 148, 161, 160, 131, 113, 99, 111, 129, 153, 124, 130, 126, 179, 121, 133, 158, 182, 126, 137, 164, 166, 183, 160, 142, 151, 166, 144, 167, 157, 144, 179, 124, 166, 175, 119, 154, 205, 180, 149, 165, 123, 171, 125, 167, 151, 140, 133, 154, 165, 136, 168, 202, 208, 163, 157, 143, 165, 167, 162, 146, 129, 151, 154, 154, 183, 150, 161, 152, 159, 143, 143, 155, 169, 130, 166, 136, 146, 130, 148, 167, 135, 150, 168, 144, 144, 160, 162, 153, 128, 170, 146, 177, 150, 151, 166, 149, 160, 143, 151, 140, 154, 137, 146, 156, 158, 157, 164, 142, 141, 120, 187, 142, 166, 121, 127, 145, 148, 162, 146, 175, 160, 156, 154, 160, 157, 153, 152, 146, 161, 161, 145, 141, 144, 147, 135, 170, 124, 120, 176, 155, 115, 164, 148, 173, 163, 171, 154, 153, 173, 154, 158, 153, 142, 161, 156, 156, 149, 164, 150, 153, 168, 151, 140, 100, 80, 88, 130, 162, 170, 201, 175, 163, 152, 180, 156, 157, 148, 163, 160, 155, 156, 140, 151, 161, 163, 154, 159, 150, 160, 149, 132, 104, 59, 92, 95, 153, 174, 179, 175, 154, 148, 144, 166, 159, 156, 153, 159, 153, 154, 158, 169, 146, 153, 147, 152, 140, 149, 138, 161, 100, 60, 76, 121, 149, 189, 160, 165, 175, 173, 152, 138, 149, 157, 165, 150, 169, 161, 162, 158, 172, 162, 168, 160, 163, 138, 141, 142, 111, 62, 64, 146, 170, 170, 169, 181, 148, 175, 162, 171, 151, 160, 148, 164, 160, 161, 153, 151, 170, 166, 162, 163, 167, 160, 146, 145, 103, 56, 66, 128, 160, 218, 196, 176, 161, 168, 168, 141, 148, 150, 169, 145, 145, 142, 118, 148, 153, 157, 156, 163, 166, 167, 165, 172, 129, 92, 116, 130, 146, 208, 224, 182, 176, 148, 144, 164, 154, 140, 139, 156, 145, 126, 110, 131, 163, 160, 148, 157, 148, 169, 212, 211, 255, 205, 175, 153, 135, 186, 214, 171, 169, 144, 160, 148, 150, 148, 160, 160, 135, 118, 138, 134, 153, 156, 144, 151, 154, 165, 186, 188, 248, 212, 185, 164, 137, 181, 186, 152, 178, 137, 161, 180, 149, 148, 150, 160, 142, 133, 121, 145, 153, 150, 166, 166, 168, 169, 154, 169, 184, 213, 181, 183, 171, 131, 122, 173, 198, 200, 186, 181, 182, 147, 154, 149, 127, 116, 133, 149, 155, 163, 158, 162, 163, 170, 152, 134, 129, 215, 211, 178, 200, 119, 125, 139, 183, 167, 178, 189, 177, 182, 156, 153, 145, 131, 152, 159, 170, 158, 151, 161, 167, 155, 166, 146, 152, 254, 218, 180, 167, 136, 137, 139, 144, 163, 150, 167, 172, 192, 178, 178, 151, 142, 152, 168, 159, 171, 164, 160, 145, 141, 148, 144, 158, 243, 187, 188, 157, 153, 160, 109, 160, 150, 137, 153, 158, 169, 176, 173, 182, 151, 152, 157, 155, 155, 157, 156, 166, 157, 156, 146, 172, 214, 156, 167, 124, 194, 182, 134, 178, 157, 169, 152, 149, 136, 143, 168, 164, 152, 158, 162, 146, 150, 149, 147, 142, 149, 154, 138, 170, 176, 132, 143, 144, 200, 184, 162, 162, 163, 146, 158, 149, 150, 159, 152, 167, 159, 157, 155, 153, 154, 148, 150, 156, 158, 128, 134, 199, 166, 138, 153, 124, 151, 141, 155, 142, 142, 149, 142, 148, 155, 148, 159, 157, 158, 147, 139, 158, 142, 139, 161, 145, 145, 155, 166, 201, 177, 181, 148, 116, 98, 151, 150, 143, 162, 155, 159, 161, 147, 160, 152, 161, 154, 146, 159, 142, 142, 151, 141, 135, 159, 143, 146, 210, 177, 110, 165, 142, 169, 106, 115, 127, 148, 157, 160, 152, 157, 147, 160, 158, 150, 157, 149, 145, 146, 138, 152, 155, 168, 193, 137, 152, 176, 96, 161, 163, 152, 161, 113, 144, 163, 160, 132, 147, 151, 145, 137, 146, 151, 154, 158, 141, 149, 151, 150, 163, 153, 152, 148, 159, 149, 189, 152, 162, 166, 128, 165, 181, 183, 173, 162, 146, 147, 131, 151, 148, 153, 147, 158, 152, 151, 151, 143, 141, 145, 119, 90, 126, 141, 196, 149, 139, 159, 164, 133, 164, 215, 214, 186, 206, 175, 186, 175, 160, 170, 177, 175, 173, 192, 174, 151, 156, 142, 149, 119, 184, 159, 143, 142, 161, 141, 165, 168, 149, 156, 180, 185, 196, 209, 210, 176, 167, 187, 171, 166, 197, 197, 172, 213, 195, 180, 186, 162, 157, 166, 138, 163], [162, 153, 139, 160, 143, 150, 163, 147, 143, 145, 167, 159, 140, 130, 142, 128, 151, 144, 168, 161, 165, 141, 153, 166, 152, 143, 163, 165, 159, 162, 142, 143, 156, 130, 122, 140, 112, 103, 130, 185, 160, 162, 119, 103, 101, 120, 103, 129, 106, 130, 116, 141, 169, 159, 143, 153, 157, 145, 126, 165, 146, 124, 117, 125, 74, 61, 95, 103, 126, 100, 106, 133, 134, 144, 117, 138, 130, 121, 127, 110, 90, 127, 153, 161, 165, 149, 153, 125, 142, 170, 122, 156, 159, 144, 145, 158, 165, 144, 170, 162, 158, 165, 153, 152, 157, 153, 160, 129, 152, 175, 163, 150, 141, 178, 173, 138, 163, 164, 166, 168, 165, 157, 147, 165, 157, 154, 157, 159, 146, 154, 162, 156, 146, 168, 159, 188, 199, 203, 156, 130, 154, 165, 116, 200, 169, 167, 164, 161, 162, 165, 166, 164, 150, 157, 144, 148, 151, 147, 153, 150, 163, 156, 166, 166, 163, 185, 137, 136, 140, 179, 150, 178, 168, 175, 179, 151, 156, 168, 163, 161, 156, 160, 164, 150, 162, 168, 162, 160, 163, 154, 165, 161, 180, 168, 197, 147, 155, 169, 137, 190, 181, 164, 165, 161, 156, 162, 151, 162, 162, 160, 168, 156, 164, 159, 170, 155, 167, 149, 157, 162, 175, 181, 161, 171, 144, 140, 165, 182, 172, 161, 158, 137, 159, 158, 157, 157, 153, 147, 160, 163, 161, 152, 164, 150, 161, 165, 157, 160, 199, 174, 157, 147, 165, 160, 169, 159, 168, 149, 153, 153, 158, 146, 164, 154, 159, 163, 147, 171, 165, 165, 156, 166, 164, 146, 163, 144, 197, 178, 146, 187, 147, 155, 173, 179, 151, 156, 153, 147, 142, 149, 156, 155, 152, 152, 152, 160, 171, 156, 171, 148, 172, 161, 147, 165, 195, 223, 195, 159, 165, 139, 204, 217, 152, 137, 144, 143, 155, 153, 149, 168, 164, 159, 148, 156, 162, 163, 154, 152, 148, 151, 155, 120, 128, 174, 204, 165, 164, 155, 183, 158, 164, 150, 148, 165, 160, 172, 170, 163, 172, 153, 138, 147, 151, 167, 152, 153, 151, 119, 130, 123, 109, 118, 158, 120, 157, 197, 139, 166, 158, 170, 173, 175, 168, 152, 165, 160, 159, 160, 145, 140, 153, 154, 152, 156, 154, 158, 145, 110, 119, 150, 117, 126, 113, 172, 153, 165, 216, 196, 179, 169, 183, 176, 161, 137, 152, 146, 142, 152, 155, 161, 165, 154, 156, 153, 144, 148, 136, 160, 126, 102, 161, 185, 138, 174, 206, 180, 149, 164, 155, 145, 153, 156, 153, 132, 128, 146, 150, 154, 158, 153, 164, 153, 168, 175, 142, 116, 187, 115, 174, 176, 128, 158, 193, 170, 155, 147, 133, 141, 148, 141, 144, 150, 130, 142, 159, 159, 163, 168, 168, 165, 163, 161, 153, 121, 153, 145, 168, 166, 136, 163, 172, 169, 160, 151, 132, 134, 120, 125, 138, 132, 132, 158, 151, 170, 163, 157, 158, 163, 158, 158, 134, 114, 156, 117, 158, 160, 188, 172, 162, 158, 162, 143, 138, 137, 134, 131, 128, 131, 145, 158, 169, 161, 164, 160, 155, 160, 151, 130, 124, 111, 180, 102, 143, 162, 150, 181, 165, 159, 171, 161, 155, 138, 137, 139, 141, 141, 159, 147, 147, 146, 157, 153, 161, 157, 157, 142, 164, 124, 108, 140, 169, 170, 166, 171, 163, 160, 146, 129, 151, 144, 153, 142, 153, 151, 147, 152, 156, 164, 143, 162, 139, 141, 138, 144, 114, 171, 122, 169, 152, 149, 191, 168, 160, 152, 156, 152, 158, 150, 142, 157, 139, 151, 143, 140, 153, 133, 152, 140, 150, 140, 154, 126, 135, 132, 103, 159, 126, 163, 166, 147, 144, 134, 146, 142, 153, 138, 152, 151, 158, 147, 154, 157, 150, 151, 137, 152, 146, 144, 137, 157, 174, 175, 159, 169, 168, 144, 149, 200, 150, 140, 155, 162, 156, 154, 161, 157, 151, 146, 153, 154, 154, 144, 153, 134, 144, 129, 141, 162, 197, 180, 131, 140, 170, 164, 184, 234, 206, 188, 181, 168, 165, 156, 156, 167, 144, 169, 149, 146, 146, 163, 135, 140, 163, 150, 151, 199, 130, 121, 127, 168, 146, 146, 166, 203, 174, 201, 204, 198, 192, 187, 168, 178, 170, 175, 161, 164, 167, 173, 184, 211, 196, 205, 192, 218, 176, 155, 143, 141, 170, 141, 144, 162, 187, 201, 175, 192, 177, 199, 170, 154, 182, 180, 199, 185, 204, 179, 198, 208, 220, 236, 188, 124, 156, 149, 168, 142, 166, 165, 141, 161, 160, 154, 161, 140, 114, 130, 126, 153, 180, 154, 154, 165, 110, 162, 165, 126, 170, 197, 170, 153, 148, 152, 158, 145], [157, 162, 149, 147, 159, 167, 166, 153, 158, 143, 165, 155, 141, 147, 163, 169, 167, 149, 164, 153, 165, 159, 142, 140, 160, 143, 147, 156, 166, 158, 155, 163, 154, 134, 127, 140, 124, 114, 86, 125, 138, 149, 197, 196, 155, 117, 87, 122, 103, 129, 114, 134, 138, 143, 154, 160, 154, 169, 125, 126, 100, 146, 115, 104, 101, 59, 98, 98, 93, 99, 90, 127, 88, 106, 129, 98, 127, 110, 118, 109, 117, 107, 161, 157, 142, 158, 143, 104, 97, 154, 99, 50, 91, 52, 68, 82, 35, 32, 50, 91, 91, 113, 137, 129, 122, 143, 151, 128, 107, 133, 131, 166, 159, 170, 184, 118, 155, 162, 132, 121, 126, 126, 154, 155, 146, 152, 159, 144, 156, 151, 147, 151, 154, 152, 159, 160, 168, 142, 143, 116, 161, 147, 115, 138, 120, 158, 143, 169, 144, 162, 139, 152, 157, 155, 155, 151, 144, 144, 144, 155, 145, 151, 157, 143, 152, 151, 140, 151, 151, 135, 139, 137, 154, 175, 161, 141, 162, 145, 158, 152, 150, 154, 148, 165, 150, 158, 157, 157, 151, 150, 169, 164, 149, 169, 146, 141, 157, 117, 171, 160, 134, 131, 156, 147, 159, 153, 150, 161, 153, 160, 145, 155, 163, 155, 153, 148, 161, 160, 137, 165, 164, 154, 151, 117, 143, 128, 191, 157, 161, 161, 150, 161, 157, 171, 150, 147, 155, 159, 161, 148, 150, 151, 163, 156, 151, 157, 151, 152, 155, 170, 151, 151, 149, 162, 159, 173, 138, 161, 176, 155, 154, 149, 166, 157, 158, 151, 150, 156, 151, 157, 154, 158, 154, 155, 158, 157, 144, 151, 157, 186, 160, 192, 129, 141, 147, 141, 156, 164, 160, 162, 170, 162, 165, 155, 141, 154, 153, 160, 154, 166, 154, 158, 169, 143, 137, 118, 115, 164, 197, 172, 132, 125, 156, 171, 152, 178, 177, 179, 159, 163, 158, 148, 167, 181, 153, 163, 170, 151, 163, 165, 164, 163, 143, 143, 132, 143, 181, 162, 167, 129, 164, 178, 183, 161, 151, 162, 159, 155, 158, 156, 167, 175, 170, 165, 168, 175, 166, 176, 168, 167, 136, 156, 148, 152, 124, 156, 147, 146, 179, 170, 172, 180, 158, 158, 146, 153, 157, 160, 169, 176, 166, 160, 166, 167, 166, 169, 187, 139, 123, 157, 161, 136, 150, 178, 147, 160, 163, 136, 149, 142, 149, 145, 153, 160, 154, 160, 161, 173, 162, 172, 158, 166, 171, 144, 145, 146, 119, 175, 110, 150, 190, 194, 130, 155, 162, 132, 153, 148, 162, 152, 156, 161, 151, 158, 174, 175, 167, 171, 166, 155, 145, 159, 156, 141, 124, 127, 127, 138, 193, 178, 135, 125, 124, 133, 154, 156, 159, 157, 157, 147, 165, 153, 164, 163, 161, 160, 158, 145, 148, 141, 144, 135, 127, 96, 118, 113, 144, 162, 135, 120, 141, 128, 136, 164, 164, 167, 153, 162, 163, 175, 175, 161, 159, 158, 139, 140, 147, 144, 146, 160, 164, 126, 167, 115, 172, 152, 145, 109, 117, 138, 144, 141, 156, 163, 163, 168, 153, 163, 154, 153, 142, 139, 148, 144, 146, 148, 144, 131, 120, 133, 189, 157, 122, 140, 118, 119, 128, 141, 144, 137, 141, 139, 137, 137, 144, 139, 149, 142, 147, 139, 140, 150, 136, 134, 141, 139, 103, 135, 160, 153, 139, 129, 138, 102, 101, 144, 134, 140, 139, 135, 135, 138, 131, 144, 134, 144, 145, 149, 141, 152, 148, 141, 130, 134, 149, 160, 174, 127, 153, 159, 132, 90, 110, 136, 150, 133, 140, 142, 151, 134, 146, 134, 153, 137, 148, 140, 142, 140, 159, 154, 147, 123, 152, 139, 116, 138, 150, 132, 134, 141, 163, 155, 140, 162, 144, 139, 151, 153, 141, 143, 151, 149, 152, 155, 145, 143, 132, 134, 142, 136, 160, 150, 129, 145, 145, 142, 129, 87, 117, 141, 138, 155, 150, 151, 148, 142, 152, 151, 145, 144, 141, 152, 153, 132, 144, 131, 141, 139, 153, 132, 104, 165, 151, 144, 175, 125, 147, 158, 155, 141, 161, 130, 152, 156, 138, 146, 143, 146, 154, 142, 151, 175, 160, 166, 148, 166, 117, 119, 111, 160, 149, 148, 148, 163, 156, 187, 144, 171, 157, 164, 154, 154, 155, 158, 156, 160, 156, 171, 161, 154, 206, 205, 134, 163, 152, 161, 109, 141, 152, 146, 149, 183, 146, 195, 189, 193, 169, 198, 158, 165, 171, 159, 197, 158, 156, 183, 177, 156, 173, 151, 157, 172, 204, 137, 141, 157, 151, 149, 158, 145, 144, 149, 162, 150, 114, 144, 198, 165, 164, 151, 179, 191, 175, 150, 182, 194, 187, 180, 169, 170, 163, 160, 143, 148], [147, 146, 162, 162, 145, 141, 146, 155, 165, 168, 164, 147, 137, 162, 173, 153, 142, 167, 145, 156, 165, 151, 156, 138, 160, 144, 149, 156, 155, 141, 145, 168, 143, 140, 126, 136, 115, 139, 119, 105, 97, 133, 165, 148, 155, 140, 110, 109, 111, 147, 139, 121, 143, 158, 165, 152, 163, 150, 138, 119, 118, 134, 112, 104, 120, 176, 140, 137, 146, 150, 152, 141, 156, 136, 149, 131, 134, 125, 124, 164, 181, 184, 160, 150, 150, 144, 133, 120, 116, 181, 146, 161, 144, 145, 153, 154, 175, 162, 166, 177, 167, 166, 169, 147, 157, 155, 144, 132, 113, 174, 129, 158, 140, 179, 176, 171, 141, 163, 171, 156, 177, 182, 171, 173, 174, 171, 171, 160, 162, 154, 154, 157, 161, 155, 137, 126, 129, 124, 144, 124, 156, 159, 143, 169, 189, 199, 178, 177, 154, 164, 165, 156, 162, 160, 160, 167, 153, 143, 156, 150, 140, 149, 150, 150, 158, 117, 150, 149, 168, 183, 159, 223, 160, 159, 172, 166, 178, 161, 165, 167, 152, 161, 155, 168, 164, 159, 164, 146, 156, 142, 140, 120, 140, 103, 162, 150, 157, 206, 178, 194, 195, 171, 168, 150, 147, 163, 152, 161, 158, 173, 157, 152, 161, 157, 144, 150, 156, 145, 148, 133, 93, 61, 157, 162, 162, 186, 194, 155, 200, 154, 164, 170, 146, 153, 149, 156, 163, 156, 169, 163, 150, 159, 162, 163, 158, 152, 161, 113, 24, 68, 157, 141, 143, 207, 220, 193, 208, 171, 160, 162, 153, 162, 154, 146, 155, 155, 188, 175, 171, 162, 166, 150, 148, 160, 175, 125, 11, 92, 155, 155, 136, 199, 182, 196, 168, 163, 178, 151, 138, 132, 131, 123, 132, 143, 176, 180, 169, 170, 154, 167, 158, 160, 163, 131, 0, 142, 170, 184, 157, 163, 153, 195, 131, 140, 124, 121, 120, 116, 137, 134, 139, 121, 164, 173, 163, 167, 168, 158, 166, 157, 159, 155, 56, 150, 149, 175, 182, 165, 168, 134, 123, 112, 82, 127, 131, 151, 138, 132, 126, 141, 166, 160, 156, 153, 151, 156, 151, 136, 121, 87, 105, 209, 161, 198, 154, 125, 195, 117, 133, 94, 124, 133, 151, 141, 151, 139, 141, 148, 175, 152, 163, 161, 159, 155, 148, 141, 113, 111, 147, 182, 187, 172, 128, 139, 160, 159, 172, 119, 145, 147, 153, 159, 144, 142, 146, 151, 169, 154, 153, 153, 161, 150, 144, 155, 146, 131, 127, 185, 193, 207, 154, 157, 167, 169, 175, 175, 166, 149, 147, 146, 137, 150, 155, 172, 155, 165, 158, 157, 152, 162, 147, 147, 151, 152, 175, 172, 221, 188, 178, 177, 181, 167, 188, 183, 165, 147, 138, 153, 158, 152, 158, 160, 163, 145, 150, 158, 166, 153, 159, 158, 168, 176, 169, 193, 223, 170, 150, 157, 173, 156, 169, 172, 154, 154, 142, 130, 123, 136, 152, 163, 159, 155, 149, 161, 145, 152, 150, 159, 156, 152, 154, 187, 230, 151, 172, 180, 173, 196, 167, 154, 153, 155, 146, 149, 147, 141, 143, 151, 165, 164, 156, 152, 159, 158, 157, 172, 164, 155, 168, 167, 199, 174, 137, 161, 148, 169, 166, 154, 150, 162, 148, 147, 147, 151, 147, 153, 156, 153, 150, 155, 157, 153, 156, 147, 159, 161, 147, 198, 205, 160, 157, 145, 140, 172, 183, 158, 157, 162, 162, 162, 164, 147, 144, 143, 155, 147, 157, 156, 159, 160, 162, 154, 147, 159, 167, 172, 178, 134, 146, 184, 165, 160, 170, 162, 166, 163, 154, 153, 154, 149, 146, 142, 149, 148, 157, 139, 157, 157, 158, 148, 150, 152, 139, 168, 151, 145, 156, 178, 200, 183, 171, 159, 173, 165, 155, 156, 151, 156, 142, 149, 139, 155, 155, 150, 153, 151, 155, 144, 152, 145, 163, 142, 150, 167, 158, 159, 146, 146, 160, 167, 169, 156, 155, 153, 155, 153, 140, 158, 145, 147, 138, 152, 151, 154, 144, 140, 151, 152, 154, 140, 171, 168, 163, 146, 188, 154, 179, 168, 167, 167, 151, 152, 154, 156, 156, 149, 166, 146, 150, 152, 132, 129, 142, 136, 144, 136, 182, 163, 187, 164, 167, 149, 182, 128, 166, 178, 157, 160, 175, 173, 157, 160, 166, 161, 163, 158, 150, 153, 150, 153, 126, 137, 105, 98, 118, 145, 167, 163, 156, 143, 143, 149, 133, 165, 181, 153, 165, 186, 178, 180, 150, 163, 167, 176, 179, 176, 158, 170, 151, 149, 187, 149, 156, 142, 157, 169, 160, 165, 158, 139, 147, 165, 169, 172, 216, 202, 202, 190, 163, 213, 190, 184, 184, 176, 144, 191, 130, 118, 163, 196, 141, 140, 144, 144], [165, 169, 149, 164, 141, 161, 170, 143, 138, 165, 145, 156, 145, 154, 148, 137, 155, 163, 146, 147, 156, 158, 146, 148, 139, 168, 149, 145, 159, 163, 149, 143, 160, 166, 155, 148, 166, 153, 167, 108, 129, 124, 140, 135, 90, 115, 156, 155, 167, 164, 176, 193, 138, 148, 143, 161, 156, 161, 147, 120, 124, 193, 128, 137, 168, 142, 130, 163, 144, 170, 182, 172, 175, 144, 123, 170, 167, 152, 177, 109, 125, 132, 138, 152, 144, 139, 144, 111, 155, 178, 182, 146, 128, 163, 154, 156, 149, 161, 181, 185, 157, 175, 195, 193, 170, 166, 200, 179, 124, 120, 163, 149, 152, 153, 156, 141, 170, 183, 178, 163, 161, 161, 167, 140, 153, 146, 147, 143, 153, 153, 142, 162, 161, 179, 178, 188, 154, 118, 134, 153, 151, 155, 148, 148, 184, 156, 179, 154, 175, 165, 155, 140, 146, 136, 146, 154, 149, 144, 153, 147, 145, 165, 154, 187, 182, 102, 139, 170, 145, 158, 146, 167, 186, 157, 177, 172, 149, 152, 141, 147, 139, 135, 134, 137, 136, 136, 136, 155, 140, 149, 160, 170, 177, 128, 149, 126, 167, 143, 150, 165, 159, 163, 130, 157, 150, 154, 144, 152, 141, 149, 140, 132, 145, 148, 145, 147, 147, 149, 149, 155, 169, 144, 169, 139, 150, 136, 152, 127, 170, 142, 159, 139, 140, 149, 145, 157, 133, 142, 148, 142, 135, 151, 143, 150, 149, 142, 136, 137, 154, 161, 148, 120, 144, 130, 164, 129, 145, 142, 143, 147, 149, 149, 144, 147, 156, 142, 139, 149, 147, 142, 154, 142, 148, 154, 153, 144, 131, 133, 129, 122, 154, 141, 111, 122, 135, 152, 148, 148, 146, 149, 148, 137, 144, 122, 119, 149, 144, 147, 143, 155, 136, 140, 155, 123, 149, 150, 116, 138, 157, 103, 96, 133, 135, 150, 147, 142, 144, 144, 148, 138, 148, 130, 149, 157, 149, 154, 155, 146, 157, 151, 138, 145, 125, 117, 112, 167, 148, 113, 92, 154, 144, 135, 138, 148, 147, 158, 163, 161, 172, 182, 160, 154, 155, 141, 152, 155, 148, 165, 138, 132, 138, 127, 113, 149, 142, 105, 129, 170, 133, 159, 174, 167, 166, 159, 174, 170, 171, 171, 154, 167, 160, 168, 151, 162, 146, 173, 160, 158, 145, 158, 116, 133, 146, 153, 118, 177, 179, 168, 169, 175, 165, 180, 166, 172, 172, 153, 167, 164, 169, 161, 171, 164, 162, 144, 176, 139, 151, 148, 135, 109, 147, 156, 137, 191, 171, 173, 173, 169, 171, 165, 158, 170, 162, 167, 168, 163, 166, 160, 156, 165, 156, 152, 153, 153, 151, 154, 166, 162, 145, 168, 143, 162, 161, 165, 163, 168, 169, 151, 167, 158, 158, 170, 175, 169, 162, 168, 167, 159, 166, 170, 157, 153, 162, 192, 189, 166, 155, 181, 168, 130, 163, 152, 161, 168, 149, 161, 166, 161, 153, 177, 175, 163, 158, 160, 158, 152, 168, 162, 165, 182, 152, 168, 190, 134, 123, 191, 136, 183, 157, 151, 154, 153, 159, 157, 152, 154, 160, 174, 168, 164, 165, 146, 157, 158, 156, 166, 156, 178, 171, 154, 185, 146, 164, 121, 155, 213, 149, 144, 136, 149, 145, 145, 148, 163, 154, 153, 165, 162, 160, 159, 150, 158, 151, 148, 138, 133, 141, 127, 136, 177, 160, 116, 154, 173, 119, 115, 141, 142, 149, 138, 139, 158, 143, 154, 152, 159, 165, 153, 159, 126, 140, 139, 110, 100, 108, 134, 186, 151, 192, 193, 168, 153, 112, 148, 128, 131, 148, 146, 159, 151, 157, 155, 158, 149, 148, 166, 152, 149, 143, 132, 142, 147, 130, 146, 142, 159, 176, 176, 180, 184, 120, 145, 131, 134, 146, 139, 140, 146, 131, 147, 141, 151, 143, 139, 143, 144, 143, 144, 143, 140, 129, 163, 201, 152, 139, 169, 167, 147, 156, 156, 153, 148, 158, 145, 144, 140, 144, 143, 131, 139, 138, 147, 155, 145, 162, 168, 158, 149, 162, 189, 191, 157, 145, 167, 146, 153, 175, 167, 163, 157, 141, 166, 150, 155, 144, 143, 150, 151, 160, 144, 155, 166, 142, 165, 151, 163, 128, 205, 201, 140, 147, 138, 179, 170, 153, 143, 141, 148, 139, 123, 137, 143, 138, 146, 142, 135, 132, 137, 133, 123, 144, 150, 140, 163, 114, 170, 179, 158, 156, 138, 150, 181, 143, 117, 146, 126, 140, 130, 143, 121, 139, 127, 121, 135, 122, 137, 122, 144, 138, 141, 120, 138, 119, 141, 163, 150, 153, 161, 148, 154, 141, 134, 143, 112, 100, 101, 104, 135, 154, 100, 124, 157, 152, 142, 159, 132, 185, 152, 157, 108, 159, 139, 147, 158]]}}, {"scale": 0.05834893882274628, "zero_point": 150, "tensor": null}], "outputs": [], "description": "Quantized Matrix Multiplication Node"}, {"op_type": "QLinearAdd", "name": "QLinearAdd", "inputs": [{"scale": 0.05834893882274628, "zero_point": 150, "tensor": null}, {"scale": 0.0015328848967328668, "zero_point": 83, "tensor": {"shape": [5], "dtype": "uint8", "tensor": [89, 255, 0, 21, 187]}}, {"scale": 0.058881718665361404, "zero_point": 151, "tensor": null}], "outputs": [], "description": ""}, {"op_type": "TanhLUT", "name": "TanhLUT", "inputs": [{"scale": null, "tensor": null, "zero_point": null, "LUT": {"LUT": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 4, 4, 5, 5, 6, 6, 7, 8, 9, 10, 11, 12, 13, 15, 16, 18, 20, 23, 25, 28, 31, 34, 38, 42, 46, 50, 55, 61, 66, 72, 78, 85, 92, 99, 106, 113, 121, 128, 135, 143, 150, 157, 164, 171, 178, 184, 190, 195, 201, 206, 210, 214, 218, 222, 225, 228, 231, 233, 236, 238, 240, 241, 243, 244, 245, 246, 247, 248, 249, 250, 250, 251, 251, 252, 252, 253, 253, 253, 253, 254, 254, 254, 254, 254, 254, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255], "offset": 0, "reduced_LUT": {"reduced_lut_len": 79, "reduced_lut": [3, 3, 3, 3, 4, 4, 5, 5, 6, 6, 7, 8, 9, 10, 11, 12, 13, 15, 16, 18, 20, 23, 25, 28, 31, 34, 38, 42, 46, 50, 55, 61, 66, 72, 78, 85, 92, 99, 106, 113, 121, 128, 135, 143, 150, 157, 164, 171, 178, 184, 190, 195, 201, 206, 210, 214, 218, 222, 225, 228, 231, 233, 236, 238, 240, 241, 243, 244, 245, 246, 247, 248, 249, 250, 250, 251, 251, 252, 252], "head": {"shift": 110, "tuples_len": 3, "tuples": [[41, 0], [104, 1], [110, 2]]}, "tail": {"shift": 67, "tuples_len": 3, "tuples": [[199, 255], [193, 254], [189, 253]]}, "depth": 3, "min_reduce": 10, "asymmetric": false, "description": "Reduced LUT of depth 3 with 10 minimum reduce"}}}], "outputs": [], "description": "Includes a LUT for tanh"}, {"op_type": "QLinearMatMul", "name": "QLinearMatMul", "inputs": [{"scale": 0.00784310046583414, "zero_point": 128, "tensor": null}, {"scale": 0.0053385174833238125, "zero_point": 122, "tensor": {"shape": [32, 5], "dtype": "uint8", "tensor": [[69, 137, 240, 170, 22], [136, 212, 190, 76, 35], [83, 182, 210, 115, 137], [137, 205, 67, 124, 29], [179, 117, 120, 40, 214], [127, 184, 55, 72, 144], [168, 189, 96, 158, 41], [67, 35, 190, 174, 84], [190, 85, 196, 88, 228], [169, 48, 206, 27, 135], [63, 192, 164, 173, 169], [196, 129, 47, 73, 216], [45, 0, 253, 36, 94], [90, 174, 111, 128, 218], [100, 207, 159, 84, 98], [28, 128, 42, 52, 161], [52, 90, 133, 181, 227], [90, 80, 43, 72, 164], [186, 34, 156, 138, 61], [217, 45, 129, 62, 23], [158, 70, 137, 255, 217], [211, 152, 193, 187, 210], [40, 68, 54, 20, 44], [202, 200, 209, 70, 119], [117, 197, 63, 39, 169], [103, 155, 17, 246, 53], [27, 118, 234, 95, 23], [39, 144, 166, 212, 214], [192, 201, 217, 57, 213], [228, 85, 50, 120, 75], [145, 141, 207, 203, 33], [168, 211, 157, 231, 49]]}}, {"scale": 0.01712208241224289, "zero_point": 129, "tensor": null}], "outputs": [], "description": "Quantized Matrix Multiplication Node"}, {"op_type": "QLinearAdd", "name": "QLinearAdd", "inputs": [{"scale": 0.01712208241224289, "zero_point": 129, "tensor": null}, {"scale": 0.0017296670703217387, "zero_point": 99, "tensor": {"shape": [32], "dtype": "uint8", "tensor": [65, 153, 68, 187, 95, 119, 0, 58, 115, 255, 68, 70, 129, 189, 108, 62, 147, 139, 59, 75, 63, 82, 90, 67, 75, 63, 91, 172, 31, 150, 144, 155]}}, {"scale": 0.017320986837148666, "zero_point": 127, "tensor": null}], "outputs": [], "description": ""}, {"op_type": "TanhLUT", "name": "TanhLUT", "inputs": [{"scale": null, "tensor": null, "zero_point": null, "LUT": {"LUT": [0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3, 3, 3, 3, 4, 4, 4, 4, 5, 5, 5, 5, 6, 6, 6, 7, 7, 7, 8, 8, 9, 9, 9, 10, 10, 11, 11, 12, 12, 13, 13, 14, 14, 15, 16, 16, 17, 18, 18, 19, 20, 20, 21, 22, 23, 24, 25, 25, 26, 27, 28, 29, 30, 31, 32, 33, 35, 36, 37, 38, 39, 41, 42, 43, 44, 46, 47, 49, 50, 52, 53, 55, 56, 58, 60, 61, 63, 65, 66, 68, 70, 72, 74, 76, 78, 80, 81, 83, 86, 88, 90, 92, 94, 96, 98, 100, 102, 105, 107, 109, 111, 113, 116, 118, 120, 122, 125, 127, 129, 132, 134, 136, 138, 141, 143, 145, 147, 149, 152, 154, 156, 158, 160, 162, 164, 166, 168, 171, 173, 174, 176, 178, 180, 182, 184, 186, 188, 189, 191, 193, 194, 196, 198, 199, 201, 202, 204, 205, 207, 208, 210, 211, 212, 213, 215, 216, 217, 218, 219, 221, 222, 223, 224, 225, 226, 227, 228, 229, 229, 230, 231, 232, 233, 234, 234, 235, 236, 236, 237, 238, 238, 239, 240, 240, 241, 241, 242, 242, 243, 243, 244, 244, 245, 245, 245, 246, 246, 247, 247, 247, 248, 248, 248, 249, 249, 249, 249, 250, 250, 250, 250, 251, 251, 251, 251, 252, 252, 252, 252, 252, 253, 253, 253, 253, 253, 253, 253, 254, 254, 254, 254, 254, 254, 254, 254, 255], "offset": 0, "reduced_LUT": {"reduced_lut_len": 220, "reduced_lut": [3, 3, 3, 3, 4, 4, 4, 4, 5, 5, 5, 5, 6, 6, 6, 7, 7, 7, 8, 8, 9, 9, 9, 10, 10, 11, 11, 12, 12, 13, 13, 14, 14, 15, 16, 16, 17, 18, 18, 19, 20, 20, 21, 22, 23, 24, 25, 25, 26, 27, 28, 29, 30, 31, 32, 33, 35, 36, 37, 38, 39, 41, 42, 43, 44, 46, 47, 49, 50, 52, 53, 55, 56, 58, 60, 61, 63, 65, 66, 68, 70, 72, 74, 76, 78, 80, 81, 83, 86, 88, 90, 92, 94, 96, 98, 100, 102, 105, 107, 109, 111, 113, 116, 118, 120, 122, 125, 127, 129, 132, 134, 136, 138, 141, 143, 145, 147, 149, 152, 154, 156, 158, 160, 162, 164, 166, 168, 171, 173, 174, 176, 178, 180, 182, 184, 186, 188, 189, 191, 193, 194, 196, 198, 199, 201, 202, 204, 205, 207, 208, 210, 211, 212, 213, 215, 216, 217, 218, 219, 221, 222, 223, 224, 225, 226, 227, 228, 229, 229, 230, 231, 232, 233, 234, 234, 235, 236, 236, 237, 238, 238, 239, 240, 240, 241, 241, 242, 242, 243, 243, 244, 244, 245, 245, 245, 246, 246, 247, 247, 247, 248, 248, 248, 249, 249, 249, 249, 250, 250, 250, 250, 251, 251, 251, 251, 252, 252, 252, 252, 252], "head": {"shift": 20, "tuples_len": 3, "tuples": [[8, 0], [15, 1], [20, 2]]}, "tail": {"shift": 16, "tuples_len": 3, "tuples": [[255, 255], [247, 254], [240, 253]]}, "depth": 3, "min_reduce": 10, "asymmetric": false, "description": "Reduced LUT of depth 3 with 10 minimum reduce"}}}], "outputs": [], "description": "Includes a LUT for tanh"}, {"op_type": "QLinearMatMul", "name": "QLinearMatMul", "inputs": [{"scale": 0.007656028028577566, "zero_point": 127, "tensor": null}, {"scale": 0.005431412253528833, "zero_point": 120, "tensor": {"shape": [64, 32], "dtype": "uint8", "tensor": [[147, 121, 95, 157, 55, 53, 53, 206, 125, 100, 129, 91, 111, 134, 112, 163, 157, 122, 149, 90, 136, 83, 110, 39, 33, 180, 114, 199, 88, 152, 118, 157], [132, 111, 69, 119, 94, 109, 94, 150, 60, 132, 69, 87, 92, 39, 108, 149, 74, 140, 158, 197, 76, 108, 153, 112, 117, 169, 146, 89, 66, 116, 80, 106], [151, 190, 200, 119, 123, 103, 123, 157, 83, 168, 139, 42, 193, 106, 202, 134, 164, 76, 119, 71, 42, 144, 132, 142, 70, 53, 150, 135, 149, 96, 139, 116], [132, 73, 75, 173, 51, 118, 158, 136, 54, 109, 87, 127, 56, 51, 63, 64, 145, 106, 172, 114, 128, 109, 130, 101, 55, 209, 148, 133, 34, 149, 156, 167], [71, 143, 89, 206, 126, 154, 144, 35, 79, 44, 152, 139, 15, 155, 91, 124, 121, 150, 75, 109, 91, 113, 90, 107, 170, 174, 87, 128, 141, 167, 96, 174], [60, 62, 98, 95, 164, 129, 92, 55, 115, 177, 91, 158, 101, 129, 99, 172, 159, 176, 126, 168, 92, 134, 189, 122, 130, 145, 100, 67, 125, 164, 114, 90], [186, 169, 167, 120, 148, 76, 117, 153, 181, 114, 49, 148, 103, 66, 103, 65, 83, 107, 118, 212, 53, 94, 102, 138, 137, 128, 160, 68, 142, 139, 175, 170], [74, 147, 96, 155, 117, 173, 90, 49, 80, 145, 20, 183, 109, 131, 87, 110, 52, 139, 143, 170, 63, 116, 149, 89, 127, 77, 47, 86, 101, 222, 92, 82], [183, 112, 158, 114, 100, 136, 141, 86, 128, 111, 112, 84, 164, 158, 167, 137, 106, 108, 126, 68, 105, 104, 92, 150, 107, 93, 144, 129, 129, 87, 173, 114], [118, 141, 157, 142, 160, 102, 137, 86, 164, 120, 127, 96, 106, 134, 131, 148, 106, 74, 68, 103, 67, 159, 134, 179, 107, 47, 96, 97, 129, 74, 78, 85], [96, 140, 94, 164, 101, 199, 186, 127, 74, 65, 160, 176, 49, 83, 169, 142, 75, 112, 34, 105, 130, 103, 160, 96, 188, 166, 158, 73, 138, 82, 135, 149], [63, 108, 59, 190, 189, 221, 104, 84, 74, 128, 57, 149, 111, 166, 90, 183, 35, 177, 88, 86, 128, 101, 150, 121, 148, 121, 141, 27, 76, 157, 37, 59], [122, 104, 82, 151, 122, 93, 108, 107, 92, 146, 135, 98, 85, 124, 77, 110, 120, 103, 164, 168, 136, 106, 78, 150, 144, 154, 55, 78, 114, 162, 168, 156], [103, 81, 141, 96, 124, 65, 86, 105, 176, 175, 59, 133, 145, 68, 42, 112, 121, 135, 121, 165, 212, 154, 65, 88, 78, 122, 112, 150, 118, 188, 155, 152], [77, 38, 132, 146, 97, 143, 98, 91, 94, 43, 166, 112, 83, 169, 95, 156, 196, 127, 120, 73, 216, 159, 76, 42, 102, 134, 46, 191, 96, 91, 94, 74], [119, 124, 136, 48, 86, 110, 53, 172, 154, 115, 168, 141, 182, 85, 74, 64, 179, 135, 139, 110, 124, 158, 126, 116, 49, 53, 171, 125, 136, 88, 100, 122], [71, 165, 128, 107, 188, 161, 110, 113, 135, 186, 107, 199, 115, 157, 163, 96, 160, 119, 95, 104, 163, 191, 67, 117, 132, 115, 94, 160, 176, 141, 117, 158], [107, 74, 57, 109, 85, 129, 186, 132, 133, 143, 27, 135, 70, 50, 121, 73, 105, 172, 115, 172, 171, 82, 104, 146, 113, 104, 60, 43, 150, 199, 125, 171], [69, 171, 149, 124, 130, 113, 147, 108, 116, 158, 144, 154, 129, 113, 83, 43, 105, 84, 98, 157, 143, 177, 125, 183, 60, 150, 101, 161, 97, 169, 158, 194], [64, 120, 118, 125, 121, 117, 65, 87, 139, 73, 176, 155, 82, 204, 60, 138, 187, 198, 62, 69, 161, 104, 173, 40, 145, 128, 46, 140, 92, 93, 102, 116], [166, 177, 108, 109, 134, 89, 175, 111, 166, 109, 136, 142, 145, 102, 143, 115, 90, 86, 166, 182, 74, 161, 144, 176, 89, 113, 138, 68, 154, 136, 147, 134], [69, 125, 122, 112, 118, 158, 155, 133, 67, 110, 111, 160, 122, 104, 115, 186, 67, 199, 101, 164, 48, 29, 221, 98, 152, 108, 176, 102, 96, 164, 124, 118], [138, 135, 102, 136, 161, 124, 51, 122, 152, 166, 112, 90, 152, 162, 119, 127, 135, 195, 59, 79, 99, 107, 99, 104, 93, 89, 87, 154, 81, 150, 127, 57], [71, 126, 89, 125, 149, 130, 144, 138, 130, 77, 79, 147, 136, 97, 137, 164, 103, 99, 86, 146, 108, 115, 169, 170, 186, 92, 130, 122, 152, 130, 123, 76], [87, 160, 128, 171, 129, 81, 192, 115, 142, 138, 69, 96, 98, 116, 99, 106, 71, 86, 182, 199, 121, 175, 138, 103, 97, 134, 81, 97, 90, 207, 177, 187], [65, 133, 161, 89, 208, 153, 92, 109, 202, 222, 153, 106, 144, 179, 132, 183, 135, 112, 60, 138, 110, 98, 125, 182, 186, 60, 129, 159, 156, 112, 73, 111], [98, 70, 112, 85, 96, 93, 124, 109, 91, 180, 91, 110, 145, 137, 103, 147, 125, 168, 150, 158, 68, 92, 186, 86, 100, 117, 130, 71, 102, 110, 94, 81], [114, 133, 128, 170, 147, 127, 96, 143, 115, 129, 82, 136, 110, 135, 148, 86, 132, 72, 156, 111, 161, 164, 71, 100, 73, 176, 112, 127, 107, 164, 177, 110], [181, 183, 125, 118, 64, 149, 152, 80, 162, 129, 157, 84, 81, 155, 100, 112, 92, 34, 139, 96, 168, 158, 43, 142, 113, 102, 170, 121, 129, 90, 146, 161], [81, 89, 147, 108, 152, 139, 22, 158, 157, 208, 93, 112, 201, 121, 140, 168, 92, 90, 77, 149, 134, 156, 99, 105, 172, 56, 142, 136, 191, 65, 156, 68], [131, 77, 81, 141, 128, 97, 96, 149, 98, 101, 128, 171, 124, 101, 52, 72, 112, 108, 173, 147, 171, 173, 103, 106, 91, 101, 61, 76, 96, 195, 128, 94], [161, 86, 143, 89, 64, 0, 42, 186, 166, 153, 92, 101, 206, 94, 104, 99, 182, 63, 197, 183, 108, 90, 88, 92, 79, 53, 189, 157, 78, 111, 164, 146], [145, 176, 153, 106, 96, 109, 145, 93, 178, 120, 167, 171, 70, 198, 142, 126, 162, 161, 71, 54, 81, 114, 97, 130, 122, 135, 65, 191, 147, 108, 149, 143], [172, 90, 148, 140, 48, 100, 157, 122, 52, 88, 113, 66, 112, 84, 111, 119, 182, 83, 73, 41, 137, 129, 136, 31, 111, 160, 169, 199, 77, 103, 127, 113], [148, 88, 118, 130, 98, 124, 115, 98, 146, 138, 69, 151, 130, 167, 63, 87, 170, 160, 103, 140, 186, 98, 86, 148, 94, 155, 61, 97, 127, 160, 162, 111], [150, 112, 166, 42, 171, 85, 105, 201, 149, 179, 154, 155, 209, 147, 75, 83, 165, 157, 127, 141, 120, 178, 106, 122, 60, 31, 148, 136, 122, 50, 156, 63], [145, 119, 94, 101, 100, 129, 120, 88, 139, 134, 137, 123, 141, 167, 172, 176, 176, 102, 82, 93, 124, 71, 87, 78, 169, 85, 100, 176, 110, 33, 137, 81], [139, 131, 87, 132, 81, 105, 133, 166, 117, 183, 93, 119, 151, 112, 116, 115, 151, 153, 179, 129, 101, 66, 155, 67, 106, 133, 152, 78, 122, 86, 127, 69], [83, 75, 167, 140, 116, 111, 108, 58, 75, 43, 181, 117, 50, 172, 93, 157, 123, 107, 26, 41, 100, 150, 103, 62, 177, 117, 138, 107, 72, 83, 74, 123], [124, 158, 200, 149, 111, 154, 90, 132, 138, 115, 130, 123, 70, 148, 124, 93, 150, 125, 85, 35, 103, 121, 103, 164, 87, 84, 160, 176, 189, 108, 169, 94], [99, 149, 118, 83, 75, 164, 134, 158, 127, 116, 59, 124, 157, 70, 77, 179, 151, 181, 114, 168, 41, 22, 225, 35, 168, 140, 130, 102, 43, 105, 87, 44], [98, 78, 112, 68, 161, 120, 102, 124, 117, 144, 136, 154, 122, 156, 55, 149, 166, 191, 148, 82, 190, 141, 95, 85, 109, 139, 145, 156, 150, 90, 74, 111], [73, 41, 107, 68, 115, 63, 103, 137, 104, 148, 137, 122, 80, 141, 49, 95, 147, 102, 99, 115, 205, 160, 92, 105, 145, 164, 78, 156, 111, 148, 143, 85], [148, 93, 148, 184, 79, 91, 145, 141, 100, 88, 176, 78, 128, 145, 171, 136, 78, 58, 141, 144, 83, 151, 112, 91, 61, 197, 175, 111, 79, 109, 198, 174], [78, 88, 146, 75, 137, 67, 129, 128, 93, 87, 123, 155, 93, 92, 95, 129, 186, 156, 108, 151, 200, 163, 113, 79, 43, 104, 128, 105, 105, 135, 148, 167], [56, 121, 128, 148, 138, 198, 116, 71, 87, 115, 121, 120, 130, 155, 96, 179, 112, 165, 45, 123, 118, 149, 109, 124, 209, 71, 73, 126, 89, 71, 114, 85], [70, 52, 122, 91, 65, 89, 137, 156, 88, 110, 145, 74, 73, 100, 99, 147, 180, 162, 157, 68, 165, 149, 113, 23, 75, 198, 111, 182, 95, 113, 112, 108], [73, 164, 101, 73, 185, 165, 155, 54, 166, 149, 102, 178, 61, 186, 172, 125, 134, 68, 146, 109, 173, 183, 73, 200, 105, 67, 59, 97, 110, 98, 160, 126], [75, 175, 100, 121, 127, 182, 103, 97, 140, 110, 99, 171, 112, 188, 137, 128, 66, 171, 56, 47, 156, 85, 67, 124, 157, 159, 84, 163, 154, 87, 70, 176], [136, 142, 101, 94, 164, 142, 92, 85, 80, 128, 45, 152, 143, 71, 105, 165, 66, 116, 111, 191, 90, 86, 120, 131, 110, 151, 139, 23, 71, 137, 73, 101], [25, 85, 125, 64, 132, 164, 112, 76, 176, 115, 123, 186, 41, 109, 73, 157, 127, 101, 114, 141, 144, 105, 74, 161, 149, 162, 16, 131, 91, 140, 54, 82], [107, 127, 141, 44, 157, 87, 110, 149, 183, 117, 74, 185, 189, 102, 131, 184, 110, 165, 122, 117, 80, 119, 143, 124, 170, 65, 75, 97, 156, 62, 72, 37], [98, 75, 71, 124, 131, 129, 84, 171, 143, 116, 126, 155, 159, 174, 95, 136, 194, 114, 102, 106, 192, 137, 116, 107, 108, 83, 96, 190, 109, 143, 117, 99], [192, 139, 103, 64, 126, 111, 146, 141, 131, 129, 127, 69, 151, 72, 68, 127, 94, 81, 192, 179, 133, 157, 154, 85, 83, 50, 144, 97, 171, 176, 185, 162], [131, 114, 140, 95, 125, 172, 95, 58, 123, 49, 184, 170, 82, 188, 138, 164, 120, 167, 53, 71, 163, 65, 118, 57, 122, 186, 125, 174, 117, 99, 71, 139], [67, 169, 96, 153, 87, 167, 136, 71, 117, 121, 145, 127, 148, 111, 133, 86, 131, 126, 114, 94, 66, 132, 131, 169, 145, 168, 148, 104, 133, 174, 107, 159], [169, 92, 134, 120, 150, 51, 85, 198, 158, 88, 134, 58, 179, 129, 87, 88, 209, 105, 58, 35, 119, 156, 114, 69, 45, 127, 118, 216, 63, 97, 112, 136], [178, 95, 190, 138, 96, 81, 166, 171, 120, 147, 202, 78, 81, 150, 165, 114, 144, 69, 136, 141, 92, 131, 124, 157, 154, 141, 127, 155, 181, 74, 168, 169], [137, 178, 137, 187, 127, 167, 88, 74, 115, 157, 149, 73, 109, 117, 186, 97, 86, 140, 130, 135, 103, 80, 157, 167, 167, 89, 182, 151, 113, 85, 176, 144], [84, 160, 87, 100, 227, 126, 79, 55, 255, 138, 138, 217, 120, 174, 101, 122, 107, 104, 142, 68, 176, 206, 89, 97, 154, 57, 59, 111, 216, 136, 52, 58], [64, 39, 72, 59, 132, 145, 108, 118, 93, 69, 105, 169, 95, 163, 77, 89, 178, 134, 163, 116, 220, 153, 111, 146, 145, 193, 33, 193, 114, 157, 99, 141], [92, 126, 55, 176, 119, 111, 110, 154, 92, 114, 36, 155, 176, 73, 130, 127, 101, 176, 161, 158, 93, 84, 196, 72, 65, 118, 99, 62, 102, 198, 153, 64], [100, 45, 57, 140, 126, 57, 147, 207, 77, 94, 102, 152, 119, 140, 25, 107, 192, 143, 202, 74, 142, 160, 59, 48, 50, 185, 128, 137, 114, 110, 142, 144], [128, 164, 149, 157, 131, 80, 132, 160, 120, 117, 104, 85, 147, 97, 129, 61, 84, 83, 117, 150, 114, 171, 88, 174, 134, 62, 99, 159, 195, 64, 114, 172]]}}, {"scale": 0.029193375259637833, "zero_point": 126, "tensor": null}], "outputs": [], "description": "Quantized Matrix Multiplication Node"}, {"op_type": "QLinearAdd", "name": "QLinearAdd", "inputs": [{"scale": 0.029193375259637833, "zero_point": 126, "tensor": null}, {"scale": 0.0027861231938004494, "zero_point": 136, "tensor": {"shape": [64], "dtype": "uint8", "tensor": [208, 136, 183, 158, 170, 150, 92, 220, 130, 97, 0, 184, 185, 184, 104, 126, 130, 166, 225, 188, 142, 150, 193, 95, 151, 171, 130, 233, 139, 208, 163, 100, 203, 96, 188, 94, 147, 143, 102, 197, 124, 127, 108, 202, 141, 136, 136, 177, 198, 100, 83, 97, 135, 40, 139, 255, 220, 76, 177, 163, 108, 130, 132, 170]}}, {"scale": 0.029838241636753082, "zero_point": 126, "tensor": null}], "outputs": [], "description": ""}, {"op_type": "TanhLUT", "name": "TanhLUT", "inputs": [{"scale": null, "tensor": null, "zero_point": null, "LUT": {"LUT": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 4, 4, 4, 5, 5, 5, 6, 6, 6, 7, 7, 8, 8, 9, 9, 10, 10, 11, 12, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 25, 26, 28, 29, 31, 32, 34, 36, 38, 40, 42, 44, 46, 49, 51, 53, 56, 59, 62, 64, 67, 70, 73, 77, 80, 83, 87, 90, 94, 97, 101, 104, 108, 112, 116, 119, 123, 127, 131, 135, 138, 142, 146, 150, 153, 157, 160, 164, 167, 171, 174, 177, 181, 184, 187, 190, 192, 195, 198, 201, 203, 205, 208, 210, 212, 214, 216, 218, 220, 222, 223, 225, 226, 228, 229, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 242, 243, 244, 244, 245, 245, 246, 246, 247, 247, 248, 248, 248, 249, 249, 249, 250, 250, 250, 251, 251, 251, 251, 251, 252, 252, 252, 252, 252, 252, 252, 253, 253, 253, 253, 253, 253, 253, 253, 253, 253, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 255, 255], "offset": 0, "reduced_LUT": {"reduced_lut_len": 154, "reduced_lut": [3, 3, 3, 3, 3, 4, 4, 4, 5, 5, 5, 6, 6, 6, 7, 7, 8, 8, 9, 9, 10, 10, 11, 12, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 25, 26, 28, 29, 31, 32, 34, 36, 38, 40, 42, 44, 46, 49, 51, 53, 56, 59, 62, 64, 67, 70, 73, 77, 80, 83, 87, 90, 94, 97, 101, 104, 108, 112, 116, 119, 123, 127, 131, 135, 138, 142, 146, 150, 153, 157, 160, 164, 167, 171, 174, 177, 181, 184, 187, 190, 192, 195, 198, 201, 203, 205, 208, 210, 212, 214, 216, 218, 220, 222, 223, 225, 226, 228, 229, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 242, 243, 244, 244, 245, 245, 246, 246, 247, 247, 248, 248, 248, 249, 249, 249, 250, 250, 250, 251, 251, 251, 251, 251, 252, 252, 252, 252, 252, 252, 252], "head": {"shift": 53, "tuples_len": 3, "tuples": [[36, 0], [46, 1], [53, 2]]}, "tail": {"shift": 49, "tuples_len": 3, "tuples": [[254, 255], [217, 254], [207, 253]]}, "depth": 3, "min_reduce": 10, "asymmetric": false, "description": "Reduced LUT of depth 3 with 10 minimum reduce"}}}], "outputs": [], "description": "Includes a LUT for tanh"}, {"op_type": "QLinearMatMul", "name": "QLinearMatMul", "inputs": [{"scale": 0.007835324853658676, "zero_point": 127, "tensor": null}, {"scale": 0.005200953688472509, "zero_point": 133, "tensor": {"shape": [32, 64], "dtype": "uint8", "tensor": [[137, 156, 148, 109, 107, 95, 235, 141, 114, 167, 142, 47, 196, 155, 121, 139, 202, 158, 137, 57, 207, 187, 104, 151, 179, 135, 85, 130, 192, 206, 99, 181, 174, 134, 59, 97, 111, 106, 91, 159, 167, 149, 67, 154, 75, 97, 142, 183, 100, 170, 99, 180, 114, 203, 56, 122, 139, 135, 200, 168, 49, 156, 38, 131], [138, 180, 137, 241, 210, 130, 156, 209, 144, 99, 174, 200, 123, 68, 98, 48, 94, 124, 183, 86, 120, 206, 162, 176, 184, 43, 159, 95, 159, 66, 175, 125, 93, 145, 126, 29, 123, 170, 116, 127, 172, 108, 81, 121, 157, 203, 124, 110, 138, 220, 166, 167, 94, 76, 119, 143, 108, 149, 172, 52, 91, 181, 168, 154], [128, 89, 142, 150, 83, 124, 160, 115, 185, 196, 93, 47, 93, 128, 132, 213, 220, 123, 97, 124, 166, 55, 173, 180, 116, 144, 113, 128, 197, 187, 86, 110, 153, 170, 88, 210, 196, 130, 166, 255, 99, 121, 109, 154, 96, 120, 148, 111, 184, 105, 107, 97, 184, 106, 142, 89, 97, 225, 195, 104, 83, 93, 103, 163], [226, 148, 193, 166, 131, 148, 117, 167, 121, 77, 89, 97, 170, 107, 177, 116, 105, 97, 168, 137, 113, 189, 147, 130, 98, 125, 134, 189, 60, 177, 166, 150, 166, 169, 154, 185, 193, 161, 109, 149, 175, 121, 93, 94, 175, 96, 185, 151, 136, 95, 147, 109, 182, 102, 109, 175, 228, 59, 134, 107, 117, 136, 207, 133], [192, 114, 144, 80, 132, 86, 200, 120, 166, 195, 152, 136, 155, 69, 86, 160, 126, 86, 130, 84, 147, 157, 96, 118, 181, 118, 77, 114, 130, 106, 89, 174, 126, 157, 126, 84, 103, 114, 100, 192, 90, 115, 120, 146, 133, 110, 144, 71, 139, 81, 66, 91, 84, 199, 134, 171, 124, 215, 138, 200, 89, 88, 105, 204], [126, 185, 169, 136, 110, 184, 141, 105, 178, 139, 114, 166, 70, 93, 123, 186, 66, 131, 151, 224, 132, 107, 216, 122, 72, 170, 187, 100, 89, 199, 66, 160, 101, 141, 140, 193, 191, 123, 123, 122, 210, 139, 112, 102, 96, 195, 150, 115, 135, 162, 186, 187, 188, 69, 124, 144, 97, 137, 144, 130, 170, 168, 103, 157], [102, 142, 128, 220, 89, 77, 141, 105, 138, 133, 104, 86, 153, 119, 169, 154, 65, 211, 106, 92, 139, 148, 85, 172, 200, 106, 194, 124, 74, 126, 173, 202, 33, 143, 122, 126, 71, 222, 57, 99, 178, 113, 128, 131, 136, 152, 165, 144, 59, 161, 129, 151, 176, 200, 97, 97, 123, 93, 82, 0, 191, 212, 136, 104], [94, 173, 111, 150, 53, 149, 160, 94, 69, 158, 106, 114, 134, 89, 92, 204, 90, 136, 76, 139, 137, 195, 200, 131, 138, 124, 160, 130, 69, 114, 94, 178, 136, 137, 164, 195, 100, 169, 140, 100, 198, 172, 105, 59, 131, 148, 107, 149, 114, 159, 199, 171, 111, 163, 153, 91, 199, 115, 98, 136, 101, 199, 91, 150], [197, 188, 146, 156, 80, 73, 186, 184, 140, 105, 112, 161, 137, 139, 74, 173, 160, 136, 192, 67, 174, 91, 74, 104, 180, 89, 88, 137, 154, 177, 171, 183, 104, 177, 166, 177, 71, 97, 148, 96, 99, 129, 127, 205, 112, 71, 106, 119, 78, 151, 90, 90, 98, 156, 80, 80, 106, 167, 137, 95, 155, 188, 169, 186], [143, 113, 124, 188, 98, 220, 158, 184, 61, 123, 89, 153, 197, 149, 124, 56, 163, 150, 154, 133, 148, 169, 173, 149, 156, 176, 106, 126, 141, 138, 179, 94, 107, 31, 199, 49, 75, 169, 96, 165, 141, 131, 161, 138, 85, 118, 102, 205, 93, 228, 155, 153, 127, 146, 81, 207, 96, 73, 63, 152, 206, 115, 140, 120], [150, 94, 69, 119, 100, 98, 151, 97, 97, 141, 100, 66, 124, 211, 169, 150, 208, 187, 190, 145, 136, 53, 173, 80, 177, 124, 140, 149, 174, 206, 181, 185, 146, 195, 215, 206, 99, 132, 87, 108, 72, 148, 164, 129, 153, 102, 124, 184, 122, 57, 156, 105, 185, 197, 133, 133, 138, 140, 92, 140, 146, 75, 172, 126], [148, 105, 121, 115, 77, 185, 52, 92, 109, 159, 119, 121, 141, 208, 139, 190, 187, 118, 66, 224, 89, 99, 215, 132, 56, 205, 157, 110, 69, 147, 107, 178, 146, 76, 199, 141, 200, 165, 55, 177, 160, 189, 165, 62, 122, 163, 164, 108, 138, 128, 131, 191, 177, 134, 130, 100, 166, 124, 92, 102, 204, 105, 158, 88], [207, 171, 160, 105, 61, 97, 135, 95, 125, 98, 53, 89, 133, 101, 176, 154, 176, 83, 79, 94, 90, 96, 164, 110, 96, 144, 122, 165, 92, 115, 172, 216, 115, 165, 96, 169, 175, 106, 107, 158, 147, 159, 141, 165, 168, 90, 196, 126, 135, 130, 108, 171, 93, 186, 96, 73, 167, 163, 146, 107, 180, 163, 175, 135], [141, 119, 46, 215, 202, 123, 118, 103, 71, 136, 214, 182, 135, 71, 151, 85, 109, 126, 86, 199, 127, 152, 99, 168, 111, 91, 130, 131, 139, 57, 140, 152, 88, 188, 72, 126, 85, 143, 203, 91, 211, 164, 130, 96, 137, 172, 131, 90, 117, 176, 190, 127, 125, 64, 198, 127, 145, 126, 124, 66, 179, 100, 106, 126], [76, 116, 92, 79, 158, 101, 191, 76, 135, 182, 163, 100, 143, 108, 99, 149, 204, 162, 150, 126, 185, 80, 104, 157, 101, 209, 82, 122, 125, 123, 180, 143, 185, 120, 205, 200, 104, 103, 72, 165, 138, 163, 126, 130, 202, 142, 101, 194, 210, 130, 158, 119, 191, 155, 94, 101, 83, 210, 98, 130, 127, 69, 109, 150], [183, 161, 137, 104, 119, 155, 78, 147, 148, 72, 170, 129, 112, 131, 195, 75, 77, 94, 62, 221, 64, 154, 136, 75, 72, 119, 123, 112, 69, 73, 96, 146, 93, 127, 106, 73, 199, 172, 175, 84, 164, 149, 181, 135, 163, 120, 153, 60, 165, 168, 129, 75, 111, 134, 197, 162, 134, 65, 75, 122, 199, 174, 195, 67], [164, 135, 76, 149, 135, 160, 169, 128, 65, 133, 179, 178, 190, 104, 169, 126, 117, 199, 200, 191, 135, 103, 87, 116, 203, 66, 85, 193, 106, 73, 118, 103, 182, 154, 126, 90, 61, 98, 168, 148, 94, 111, 118, 116, 162, 124, 139, 193, 115, 94, 180, 116, 84, 128, 142, 114, 157, 120, 170, 113, 172, 155, 184, 93], [183, 93, 101, 162, 132, 120, 93, 156, 89, 88, 110, 74, 178, 159, 145, 187, 107, 158, 119, 180, 136, 46, 146, 139, 151, 134, 122, 217, 107, 83, 196, 93, 97, 102, 228, 108, 154, 59, 149, 160, 126, 191, 217, 149, 129, 158, 196, 165, 121, 131, 192, 100, 194, 72, 184, 152, 149, 126, 153, 161, 136, 86, 208, 199], [144, 174, 81, 144, 194, 138, 91, 188, 142, 92, 154, 132, 216, 169, 163, 96, 126, 195, 196, 148, 107, 75, 77, 143, 155, 113, 109, 167, 178, 79, 180, 105, 89, 128, 152, 113, 144, 77, 158, 137, 48, 151, 110, 175, 175, 150, 154, 125, 154, 160, 134, 53, 117, 187, 153, 127, 102, 123, 109, 94, 198, 110, 214, 187], [181, 129, 159, 210, 216, 126, 173, 209, 174, 114, 125, 209, 139, 156, 148, 73, 120, 205, 159, 106, 182, 119, 146, 106, 174, 124, 146, 227, 144, 107, 113, 53, 194, 116, 150, 84, 73, 146, 145, 173, 65, 95, 104, 154, 116, 108, 163, 191, 193, 122, 107, 73, 96, 120, 157, 195, 134, 148, 152, 157, 112, 135, 168, 187], [55, 114, 98, 121, 212, 101, 70, 66, 152, 100, 173, 139, 147, 177, 211, 72, 148, 147, 181, 194, 87, 95, 126, 95, 110, 148, 73, 149, 169, 115, 163, 72, 149, 114, 207, 105, 144, 56, 174, 130, 115, 160, 157, 119, 140, 162, 143, 196, 221, 100, 223, 144, 133, 103, 164, 162, 187, 91, 89, 177, 185, 80, 188, 106], [121, 208, 143, 187, 72, 151, 169, 113, 129, 106, 179, 119, 189, 149, 149, 191, 133, 196, 178, 75, 124, 119, 51, 103, 99, 57, 117, 124, 104, 115, 109, 132, 83, 77, 154, 130, 72, 136, 80, 74, 112, 194, 192, 129, 164, 128, 131, 192, 147, 179, 125, 90, 170, 203, 116, 120, 183, 180, 69, 39, 175, 180, 203, 131], [204, 156, 201, 87, 159, 78, 136, 78, 168, 186, 194, 129, 114, 36, 139, 116, 131, 68, 139, 202, 173, 148, 156, 100, 129, 105, 118, 88, 158, 153, 89, 78, 202, 159, 120, 117, 157, 174, 172, 180, 151, 152, 124, 191, 70, 175, 207, 109, 140, 93, 67, 133, 76, 86, 166, 150, 146, 233, 162, 80, 105, 122, 174, 181], [107, 141, 123, 85, 146, 183, 97, 194, 107, 151, 84, 175, 114, 181, 201, 145, 140, 102, 127, 169, 104, 135, 138, 176, 115, 103, 187, 140, 103, 193, 129, 112, 122, 155, 176, 137, 128, 160, 183, 164, 124, 195, 116, 85, 152, 150, 107, 180, 91, 191, 91, 196, 170, 97, 182, 135, 103, 75, 73, 117, 159, 139, 185, 140], [142, 140, 95, 143, 96, 71, 121, 104, 95, 176, 98, 115, 138, 194, 175, 191, 171, 192, 159, 142, 150, 70, 124, 88, 208, 186, 86, 187, 188, 197, 96, 161, 162, 81, 184, 113, 100, 154, 65, 120, 62, 107, 189, 120, 174, 159, 133, 179, 166, 77, 137, 177, 150, 159, 72, 157, 101, 168, 129, 174, 196, 135, 102, 145], [113, 158, 96, 190, 166, 123, 130, 145, 113, 181, 84, 131, 175, 123, 74, 147, 100, 147, 134, 171, 172, 112, 115, 157, 135, 102, 100, 178, 184, 99, 74, 166, 200, 70, 160, 163, 88, 113, 160, 188, 107, 70, 173, 148, 103, 110, 96, 122, 170, 105, 183, 158, 106, 95, 98, 177, 171, 169, 203, 114, 135, 86, 155, 168], [183, 101, 146, 162, 123, 84, 144, 145, 153, 148, 45, 109, 200, 146, 63, 132, 187, 125, 215, 80, 114, 129, 180, 72, 131, 148, 174, 173, 143, 161, 153, 221, 108, 120, 172, 110, 154, 138, 84, 180, 67, 175, 158, 173, 168, 121, 107, 181, 87, 128, 130, 96, 129, 121, 108, 136, 187, 120, 126, 184, 100, 147, 123, 177], [86, 144, 113, 109, 131, 73, 103, 41, 123, 176, 118, 71, 132, 100, 191, 119, 112, 156, 91, 190, 72, 75, 125, 143, 145, 193, 64, 120, 186, 147, 80, 119, 122, 118, 120, 124, 137, 100, 119, 216, 99, 134, 154, 212, 146, 131, 191, 190, 103, 114, 136, 110, 105, 176, 153, 86, 130, 182, 187, 167, 118, 34, 187, 129], [100, 151, 127, 108, 105, 194, 172, 201, 123, 116, 118, 123, 150, 173, 104, 172, 166, 186, 180, 39, 181, 204, 99, 138, 156, 202, 164, 77, 158, 196, 166, 174, 124, 72, 125, 151, 156, 108, 82, 83, 216, 91, 160, 69, 102, 164, 54, 111, 100, 163, 163, 156, 111, 195, 82, 98, 156, 87, 114, 172, 122, 222, 126, 148], [153, 128, 198, 175, 161, 68, 98, 198, 209, 98, 165, 144, 152, 167, 139, 157, 104, 165, 82, 187, 146, 199, 114, 141, 157, 98, 176, 125, 153, 114, 114, 153, 76, 130, 91, 74, 133, 203, 100, 172, 176, 162, 133, 226, 151, 114, 179, 107, 59, 162, 92, 77, 111, 177, 70, 74, 144, 172, 102, 144, 129, 191, 245, 207], [186, 158, 146, 131, 106, 152, 144, 150, 135, 80, 88, 143, 133, 162, 123, 175, 141, 104, 163, 123, 104, 103, 192, 91, 154, 120, 96, 212, 128, 92, 147, 190, 167, 150, 152, 126, 116, 176, 137, 154, 157, 103, 112, 165, 132, 69, 232, 145, 68, 145, 72, 59, 160, 138, 115, 148, 227, 154, 170, 173, 107, 143, 186, 152], [176, 111, 51, 197, 150, 136, 127, 147, 99, 91, 141, 109, 104, 139, 170, 101, 78, 155, 87, 135, 128, 132, 171, 118, 130, 124, 180, 96, 66, 126, 180, 124, 122, 100, 157, 170, 175, 150, 132, 84, 161, 137, 196, 111, 192, 124, 172, 101, 73, 140, 215, 79, 149, 130, 113, 60, 114, 81, 47, 171, 196, 129, 129, 77]]}}, {"scale": 0.06396041065454483, "zero_point": 126, "tensor": null}], "outputs": [], "description": 