{"ir_version": 4, "engine": "ONNX", "graph": [{"op_type": "QuantizeLinear", "name": "QuantizeLinear", "inputs": [{"scale": 0.003921568859368563, "zero_point": 0, "tensor": null}], "outputs": [], "description": "Casts a float value into uint8"}, {"op_type": "QLinearMatMul", "name": "QLinearMatMul", "inputs": [{"scale": 0.003921568859368563, "zero_point": 0, "tensor": null}, {"scale": 0.010582162998616695, "zero_point": 131, "tensor": {"shape": [5, 784], "dtype": "uint8", "tensor": [[132, 130, 138, 138, 129, 124, 137, 125, 124, 127, 132, 137, 133, 122, 113, 120, 128, 127, 131, 135, 131, 125, 134, 124, 137, 128, 136, 124, 131, 135, 126, 130, 133, 137, 146, 144, 131, 141, 153, 128, 134, 111, 127, 127, 90, 125, 167, 165, 160, 153, 130, 127, 136, 136, 132, 130, 137, 126, 140, 109, 132, 156, 162, 148, 175, 181, 192, 167, 160, 162, 155, 157, 161, 162, 176, 195, 197, 173, 162, 129, 111, 113, 133, 125, 125, 137, 132, 107, 130, 132, 154, 145, 156, 153, 151, 123, 124, 115, 133, 127, 114, 119, 146, 151, 155, 164, 186, 162, 143, 123, 127, 133, 128, 130, 125, 107, 141, 125, 127, 107, 101, 107, 98, 104, 109, 106, 123, 109, 120, 126, 116, 132, 124, 135, 164, 204, 178, 165, 134, 143, 134, 137, 140, 100, 110, 102, 101, 97, 108, 113, 107, 122, 127, 105, 116, 115, 115, 132, 122, 130, 138, 132, 153, 180, 190, 175, 160, 147, 126, 121, 109, 77, 91, 101, 94, 103, 108, 119, 115, 121, 120, 108, 114, 121, 121, 123, 112, 141, 134, 127, 137, 165, 196, 197, 148, 152, 124, 112, 111, 88, 87, 93, 94, 123, 134, 124, 127, 123, 117, 122, 115, 124, 126, 128, 120, 128, 123, 130, 135, 153, 191, 187, 183, 147, 131, 114, 115, 100, 74, 101, 100, 113, 123, 122, 126, 124, 123, 118, 101, 98, 114, 114, 126, 119, 134, 137, 133, 167, 190, 255, 174, 145, 111, 113, 101, 93, 77, 97, 123, 117, 136, 127, 132, 134, 136, 121, 83, 77, 90, 112, 109, 122, 121, 138, 129, 158, 187, 226, 148, 121, 121, 103, 92, 93, 107, 123, 135, 158, 148, 159, 170, 173, 173, 155, 120, 92, 84, 100, 110, 111, 114, 118, 121, 123, 137, 204, 157, 124, 121, 115, 120, 127, 143, 190, 181, 190, 182, 171, 176, 170, 181, 181, 168, 128, 121, 127, 128, 112, 107, 114, 115, 106, 117, 163, 145, 153, 125, 152, 147, 184, 198, 213, 200, 188, 166, 162, 157, 156, 156, 175, 167, 147, 135, 134, 151, 142, 136, 138, 121, 111, 110, 118, 131, 120, 131, 147, 148, 193, 183, 176, 178, 163, 155, 147, 137, 143, 143, 154, 156, 161, 138, 134, 149, 147, 147, 132, 122, 118, 116, 121, 109, 113, 136, 148, 143, 184, 157, 130, 141, 136, 139, 132, 134, 144, 156, 164, 157, 148, 143, 134, 126, 133, 131, 118, 120, 123, 117, 136, 82, 110, 139, 131, 129, 156, 118, 90, 122, 137, 131, 138, 128, 148, 147, 153, 149, 131, 133, 140, 127, 116, 120, 117, 119, 120, 125, 120, 81, 93, 109, 120, 101, 115, 108, 93, 112, 121, 127, 132, 128, 143, 150, 147, 139, 142, 144, 124, 109, 120, 119, 121, 122, 126, 122, 98, 73, 114, 132, 114, 130, 106, 116, 111, 124, 121, 125, 140, 141, 157, 154, 146, 146, 136, 128, 122, 125, 112, 138, 114, 125, 128, 115, 81, 73, 79, 144, 110, 110, 100, 115, 121, 129, 127, 131, 136, 134, 133, 129, 124, 131, 127, 127, 121, 125, 125, 126, 107, 122, 127, 104, 73, 107, 111, 137, 117, 91, 97, 121, 132, 135, 125, 135, 126, 131, 128, 120, 127, 127, 138, 128, 126, 118, 122, 121, 128, 117, 124, 107, 44, 94, 136, 132, 111, 103, 91, 94, 115, 117, 130, 132, 120, 124, 122, 126, 133, 140, 129, 128, 131, 124, 124, 117, 117, 132, 134, 107, 77, 118, 139, 153, 116, 109, 88, 100, 126, 118, 116, 131, 129, 127, 122, 133, 132, 139, 131, 130, 133, 129, 117, 140, 128, 130, 138, 110, 73, 89, 120, 143, 138, 97, 89, 107, 126, 120, 123, 112, 121, 128, 131, 131, 122, 131, 129, 138, 136, 141, 130, 133, 129, 128, 120, 108, 107, 133, 115, 135, 138, 126, 99, 108, 122, 127, 116, 138, 125, 126, 130, 132, 136, 137, 136, 150, 145, 133, 137, 153, 133, 122, 132, 117, 127, 142, 123, 123, 131, 112, 103, 102, 107, 97, 124, 131, 132, 131, 129, 129, 118, 118, 122, 130, 140, 165, 183, 178, 159, 140, 146, 117, 120, 102, 128, 134, 139, 140, 147, 126, 102, 104, 125, 106, 111, 122, 107, 112, 124, 120, 114, 137, 143, 137, 148, 186, 179, 162, 160, 114, 134, 104, 133, 137, 137, 124, 141, 128, 152, 129, 123, 98, 124, 118, 121, 130, 136, 146, 128, 130, 133, 142, 120, 160, 168, 137, 152, 132, 132, 131, 130, 126, 127, 126, 132, 118, 116, 111, 105, 100, 107, 101, 109, 109, 68, 76, 80, 96, 69, 99, 119, 131, 142, 141, 111, 137, 126, 132, 133], [137, 135, 130, 123, 130, 127, 136, 128, 125, 138, 131, 133, 134, 131, 129, 129, 132, 138, 138, 129, 127, 127, 126, 128, 136, 138, 125, 126, 135, 126, 134, 130, 140, 129, 118, 132, 118, 146, 125, 133, 137, 133, 136, 99, 103, 125, 145, 130, 139, 138, 112, 111, 138, 133, 133, 138, 128, 127, 141, 143, 129, 143, 118, 143, 147, 128, 115, 123, 110, 92, 98, 99, 108, 106, 96, 109, 100, 108, 104, 100, 93, 114, 135, 128, 134, 123, 142, 135, 137, 101, 95, 115, 143, 104, 114, 121, 121, 109, 107, 107, 114, 110, 91, 108, 117, 132, 143, 133, 158, 151, 134, 137, 136, 144, 138, 119, 125, 96, 117, 118, 109, 118, 109, 131, 118, 106, 115, 126, 119, 134, 120, 121, 131, 144, 167, 182, 182, 158, 115, 137, 129, 128, 129, 121, 107, 101, 126, 127, 123, 122, 125, 128, 118, 124, 123, 118, 123, 133, 137, 133, 139, 140, 144, 160, 155, 132, 131, 149, 127, 137, 142, 111, 118, 121, 118, 126, 115, 121, 127, 118, 125, 122, 132, 123, 131, 127, 136, 134, 137, 132, 149, 136, 147, 122, 129, 123, 145, 119, 126, 126, 101, 113, 133, 138, 131, 132, 135, 134, 133, 129, 124, 117, 124, 139, 139, 141, 136, 135, 138, 149, 146, 147, 121, 145, 149, 166, 158, 142, 108, 120, 124, 119, 128, 127, 128, 133, 122, 120, 121, 118, 136, 131, 125, 116, 139, 129, 126, 156, 152, 149, 112, 115, 148, 178, 178, 164, 123, 130, 122, 126, 143, 129, 135, 141, 139, 139, 128, 121, 130, 129, 142, 135, 126, 128, 126, 139, 167, 161, 120, 156, 145, 175, 187, 154, 141, 147, 134, 141, 141, 152, 151, 156, 152, 160, 130, 125, 134, 137, 140, 129, 144, 139, 123, 134, 142, 177, 155, 137, 148, 175, 197, 151, 137, 128, 159, 149, 151, 146, 141, 148, 150, 144, 119, 108, 119, 116, 124, 124, 118, 126, 113, 114, 99, 131, 142, 135, 142, 158, 191, 139, 123, 142, 151, 142, 147, 138, 137, 151, 148, 141, 103, 101, 111, 117, 115, 106, 118, 114, 131, 117, 111, 92, 105, 111, 120, 148, 169, 135, 133, 148, 143, 140, 136, 130, 147, 138, 146, 123, 102, 103, 113, 119, 118, 119, 117, 126, 141, 147, 149, 104, 71, 101, 149, 126, 156, 119, 137, 145, 143, 146, 138, 139, 146, 128, 137, 113, 100, 114, 117, 122, 119, 127, 139, 136, 149, 160, 166, 127, 56, 97, 152, 137, 140, 103, 146, 123, 128, 143, 133, 145, 144, 125, 127, 92, 99, 119, 112, 123, 129, 139, 142, 129, 143, 156, 148, 112, 71, 98, 149, 149, 123, 109, 128, 122, 129, 128, 142, 128, 125, 122, 106, 84, 112, 124, 116, 128, 142, 138, 151, 144, 142, 138, 127, 83, 70, 110, 136, 150, 106, 125, 115, 129, 129, 131, 121, 119, 120, 115, 99, 101, 119, 130, 131, 147, 135, 136, 140, 145, 136, 131, 125, 92, 74, 142, 120, 157, 153, 116, 123, 122, 139, 128, 130, 122, 124, 107, 98, 111, 124, 121, 118, 136, 135, 140, 129, 136, 124, 127, 110, 87, 93, 112, 134, 153, 169, 133, 132, 128, 140, 140, 134, 126, 124, 130, 138, 122, 122, 120, 131, 127, 129, 136, 131, 126, 133, 114, 116, 82, 100, 109, 127, 143, 158, 108, 127, 135, 120, 121, 138, 129, 134, 141, 154, 141, 131, 123, 135, 128, 123, 121, 119, 126, 129, 118, 114, 98, 93, 130, 118, 156, 132, 111, 126, 137, 131, 124, 130, 126, 140, 147, 143, 136, 137, 131, 128, 124, 124, 119, 122, 131, 143, 120, 103, 111, 126, 140, 123, 141, 129, 111, 112, 120, 111, 112, 132, 129, 131, 134, 140, 143, 136, 137, 131, 129, 124, 132, 118, 125, 128, 120, 115, 129, 143, 142, 125, 138, 110, 107, 114, 118, 126, 131, 138, 130, 143, 145, 132, 135, 142, 139, 136, 142, 130, 111, 125, 122, 118, 102, 119, 124, 116, 128, 126, 127, 111, 97, 102, 130, 133, 126, 125, 137, 130, 128, 130, 138, 128, 137, 129, 136, 134, 131, 117, 119, 117, 96, 101, 103, 116, 128, 130, 131, 106, 140, 127, 135, 137, 139, 120, 125, 122, 135, 121, 129, 129, 131, 133, 123, 123, 132, 122, 131, 140, 142, 152, 117, 123, 128, 124, 134, 128, 124, 157, 188, 182, 174, 178, 149, 139, 146, 148, 135, 132, 146, 147, 132, 139, 154, 123, 120, 152, 101, 119, 143, 129, 137, 128, 130, 127, 134, 153, 149, 155, 149, 167, 165, 170, 159, 152, 182, 147, 161, 175, 196, 172, 154, 136, 132, 140, 163, 128, 125, 128, 138], [128, 126, 125, 126, 133, 132, 127, 135, 138, 134, 129, 138, 150, 142, 128, 138, 123, 123, 132, 136, 134, 129, 125, 133, 123, 126, 137, 126, 128, 127, 131, 124, 135, 124, 162, 149, 145, 143, 153, 140, 142, 143, 144, 152, 138, 139, 171, 161, 159, 159, 148, 141, 135, 134, 124, 133, 132, 135, 141, 126, 133, 155, 155, 168, 169, 175, 179, 164, 183, 191, 185, 201, 206, 184, 186, 175, 196, 173, 175, 152, 144, 132, 135, 137, 134, 124, 135, 125, 151, 158, 172, 162, 157, 149, 142, 126, 124, 127, 125, 148, 142, 155, 169, 161, 157, 159, 155, 147, 138, 127, 122, 139, 133, 130, 118, 110, 138, 135, 135, 122, 130, 124, 111, 101, 108, 117, 111, 122, 117, 122, 113, 132, 146, 155, 171, 164, 119, 91, 113, 142, 125, 131, 151, 117, 130, 119, 123, 125, 125, 119, 112, 95, 117, 110, 127, 122, 119, 121, 117, 132, 146, 161, 163, 173, 132, 69, 109, 146, 124, 127, 146, 119, 126, 111, 110, 123, 104, 105, 110, 105, 106, 99, 98, 103, 105, 102, 115, 127, 119, 132, 140, 131, 86, 55, 77, 125, 137, 110, 148, 99, 130, 134, 112, 123, 109, 111, 107, 112, 103, 104, 106, 105, 107, 121, 107, 119, 119, 122, 141, 111, 76, 38, 82, 107, 124, 121, 142, 95, 125, 126, 119, 125, 111, 111, 115, 110, 117, 124, 111, 109, 111, 119, 111, 106, 109, 120, 113, 74, 45, 30, 67, 107, 132, 128, 128, 94, 104, 100, 106, 127, 117, 105, 110, 115, 125, 126, 129, 124, 121, 118, 111, 110, 97, 110, 99, 63, 22, 28, 67, 102, 138, 140, 114, 67, 95, 104, 112, 127, 128, 114, 118, 125, 132, 134, 141, 133, 114, 112, 120, 107, 91, 98, 99, 78, 41, 34, 67, 116, 126, 121, 101, 76, 76, 120, 132, 130, 131, 118, 127, 121, 133, 126, 143, 146, 129, 126, 114, 115, 101, 114, 111, 117, 93, 55, 88, 147, 126, 115, 103, 81, 84, 126, 145, 138, 134, 138, 139, 138, 133, 131, 164, 150, 128, 128, 131, 113, 121, 135, 139, 158, 175, 107, 93, 131, 142, 123, 121, 104, 96, 126, 145, 150, 151, 142, 155, 131, 122, 140, 156, 150, 137, 137, 121, 140, 130, 149, 160, 176, 164, 129, 89, 127, 123, 136, 131, 124, 112, 115, 160, 161, 154, 150, 138, 125, 127, 148, 168, 150, 129, 121, 120, 133, 135, 146, 174, 176, 147, 144, 106, 139, 128, 144, 141, 134, 122, 130, 161, 162, 156, 145, 127, 134, 133, 154, 169, 153, 132, 131, 119, 126, 132, 147, 153, 155, 118, 126, 81, 122, 125, 140, 137, 91, 108, 117, 143, 152, 142, 149, 142, 133, 119, 145, 176, 148, 128, 108, 121, 124, 140, 147, 138, 128, 112, 125, 87, 117, 136, 147, 122, 94, 86, 90, 118, 133, 146, 147, 161, 137, 133, 158, 167, 149, 110, 101, 127, 125, 133, 132, 122, 109, 108, 107, 94, 98, 146, 141, 102, 94, 79, 65, 69, 107, 134, 146, 149, 137, 140, 150, 159, 119, 114, 118, 136, 128, 123, 127, 108, 112, 105, 96, 117, 129, 140, 119, 86, 82, 78, 54, 62, 93, 119, 136, 144, 154, 144, 144, 135, 136, 139, 136, 141, 135, 126, 118, 97, 112, 100, 91, 122, 148, 124, 106, 97, 59, 60, 70, 92, 105, 124, 124, 146, 149, 157, 149, 149, 140, 142, 143, 145, 128, 118, 110, 96, 101, 93, 95, 134, 130, 146, 111, 105, 88, 88, 106, 117, 119, 117, 121, 138, 133, 139, 141, 153, 144, 134, 144, 126, 117, 113, 115, 99, 100, 109, 111, 124, 126, 149, 138, 114, 102, 103, 157, 140, 120, 119, 113, 116, 110, 107, 108, 120, 127, 138, 149, 138, 132, 125, 105, 116, 127, 133, 127, 154, 135, 137, 131, 110, 90, 123, 155, 163, 131, 131, 123, 107, 109, 112, 119, 120, 127, 132, 144, 146, 152, 153, 132, 128, 130, 136, 133, 151, 133, 131, 134, 125, 101, 103, 145, 131, 117, 124, 130, 128, 112, 111, 104, 98, 104, 114, 118, 132, 136, 139, 149, 129, 136, 122, 140, 138, 128, 125, 124, 131, 122, 103, 109, 98, 88, 101, 104, 89, 68, 73, 84, 89, 79, 73, 62, 76, 75, 87, 91, 124, 132, 118, 134, 132, 128, 131, 125, 126, 139, 129, 116, 116, 117, 106, 120, 123, 110, 91, 82, 89, 97, 95, 93, 91, 85, 75, 96, 96, 132, 124, 131, 136, 131, 126, 136, 124, 125, 121, 116, 129, 117, 104, 117, 92, 103, 117, 105, 103, 110, 128, 111, 114, 119, 116, 125, 109, 130, 130, 130, 137, 133], [130, 138, 136, 125, 134, 133, 136, 137, 136, 136, 132, 130, 139, 130, 148, 143, 138, 125, 126, 132, 127, 132, 123, 126, 125, 125, 137, 137, 125, 130, 133, 124, 125, 132, 127, 128, 137, 125, 134, 134, 125, 140, 154, 152, 158, 154, 119, 114, 111, 123, 115, 141, 133, 135, 125, 136, 132, 135, 125, 139, 129, 117, 114, 120, 113, 98, 105, 129, 143, 127, 127, 139, 147, 119, 95, 77, 81, 89, 87, 108, 122, 134, 131, 129, 134, 138, 120, 143, 117, 133, 113, 123, 124, 105, 123, 138, 156, 144, 131, 126, 121, 113, 109, 109, 99, 105, 97, 110, 115, 147, 130, 123, 126, 140, 145, 154, 120, 146, 129, 124, 138, 134, 150, 138, 134, 129, 141, 133, 111, 113, 111, 107, 123, 137, 129, 118, 143, 144, 166, 123, 129, 136, 139, 153, 145, 154, 131, 132, 129, 118, 115, 142, 118, 138, 124, 121, 125, 110, 121, 121, 130, 151, 162, 134, 144, 155, 152, 114, 132, 142, 139, 172, 144, 126, 136, 112, 121, 122, 134, 137, 148, 150, 151, 152, 156, 145, 150, 142, 152, 145, 126, 122, 145, 152, 146, 150, 137, 147, 133, 150, 140, 130, 122, 117, 129, 129, 130, 138, 146, 152, 157, 151, 149, 147, 151, 142, 145, 135, 122, 120, 124, 136, 129, 151, 127, 133, 140, 153, 137, 127, 127, 129, 119, 125, 124, 128, 141, 145, 148, 146, 148, 139, 149, 142, 133, 137, 137, 134, 149, 143, 155, 154, 131, 151, 137, 162, 150, 137, 140, 136, 135, 131, 127, 142, 147, 148, 160, 151, 142, 142, 134, 136, 134, 133, 135, 144, 170, 193, 187, 153, 133, 144, 156, 163, 148, 133, 146, 153, 147, 139, 145, 143, 147, 156, 171, 162, 144, 139, 136, 128, 131, 139, 128, 152, 164, 181, 204, 157, 139, 138, 170, 161, 147, 140, 158, 154, 147, 134, 136, 142, 135, 175, 184, 162, 132, 130, 142, 135, 130, 113, 121, 127, 162, 189, 187, 149, 142, 139, 169, 144, 134, 141, 140, 135, 135, 130, 126, 124, 121, 161, 176, 144, 127, 140, 133, 131, 139, 129, 119, 106, 140, 183, 171, 152, 129, 140, 159, 136, 133, 126, 126, 128, 127, 120, 110, 96, 118, 147, 164, 130, 132, 127, 128, 129, 134, 128, 119, 115, 119, 139, 160, 150, 124, 133, 146, 117, 119, 113, 122, 116, 114, 119, 104, 86, 100, 144, 159, 141, 125, 133, 130, 130, 131, 132, 114, 112, 111, 118, 164, 126, 131, 125, 137, 127, 138, 119, 120, 123, 125, 116, 117, 92, 98, 143, 141, 126, 119, 120, 139, 131, 134, 127, 129, 123, 128, 127, 150, 150, 130, 144, 155, 164, 157, 116, 107, 120, 126, 127, 110, 100, 112, 134, 133, 112, 112, 113, 122, 132, 127, 128, 136, 122, 119, 133, 158, 144, 132, 149, 143, 174, 158, 119, 107, 106, 120, 128, 118, 116, 128, 128, 119, 116, 113, 118, 122, 138, 125, 130, 139, 124, 109, 138, 153, 147, 121, 154, 145, 165, 142, 123, 124, 104, 107, 109, 115, 104, 107, 112, 109, 112, 113, 123, 130, 125, 126, 129, 137, 109, 104, 121, 123, 122, 133, 135, 145, 146, 138, 129, 128, 133, 120, 119, 107, 84, 104, 119, 105, 114, 117, 129, 128, 133, 130, 108, 122, 105, 100, 119, 128, 129, 128, 136, 144, 148, 136, 152, 150, 140, 133, 124, 127, 121, 112, 121, 118, 115, 120, 119, 120, 124, 114, 118, 121, 102, 95, 117, 122, 126, 131, 137, 145, 136, 133, 143, 153, 143, 136, 137, 136, 126, 126, 115, 118, 121, 126, 119, 121, 124, 116, 123, 100, 96, 82, 119, 111, 126, 141, 129, 143, 128, 128, 138, 152, 142, 139, 140, 146, 141, 143, 139, 141, 127, 136, 142, 132, 120, 127, 118, 110, 125, 111, 117, 113, 116, 123, 125, 151, 148, 151, 137, 131, 124, 133, 136, 151, 154, 156, 164, 160, 156, 152, 152, 143, 135, 125, 127, 129, 148, 134, 122, 122, 139, 124, 127, 135, 155, 163, 137, 144, 152, 153, 152, 155, 147, 143, 140, 142, 134, 134, 136, 142, 150, 151, 144, 144, 140, 164, 121, 133, 135, 134, 135, 138, 124, 149, 147, 147, 139, 141, 143, 131, 141, 138, 144, 141, 139, 144, 157, 168, 162, 158, 172, 159, 132, 168, 118, 138, 137, 134, 130, 137, 123, 132, 119, 128, 141, 157, 148, 166, 159, 170, 163, 176, 167, 181, 163, 161, 161, 154, 161, 156, 157, 153, 141, 123, 126, 126, 135, 128, 138, 127, 141, 144, 158, 161, 163, 164, 152, 138, 159, 179, 170, 164, 158, 159, 154, 139, 146, 153, 148, 139, 131, 129, 136], [131, 135, 126, 138, 135, 136, 136, 127, 136, 139, 130, 133, 123, 113, 131, 127, 132, 123, 123, 139, 139, 127, 135, 125, 139, 123, 129, 130, 133, 137, 135, 130, 133, 123, 98, 104, 110, 89, 87, 72, 81, 90, 100, 85, 88, 87, 114, 108, 93, 96, 97, 110, 133, 133, 130, 133, 131, 136, 137, 114, 114, 108, 94, 90, 78, 56, 54, 43, 52, 45, 49, 56, 57, 84, 68, 83, 105, 90, 91, 84, 111, 116, 138, 134, 125, 130, 138, 118, 119, 113, 95, 69, 68, 54, 65, 51, 30, 0, 28, 26, 55, 81, 81, 109, 109, 117, 122, 126, 117, 124, 121, 124, 132, 146, 127, 118, 133, 141, 126, 96, 102, 90, 68, 105, 99, 89, 83, 72, 95, 101, 103, 107, 123, 139, 151, 145, 122, 103, 102, 119, 126, 138, 115, 116, 123, 153, 144, 142, 132, 136, 119, 131, 128, 121, 131, 118, 109, 110, 117, 114, 113, 118, 125, 136, 141, 131, 107, 125, 135, 115, 136, 120, 112, 131, 136, 130, 136, 132, 123, 130, 127, 120, 126, 126, 139, 133, 121, 126, 128, 136, 139, 118, 122, 122, 126, 114, 143, 106, 140, 147, 123, 130, 135, 135, 132, 134, 131, 140, 137, 135, 138, 128, 138, 140, 142, 129, 138, 128, 126, 117, 107, 122, 141, 100, 144, 147, 155, 157, 140, 151, 142, 143, 140, 137, 129, 133, 132, 125, 136, 138, 131, 127, 139, 125, 131, 119, 123, 116, 103, 127, 105, 105, 150, 139, 141, 164, 135, 153, 132, 131, 135, 133, 132, 140, 143, 139, 141, 140, 135, 143, 140, 134, 130, 126, 130, 106, 89, 90, 88, 120, 143, 144, 135, 150, 124, 126, 133, 125, 132, 136, 129, 129, 146, 130, 130, 154, 141, 136, 138, 133, 137, 133, 127, 93, 77, 89, 88, 128, 156, 161, 133, 140, 129, 142, 140, 144, 143, 135, 148, 144, 140, 117, 130, 172, 155, 151, 152, 145, 137, 138, 130, 90, 64, 80, 103, 145, 148, 139, 171, 143, 161, 136, 145, 160, 144, 146, 134, 138, 119, 108, 132, 164, 161, 154, 148, 137, 140, 131, 147, 94, 53, 95, 128, 133, 122, 129, 178, 135, 181, 154, 133, 143, 141, 134, 145, 130, 106, 105, 139, 152, 151, 144, 145, 147, 158, 165, 156, 83, 67, 103, 121, 117, 120, 146, 146, 152, 181, 140, 134, 146, 138, 129, 124, 112, 115, 123, 141, 148, 150, 152, 152, 154, 154, 145, 144, 98, 81, 94, 73, 109, 126, 147, 116, 151, 161, 139, 139, 146, 134, 121, 133, 127, 120, 107, 123, 155, 153, 162, 153, 148, 146, 140, 141, 100, 73, 81, 107, 108, 140, 135, 131, 113, 135, 131, 139, 141, 154, 135, 120, 119, 121, 135, 146, 148, 151, 153, 133, 136, 143, 144, 133, 83, 72, 56, 82, 112, 130, 142, 123, 102, 119, 122, 116, 139, 151, 135, 128, 124, 137, 151, 143, 147, 134, 141, 128, 118, 124, 127, 106, 90, 66, 63, 71, 107, 122, 153, 121, 100, 112, 112, 98, 122, 121, 119, 120, 132, 133, 135, 146, 146, 131, 114, 123, 125, 130, 115, 89, 42, 53, 76, 112, 117, 140, 136, 140, 131, 114, 114, 102, 99, 94, 83, 94, 103, 112, 116, 126, 117, 102, 117, 102, 108, 106, 91, 62, 56, 61, 102, 113, 128, 136, 138, 134, 117, 96, 88, 91, 88, 103, 106, 103, 94, 107, 108, 115, 105, 116, 107, 96, 101, 96, 96, 82, 77, 99, 126, 108, 117, 131, 129, 108, 87, 112, 95, 97, 111, 114, 124, 123, 108, 105, 97, 112, 104, 121, 111, 100, 114, 117, 107, 105, 97, 114, 134, 103, 133, 131, 140, 105, 100, 104, 122, 119, 132, 135, 134, 128, 126, 118, 111, 118, 122, 121, 121, 124, 111, 106, 105, 121, 113, 118, 123, 102, 139, 126, 138, 90, 92, 120, 125, 122, 145, 119, 113, 119, 119, 109, 114, 118, 104, 118, 125, 119, 125, 119, 121, 126, 125, 126, 121, 117, 129, 127, 126, 112, 111, 124, 146, 137, 126, 126, 111, 123, 108, 107, 118, 102, 100, 110, 110, 115, 133, 137, 142, 129, 131, 115, 110, 115, 136, 138, 125, 111, 147, 144, 157, 127, 144, 127, 121, 121, 129, 124, 119, 125, 122, 119, 120, 118, 139, 175, 152, 127, 135, 115, 128, 116, 127, 133, 139, 138, 131, 154, 167, 193, 191, 189, 182, 166, 156, 142, 148, 169, 163, 127, 135, 126, 140, 145, 136, 148, 137, 150, 141, 128, 133, 134, 133, 128, 130, 141, 141, 167, 157, 149, 165, 171, 186, 166, 180, 194, 196, 218, 207, 150, 151, 162, 161, 161, 153, 129, 127, 124, 136]]}}, {"scale": 0.19113336503505707, "zero_point": 169, "tensor": null}], "outputs": [], "description": "Quantized Matrix Multiplication Node"}, {"op_type": "QLinearAdd", "name": "QLinearAdd", "inputs": [{"scale": 0.19113336503505707, "zero_point": 169, "tensor": null}, {"scale": 0.0020512822084128857, "zero_point": 11, "tensor": {"shape": [5], "dtype": "uint8", "tensor": [0, 255, 21, 119, 27]}}, {"scale": 0.19090913236141205, "zero_point": 169, "tensor": null}], "outputs": [], "description": ""}, {"op_type": "SigmoidLUT", "name": "SigmoidLUT", "inputs": [{"LUT": {"LUT": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 2, 2, 3, 3, 4, 5, 5, 7, 8, 10, 11, 14, 16, 20, 23, 28, 33, 39, 45, 53, 62, 71, 81, 92, 103, 115, 128, 140, 152, 163, 174, 184, 193, 202, 210, 216, 222, 227, 232, 235, 239, 241, 244, 245, 247, 248, 250, 250, 251, 252, 252, 253, 253, 254, 254, 254, 254, 254, 254, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255], "offset": 0, "reduced_LUT": {"reduced_lut_len": 49, "reduced_lut": [3, 3, 4, 5, 5, 7, 8, 10, 11, 14, 16, 20, 23, 28, 33, 39, 45, 53, 62, 71, 81, 92, 103, 115, 128, 140, 152, 163, 174, 184, 193, 202, 210, 216, 222, 227, 232, 235, 239, 241, 244, 245, 247, 248, 250, 250, 251, 252, 252], "head": {"shift": 145, "tuples_len": 3, "tuples": [[137, 0], [143, 1], [145, 2]]}, "tail": {"shift": 62, "tuples_len": 3, "tuples": [[202, 255], [196, 254], [194, 253]]}, "depth": 3, "min_reduce": 0, "asymmetric": false, "description": "Reduced LUT of depth 3 with 0 minimum reduce"}}, "scale": 0.19090913236141205, "tensor": null, "zero_point": 169}], "outputs": [], "description": "Reduced LUT for sigmoid activation function"}, {"op_type": "QLinearMatMul", "name": "QLinearMatMul", "inputs": [{"scale": 0.003921567928045988, "zero_point": 0, "tensor": null}, {"scale": 0.018956873565912247, "zero_point": 134, "tensor": {"shape": [32, 5], "dtype": "uint8", "tensor": [[64, 212, 172, 131, 235], [128, 49, 210, 94, 241], [207, 230, 61, 102, 174], [142, 108, 23, 243, 131], [57, 56, 178, 152, 73], [130, 120, 48, 255, 148], [51, 232, 75, 163, 152], [45, 145, 57, 177, 229], [196, 59, 214, 119, 63], [228, 117, 140, 121, 165], [213, 250, 110, 73, 0], [60, 203, 180, 102, 33], [82, 26, 75, 89, 77], [215, 228, 51, 113, 171], [163, 50, 219, 70, 170], [55, 20, 156, 152, 106], [124, 102, 118, 219, 82], [168, 224, 130, 74, 194], [99, 238, 179, 38, 33], [124, 208, 149, 104, 227], [200, 117, 177, 117, 204], [195, 63, 212, 131, 67], [118, 185, 57, 194, 73], [176, 38, 88, 215, 73], [129, 115, 176, 139, 24], [207, 69, 197, 120, 57], [92, 135, 150, 199, 70], [103, 54, 166, 181, 68], [203, 69, 184, 127, 210], [192, 232, 139, 67, 111], [98, 210, 54, 160, 46], [224, 79, 105, 95, 139]]}}, {"scale": 0.03591335564851761, "zero_point": 153, "tensor": null}], "outputs": [], "description": "Quantized Matrix Multiplication Node"}, {"op_type": "QLinearAdd", "name": "QLinearAdd", "inputs": [{"scale": 0.03591335564851761, "zero_point": 153, "tensor": null}, {"scale": 0.005445446819067001, "zero_point": 107, "tensor": {"shape": [32], "dtype": "uint8", "tensor": [0, 112, 104, 69, 184, 58, 62, 99, 123, 43, 119, 178, 255, 85, 147, 176, 147, 64, 254, 30, 29, 55, 120, 82, 186, 127, 168, 126, 27, 86, 194, 90]}}, {"scale": 0.032626692205667496, "zero_point": 144, "tensor": null}], "outputs": [], "description": ""}, {"op_type": "SigmoidLUT", "name": "SigmoidLUT", "inputs": [{"LUT": {"LUT": [2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 7, 7, 7, 7, 7, 8, 8, 8, 9, 9, 9, 9, 10, 10, 10, 11, 11, 11, 12, 12, 12, 13, 13, 14, 14, 14, 15, 15, 16, 16, 17, 17, 18, 18, 19, 20, 20, 21, 21, 22, 23, 23, 24, 25, 26, 26, 27, 28, 29, 30, 31, 31, 32, 33, 34, 35, 36, 37, 38, 39, 41, 42, 43, 44, 45, 46, 48, 49, 50, 52, 53, 54, 56, 57, 59, 60, 62, 63, 65, 67, 68, 70, 71, 73, 75, 77, 78, 80, 82, 84, 86, 88, 90, 92, 94, 95, 97, 99, 101, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 127, 129, 131, 133, 135, 137, 139, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178, 180, 181, 183, 185, 187, 189, 190, 192, 194, 195, 197, 198, 200, 201, 203, 204, 206, 207, 209, 210, 211, 213, 214, 215, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 235, 236, 237, 238, 238, 239, 240, 240, 241, 242, 242, 243, 243, 244, 244, 245, 245, 246, 246, 247, 247, 248, 248, 249, 249, 249, 250, 250, 250, 251, 251, 251, 252, 252, 252, 253, 253, 253, 254, 254, 254, 254, 254, 255, 255], "offset": 0, "reduced_LUT": {"reduced_lut_len": 226, "reduced_lut": [5, 5, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 7, 7, 7, 7, 7, 8, 8, 8, 9, 9, 9, 9, 10, 10, 10, 11, 11, 11, 12, 12, 12, 13, 13, 14, 14, 14, 15, 15, 16, 16, 17, 17, 18, 18, 19, 20, 20, 21, 21, 22, 23, 23, 24, 25, 26, 26, 27, 28, 29, 30, 31, 31, 32, 33, 34, 35, 36, 37, 38, 39, 41, 42, 43, 44, 45, 46, 48, 49, 50, 52, 53, 54, 56, 57, 59, 60, 62, 63, 65, 67, 68, 70, 71, 73, 75, 77, 78, 80, 82, 84, 86, 88, 90, 92, 94, 95, 97, 99, 101, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 127, 129, 131, 133, 135, 137, 139, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178, 180, 181, 183, 185, 187, 189, 190, 192, 194, 195, 197, 198, 200, 201, 203, 204, 206, 207, 209, 210, 211, 213, 214, 215, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 235, 236, 237, 238, 238, 239, 240, 240, 241, 242, 242, 243, 243, 244, 244, 245, 245, 246, 246, 247, 247, 248, 248, 249, 249, 249, 250, 250, 250, 251, 251, 251, 252, 252, 252], "head": {"shift": 20, "tuples_len": 3, "tuples": [[2, 2], [13, 3], [20, 4]]}, "tail": {"shift": 10, "tuples_len": 3, "tuples": [[254, 255], [249, 254], [246, 253]]}, "depth": 3, "min_reduce": 0, "asymmetric": false, "description": "Reduced LUT of depth 3 with 0 minimum reduce"}}, "scale": 0.032626692205667496, "tensor": null, "zero_point": 144}], "outputs": [], "description": "Reduced LUT for sigmoid activation function"}, {"op_type": "QLinearMatMul", "name": "QLinearMatMul", "inputs": [{"scale": 0.003820388577878475, "zero_point": 0, "tensor": null}, {"scale": 0.01244871411472559, "zero_point": 119, "tensor": {"shape": [64, 32], "dtype": "uint8", "tensor": [[102, 178, 156, 76, 90, 50, 97, 116, 136, 142, 107, 129, 153, 138, 176, 97, 79, 170, 120, 133, 120, 134, 49, 90, 91, 136, 63, 82, 121, 142, 82, 133], [94, 99, 92, 96, 155, 90, 103, 63, 171, 101, 141, 150, 113, 78, 112, 145, 145, 118, 183, 92, 123, 160, 107, 134, 157, 150, 142, 120, 108, 127, 152, 114], [84, 95, 201, 144, 59, 120, 119, 127, 101, 127, 196, 121, 127, 214, 86, 49, 110, 168, 162, 144, 132, 85, 130, 88, 106, 115, 102, 59, 111, 183, 161, 160], [133, 161, 18, 117, 197, 130, 81, 99, 140, 112, 4, 124, 132, 28, 133, 195, 139, 50, 81, 112, 127, 143, 109, 142, 136, 120, 152, 186, 144, 47, 65, 85], [53, 55, 95, 179, 146, 133, 122, 89, 146, 108, 173, 146, 91, 92, 72, 140, 160, 53, 133, 79, 76, 144, 147, 185, 187, 130, 146, 154, 110, 82, 141, 100], [53, 153, 86, 131, 180, 150, 73, 119, 175, 146, 79, 100, 170, 82, 168, 174, 165, 66, 54, 87, 116, 182, 100, 201, 153, 191, 143, 193, 146, 72, 105, 164], [113, 156, 187, 156, 102, 131, 135, 191, 96, 137, 67, 68, 183, 172, 131, 123, 88, 157, 27, 116, 135, 90, 103, 118, 75, 86, 82, 84, 133, 94, 89, 163], [81, 121, 124, 87, 86, 85, 50, 22, 208, 149, 182, 87, 98, 127, 158, 72, 97, 153, 105, 110, 168, 210, 90, 150, 134, 192, 96, 117, 171, 157, 72, 179], [185, 171, 166, 103, 76, 130, 154, 197, 52, 150, 52, 74, 145, 143, 123, 124, 66, 182, 75, 194, 163, 70, 84, 71, 25, 81, 64, 60, 156, 125, 83, 157], [110, 166, 109, 76, 139, 67, 50, 48, 196, 123, 154, 137, 146, 85, 199, 153, 101, 108, 136, 101, 134, 156, 80, 132, 164, 183, 98, 125, 133, 116, 79, 145], [162, 158, 139, 143, 87, 160, 108, 195, 73, 160, 34, 41, 91, 146, 150, 125, 98, 163, 47, 187, 165, 83, 73, 82, 48, 70, 99, 110, 147, 114, 53, 121], [54, 51, 112, 151, 124, 116, 85, 54, 168, 112, 184, 152, 71, 96, 72, 78, 151, 92, 144, 70, 90, 165, 134, 170, 165, 173, 154, 166, 91, 122, 127, 89], [148, 156, 67, 50, 198, 58, 102, 111, 138, 103, 56, 151, 188, 65, 194, 175, 104, 122, 147, 142, 106, 159, 77, 80, 146, 148, 130, 136, 137, 92, 60, 124], [79, 96, 72, 118, 177, 96, 88, 44, 194, 89, 166, 165, 139, 84, 107, 155, 159, 68, 214, 61, 81, 193, 154, 151, 201, 178, 169, 144, 95, 117, 168, 101], [121, 148, 154, 20, 135, 47, 129, 68, 124, 110, 162, 181, 190, 141, 167, 117, 86, 181, 233, 134, 110, 120, 75, 31, 104, 117, 87, 106, 114, 165, 125, 141], [103, 190, 96, 65, 143, 87, 65, 58, 175, 140, 82, 93, 192, 99, 195, 172, 88, 109, 125, 124, 148, 188, 87, 122, 149, 185, 99, 154, 158, 144, 77, 160], [118, 114, 160, 35, 86, 66, 127, 49, 140, 122, 207, 203, 154, 155, 132, 90, 62, 190, 255, 151, 110, 116, 84, 35, 136, 133, 66, 87, 84, 180, 172, 116], [110, 92, 113, 193, 126, 181, 142, 192, 83, 113, 107, 150, 152, 146, 98, 133, 142, 103, 127, 88, 79, 82, 176, 163, 140, 84, 162, 151, 97, 92, 157, 121], [156, 87, 85, 122, 169, 130, 170, 138, 124, 114, 178, 187, 119, 100, 76, 161, 137, 97, 170, 126, 109, 116, 169, 113, 177, 117, 175, 167, 86, 108, 175, 64], [86, 121, 35, 155, 180, 161, 78, 110, 169, 105, 31, 86, 150, 45, 115, 180, 187, 46, 38, 57, 93, 168, 142, 166, 155, 161, 163, 166, 109, 59, 122, 94], [82, 69, 96, 92, 170, 71, 107, 33, 194, 121, 212, 199, 135, 101, 118, 147, 142, 84, 225, 94, 99, 162, 152, 151, 211, 168, 143, 145, 85, 145, 159, 132], [139, 159, 13, 80, 184, 87, 91, 100, 145, 99, 60, 180, 85, 33, 180, 170, 146, 79, 191, 117, 126, 138, 90, 108, 146, 123, 164, 166, 123, 105, 90, 83], [132, 144, 161, 132, 54, 150, 90, 71, 161, 185, 137, 27, 24, 164, 130, 50, 115, 136, 17, 140, 192, 162, 89, 139, 73, 172, 101, 83, 190, 129, 62, 176], [101, 94, 194, 80, 64, 86, 123, 76, 126, 120, 188, 142, 150, 180, 130, 66, 59, 165, 197, 143, 123, 127, 135, 78, 106, 123, 81, 71, 94, 197, 161, 158], [108, 128, 91, 199, 171, 174, 101, 165, 106, 137, 40, 54, 166, 102, 113, 161, 150, 73, 20, 106, 131, 123, 146, 193, 102, 123, 124, 167, 136, 46, 123, 131], [116, 88, 87, 223, 161, 223, 156, 150, 99, 98, 76, 92, 93, 98, 63, 161, 184, 58, 66, 104, 108, 116, 171, 176, 133, 96, 165, 183, 95, 88, 143, 79], [105, 90, 132, 202, 79, 172, 103, 173, 86, 136, 69, 84, 84, 132, 84, 95, 136, 102, 19, 107, 134, 88, 145, 189, 94, 81, 143, 107, 142, 109, 107, 138], [111, 83, 190, 160, 38, 160, 74, 86, 125, 181, 173, 43, 59, 171, 75, 70, 127, 150, 28, 116, 173, 128, 141, 147, 105, 146, 80, 84, 179, 135, 98, 171], [170, 157, 166, 84, 93, 123, 169, 182, 50, 105, 139, 162, 108, 157, 133, 102, 80, 150, 145, 163, 120, 68, 110, 47, 79, 81, 84, 96, 97, 133, 116, 93], [202, 152, 160, 49, 74, 78, 168, 117, 90, 125, 165, 148, 100, 150, 147, 84, 73, 193, 202, 188, 152, 105, 80, 64, 101, 85, 91, 63, 104, 169, 108, 104], [93, 157, 88, 71, 156, 79, 63, 62, 189, 136, 111, 160, 172, 70, 204, 136, 91, 123, 183, 103, 141, 188, 71, 83, 165, 154, 126, 129, 153, 134, 75, 145], [75, 52, 151, 188, 109, 157, 200, 155, 73, 93, 173, 152, 183, 140, 26, 140, 134, 108, 161, 107, 64, 69, 210, 135, 121, 92, 131, 130, 78, 125, 235, 70], [45, 119, 103, 121, 102, 141, 37, 38, 188, 136, 137, 91, 118, 140, 165, 127, 123, 105, 90, 96, 155, 198, 103, 181, 137, 192, 114, 167, 169, 133, 83, 179], [166, 101, 196, 200, 64, 203, 150, 187, 77, 141, 118, 59, 43, 171, 71, 35, 140, 159, 49, 151, 149, 77, 137, 142, 58, 60, 108, 89, 121, 147, 135, 138], [32, 107, 111, 124, 141, 106, 84, 61, 163, 126, 174, 123, 168, 133, 111, 130, 126, 97, 144, 55, 104, 153, 123, 178, 181, 181, 128, 163, 119, 115, 144, 159], [53, 67, 176, 116, 75, 90, 94, 84, 101, 144, 243, 144, 126, 186, 102, 51, 93, 140, 206, 86, 105, 122, 136, 131, 117, 127, 107, 108, 82, 160, 171, 145], [64, 65, 113, 111, 120, 87, 99, 21, 167, 118, 210, 161, 136, 89, 93, 95, 139, 95, 188, 49, 93, 144, 155, 135, 188, 157, 128, 138, 56, 138, 183, 109], [101, 123, 162, 56, 91, 44, 94, 95, 136, 112, 157, 138, 164, 123, 134, 116, 55, 175, 171, 136, 133, 123, 86, 55, 108, 121, 91, 84, 135, 147, 106, 147], [180, 193, 91, 60, 136, 92, 179, 136, 120, 113, 100, 169, 115, 84, 159, 137, 78, 175, 186, 184, 145, 106, 83, 77, 99, 86, 97, 119, 127, 117, 82, 112], [172, 167, 72, 140, 174, 156, 187, 193, 56, 91, 49, 143, 137, 69, 113, 179, 140, 105, 109, 161, 132, 62, 112, 86, 83, 53, 151, 135, 111, 76, 126, 79], [145, 149, 119, 155, 132, 152, 119, 209, 100, 106, 53, 93, 199, 135, 129, 175, 110, 104, 90, 131, 131, 80, 112, 134, 76, 83, 116, 110, 126, 72, 149, 144], [181, 135, 114, 128, 185, 136, 178, 207, 77, 61, 82, 166, 185, 80, 91, 200, 124, 98, 146, 110, 61, 44, 149, 103, 140, 59, 134, 142, 88, 79, 180, 50], [113, 197, 89, 90, 135, 89, 65, 88, 186, 137, 48, 102, 171, 93, 232, 145, 88, 122, 95, 103, 168, 185, 50, 137, 143, 186, 83, 136, 160, 101, 51, 175], [132, 90, 210, 152, 75, 140, 155, 137, 59, 128, 182, 128, 83, 196, 63, 43, 96, 179, 156, 167, 111, 73, 144, 108, 96, 86, 121, 91, 78, 181, 168, 126], [93, 51, 96, 126, 123, 135, 152, 95, 76, 75, 142, 171, 121, 117, 69, 122, 151, 67, 181, 85, 83, 80, 166, 139, 160, 115, 131, 132, 47, 103, 171, 87], [161, 167, 53, 196, 144, 165, 113, 175, 127, 109, 4, 67, 114, 65, 143, 177, 167, 73, 0, 99, 135, 145, 109, 165, 99, 96, 137, 172, 171, 59, 91, 109], [55, 109, 91, 160, 156, 168, 69, 102, 155, 119, 82, 88, 171, 109, 121, 167, 174, 86, 77, 81, 112, 156, 129, 211, 176, 169, 132, 163, 146, 80, 111, 132], [60, 81, 133, 155, 79, 137, 88, 105, 134, 153, 111, 66, 98, 158, 122, 106, 126, 100, 63, 74, 136, 129, 141, 158, 130, 133, 109, 122, 137, 85, 116, 141], [209, 150, 182, 121, 86, 108, 192, 195, 73, 117, 94, 135, 86, 155, 107, 97, 109, 166, 144, 189, 129, 56, 127, 72, 86, 67, 112, 62, 131, 151, 134, 107], [157, 117, 183, 160, 51, 165, 134, 169, 78, 141, 110, 88, 120, 185, 111, 85, 88, 143, 80, 160, 149, 65, 122, 108, 76, 76, 71, 74, 129, 117, 100, 133], [97, 144, 51, 145, 163, 156, 87, 131, 146, 103, 30, 106, 179, 56, 119, 187, 178, 76, 59, 63, 113, 152, 140, 185, 132, 132, 141, 173, 137, 38, 79, 118], [138, 82, 137, 172, 115, 141, 172, 187, 34, 95, 87, 131, 117, 126, 33, 132, 116, 117, 100, 145, 114, 28, 137, 116, 82, 27, 110, 104, 97, 77, 147, 73], [90, 122, 151, 166, 75, 176, 94, 138, 133, 133, 118, 26, 127, 160, 114, 109, 120, 122, 22, 124, 147, 113, 109, 148, 80, 115, 90, 121, 180, 100, 107, 168], [184, 142, 142, 70, 118, 92, 190, 170, 69, 109, 138, 149, 152, 110, 115, 142, 65, 164, 185, 161, 99, 66, 96, 31, 80, 72, 97, 74, 79, 142, 129, 116], [178, 95, 114, 96, 178, 123, 194, 191, 65, 56, 139, 218, 161, 102, 106, 176, 143, 110, 205, 137, 88, 67, 151, 75, 133, 71, 136, 134, 46, 100, 193, 50], [169, 146, 120, 25, 129, 40, 156, 63, 126, 113, 148, 205, 115, 122, 159, 125, 69, 153, 244, 163, 138, 136, 108, 38, 137, 143, 135, 110, 111, 179, 104, 103], [87, 61, 139, 194, 95, 168, 154, 176, 73, 102, 136, 126, 135, 134, 72, 106, 160, 125, 124, 117, 105, 97, 157, 148, 130, 74, 140, 108, 84, 125, 168, 112], [98, 55, 177, 168, 138, 143, 201, 203, 45, 98, 152, 164, 223, 154, 79, 144, 130, 135, 189, 96, 82, 52, 173, 132, 132, 70, 118, 83, 66, 136, 220, 101], [160, 61, 120, 167, 126, 166, 197, 195, 29, 78, 144, 141, 120, 138, 49, 107, 140, 123, 157, 117, 64, 52, 173, 109, 121, 32, 124, 116, 51, 116, 196, 85], [164, 111, 146, 97, 72, 118, 107, 105, 89, 149, 138, 92, 90, 132, 105, 51, 98, 144, 101, 135, 147, 86, 111, 92, 87, 86, 69, 80, 136, 124, 93, 113], [162, 70, 106, 171, 130, 172, 196, 166, 31, 86, 99, 103, 77, 132, 29, 101, 126, 112, 95, 126, 87, 55, 173, 90, 91, 41, 156, 108, 103, 109, 152, 54], [147, 81, 176, 116, 76, 126, 151, 80, 89, 148, 167, 118, 20, 164, 84, 33, 110, 168, 142, 154, 151, 117, 120, 82, 104, 107, 89, 81, 130, 167, 114, 112], [135, 141, 61, 144, 151, 142, 97, 128, 126, 124, 29, 66, 168, 92, 154, 171, 135, 98, 46, 127, 142, 144, 123, 140, 91, 132, 118, 147, 157, 90, 62, 121], [112, 183, 110, 118, 116, 103, 48, 93, 173, 153, 57, 28, 61, 98, 180, 124, 110, 108, 34, 126, 156, 173, 62, 137, 103, 146, 76, 145, 177, 99, 42, 139]]}}, {"scale": 0.0470639243721962, "zero_point": 130, "tensor": null}], "outputs": [], "description": "Quantized Matrix Multiplication Node"}, {"op_type": "QLinearAdd", "name": "QLinearAdd", "inputs": [{"scale": 0.0470639243721962, "zero_point": 130, "tensor": null}, {"scale": 0.0014060529647395015, "zero_point": 146, "tensor": {"shape": [64], "dtype": "uint8", "tensor": [160, 118, 173, 73, 58, 179, 181, 253, 240, 173, 209, 58, 179, 177, 213, 223, 211, 204, 178, 100, 205, 145, 174, 216, 163, 148, 120, 124, 214, 194, 201, 116, 139, 183, 165, 135, 42, 103, 240, 193, 210, 214, 198, 225, 0, 161, 156, 104, 255, 186, 141, 115, 152, 202, 238, 203, 162, 205, 96, 136, 76, 113, 138, 118]}}, {"scale": 0.04765092954039574, "zero_point": 130, "tensor": null}], "outputs": [], "description": ""}, {"op_type": "SigmoidLUT", "name": "SigmoidLUT", "inputs": [{"LUT": {"LUT": [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 5, 5, 5, 5, 6, 6, 6, 6, 7, 7, 7, 8, 8, 8, 9, 9, 10, 10, 11, 11, 12, 12, 13, 13, 14, 14, 15, 16, 17, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 32, 33, 34, 36, 37, 39, 41, 42, 44, 46, 48, 49, 51, 53, 55, 57, 60, 62, 64, 66, 69, 71, 74, 76, 79, 81, 84, 87, 89, 92, 95, 98, 101, 104, 107, 110, 113, 116, 119, 122, 125, 128, 131, 134, 137, 140, 143, 146, 149, 152, 155, 158, 161, 163, 166, 169, 172, 174, 177, 180, 182, 185, 187, 189, 192, 194, 196, 198, 200, 202, 204, 206, 208, 210, 212, 213, 215, 217, 218, 220, 221, 223, 224, 225, 226, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 238, 239, 240, 240, 241, 242, 242, 243, 244, 244, 245, 245, 246, 246, 246, 247, 247, 248, 248, 248, 249, 249, 249, 250, 250, 250, 250, 251, 251, 251, 251, 251, 252, 252, 252, 252, 252, 253, 253, 253, 253, 253, 253, 253, 253, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 254, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255], "offset": 0, "reduced_LUT": {"reduced_lut_len": 181, "reduced_lut": [4, 4, 4, 4, 4, 5, 5, 5, 5, 6, 6, 6, 6, 7, 7, 7, 8, 8, 8, 9, 9, 10, 10, 11, 11, 12, 12, 13, 13, 14, 14, 15, 16, 17, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 32, 33, 34, 36, 37, 39, 41, 42, 44, 46, 48, 49, 51, 53, 55, 57, 60, 62, 64, 66, 69, 71, 74, 76, 79, 81, 84, 87, 89, 92, 95, 98, 101, 104, 107, 110, 113, 116, 119, 122, 125, 128, 131, 134, 137, 140, 143, 146, 149, 152, 155, 158, 161, 163, 166, 169, 172, 174, 177, 180, 182, 185, 187, 189, 192, 194, 196, 198, 200, 202, 204, 206, 208, 210, 212, 213, 215, 217, 218, 220, 221, 223, 224, 225, 226, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 238, 239, 240, 240, 241, 242, 242, 243, 244, 244, 245, 245, 246, 246, 246, 247, 247, 248, 248, 248, 249, 249, 249, 250, 250, 250, 250, 251, 251, 251, 251, 251, 252, 252, 252, 252, 252], "head": {"shift": 41, "tuples_len": 3, "tuples": [[23, 1], [34, 2], [41, 3]]}, "tail": {"shift": 34, "tuples_len": 3, "tuples": [[244, 255], [230, 254], [222, 253]]}, "depth": 3, "min_reduce": 0, "asymmetric": false, "description": "Reduced LUT of depth 3 with 0 minimum reduce"}}, "scale": 0.04765092954039574, "tensor": null, "zero_point": 130}], "outputs": [], "description": "Reduced LUT for sigmoid activation function"}, {"op_type": "QLinearMatMul", "name": "QLinearMatMul", "inputs": [{"scale": 0.0039114076644182205, "zero_point": 0, "tensor": null}, {"scale": 0.009411846287548542, "zero_point": 135, "tensor": {"shape": [10, 64], "dtype": "uint8", "tensor": [[118, 129, 168, 98, 154, 15, 70, 28, 111, 92, 53, 155, 105, 162, 170, 74, 167, 169, 184, 79, 165, 143, 51, 163, 68, 124, 78, 91, 215, 172, 76, 162, 32, 161, 99, 184, 154, 118, 153, 152, 116, 208, 104, 196, 195, 31, 92, 87, 168, 128, 44, 201, 59, 214, 234, 189, 153, 180, 190, 108, 189, 170, 42, 79], [82, 161, 43, 246, 183, 194, 88, 190, 90, 190, 152, 167, 196, 180, 57, 185, 17, 126, 150, 241, 169, 228, 175, 9, 172, 177, 122, 109, 88, 83, 182, 54, 165, 77, 120, 15, 120, 68, 150, 163, 110, 89, 225, 0, 106, 255, 165, 137, 107, 65, 235, 47, 131, 56, 55, 132, 88, 5, 56, 94, 95, 105, 195, 236], [148, 173, 117, 177, 142, 141, 134, 71, 177, 182, 145, 115, 195, 167, 186, 187, 166, 145, 127, 171, 152, 164, 31, 127, 141, 110, 71, 26, 126, 144, 184, 164, 130, 32, 171, 109, 158, 162, 179, 156, 175, 192, 188, 69, 173, 139, 168, 94, 130, 117, 185, 114, 120, 166, 165, 170, 152, 184, 152, 110, 91, 79, 168, 94], [140, 162, 122, 124, 177, 184, 164, 64, 102, 85, 108, 128, 112, 189, 92, 127, 77, 187, 131, 166, 171, 133, 90, 97, 192, 142, 135, 103, 126, 78, 77, 160, 122, 149, 176, 130, 148, 114, 112, 185, 148, 171, 100, 131, 190, 163, 165, 164, 153, 152, 165, 168, 130, 109, 166, 74, 129, 181, 176, 88, 186, 95, 122, 98], [177, 97, 169, 105, 79, 108, 180, 189, 205, 182, 194, 60, 156, 72, 201, 174, 186, 52, 86, 109, 112, 71, 158, 176, 91, 38, 107, 151, 187, 157, 166, 82, 121, 178, 93, 147, 75, 193, 148, 86, 125, 123, 162, 144, 126, 106, 71, 144, 181, 192, 112, 101, 155, 185, 98, 199, 61, 73, 90, 191, 82, 158, 118, 179], [99, 176, 177, 105, 176, 110, 97, 150, 58, 98, 100, 194, 89, 165, 91, 94, 158, 107, 123, 67, 187, 102, 180, 138, 103, 131, 160, 196, 110, 152, 91, 178, 180, 177, 182, 151, 191, 117, 124, 70, 85, 67, 58, 165, 178, 43, 166, 129, 147, 169, 58, 120, 180, 82, 89, 127, 179, 147, 184, 150, 140, 196, 86, 62], [165, 167, 155, 105, 125, 151, 87, 180, 59, 153, 53, 161, 189, 189, 211, 158, 229, 61, 134, 51, 200, 170, 119, 182, 14, 50, 35, 119, 146, 197, 184, 74, 144, 9, 185, 158, 199, 200, 186, 86, 33, 93, 152, 67, 144, 63, 140, 94, 136, 90, 70, 85, 84, 160, 167, 202, 73, 83, 126, 134, 132, 143, 127, 158], [94, 77, 155, 184, 107, 77, 180, 75, 194, 87, 204, 53, 166, 44, 99, 84, 104, 146, 174, 138, 31, 130, 164, 102, 168, 145, 155, 155, 166, 170, 92, 175, 65, 160, 40, 82, 46, 148, 178, 233, 182, 199, 85, 114, 87, 164, 104, 89, 166, 187, 144, 214, 174, 213, 155, 139, 139, 155, 201, 161, 231, 130, 167, 129], [94, 120, 184, 121, 190, 182, 144, 187, 68, 176, 56, 172, 102, 181, 78, 166, 75, 161, 158, 177, 160, 69, 168, 128, 166, 139, 128, 203, 52, 69, 142, 179, 186, 129, 155, 186, 174, 143, 54, 70, 129, 68, 165, 108, 129, 140, 142, 174, 81, 104, 160, 96, 165, 85, 19, 59, 153, 153, 84, 102, 110, 119, 151, 151], [138, 78, 156, 73, 107, 172, 164, 191, 191, 83, 191, 121, 93, 57, 105, 147, 94, 138, 77, 65, 54, 66, 174, 142, 160, 122, 204, 163, 163, 156, 93, 116, 170, 195, 114, 105, 90, 116, 144, 130, 161, 85, 171, 123, 134, 177, 184, 155, 174, 186, 125, 140, 128, 106, 63, 87, 169, 153, 126, 143, 96, 160, 159, 180]]}}, {"scale": 0.08783380687236786, "zero_point": 155, "tensor": null}], "outputs": [], "description": "Quantized Matrix Multiplication Node"}, {"op_type": "QLinearAdd", "name": "QLinearAdd", "inputs": [{"scale": 0.08783380687236786, "zero_point": 155, "tensor": null}, {"scale": 0.000339244375936687, "zero_point": 119, "tensor": {"shape": [10], "dtype": "uint8", "tensor": [94, 200, 201, 255, 46, 132, 0, 249, 32, 82]}}, {"scale": 0.08783380687236786, "zero_point": 155, "tensor": null}], "outputs": [], "description": ""}, {"op_type": "DequantizeLinear", "name": "DequantizeLinear", "inputs": [{"scale": 0.08783380687236786, "zero_point": 155, "tensor": null}], "outputs": [], "description": "Casts a int8 value into float"}, {"op_type": "Softmax", "name": "Softmax", "inputs": [{"tensor": {"name": "StatefulPartitionedCall/sequential/dense_3/BiasAdd:0", "dtype": "?", "shape": 10, "tensor": null}, "scale": null, "zero_point": null}], "outputs": [{"tensor": {"name": "dense_3", "dtype": "?", "shape": 10, "tensor": null}, "scale": null, "zero_point": null}], "description": ""}], "input": [{"zero_point": null, "scale": null, "tensor": {"name": "dense_input", "dtype": "?", "shape": 784, "tensor": null}}], "output": [{"zero_point": null, "scale": null, "tensor": {"name": "dense_input", "dtype": "?", "shape": 784, "tensor": null}}]}