{"ir_version": 4, "engine": "ONNX", "graph": [{"op_type": "QuantizeLinear", "name": "QuantizeLinear", "inputs": [{"scale": 0.003921568859368563, "zero_point": 0, "tensor": null}], "outputs": [], "description": "Casts a float value into uint8"}, {"op_type": "QLinearMatMul", "name": "QLinearMatMul", "inputs": [{"scale": 0.003921568859368563, "zero_point": 0, "tensor": null}, {"scale": 0.005624224431812763, "zero_point": 102, "tensor": {"shape": [5, 784], "dtype": "uint8", "tensor": [[101, 114, 102, 93, 91, 104, 92, 91, 105, 106, 108, 98, 105, 85, 86, 95, 96, 103, 93, 108, 98, 106, 106, 109, 115, 102, 90, 89, 103, 111, 106, 93, 102, 101, 82, 50, 72, 88, 67, 58, 58, 75, 102, 79, 65, 81, 81, 77, 62, 76, 50, 62, 106, 94, 90, 109, 101, 114, 92, 82, 91, 82, 76, 49, 45, 78, 64, 76, 64, 37, 70, 78, 51, 83, 75, 78, 110, 124, 96, 58, 52, 65, 91, 102, 114, 111, 105, 45, 67, 64, 40, 64, 55, 62, 68, 91, 39, 13, 56, 40, 64, 70, 56, 82, 55, 82, 87, 95, 89, 86, 130, 105, 117, 98, 88, 49, 89, 62, 70, 86, 79, 73, 69, 91, 107, 97, 97, 86, 73, 94, 81, 76, 97, 82, 94, 108, 103, 84, 50, 93, 108, 112, 78, 65, 68, 43, 84, 93, 98, 119, 115, 129, 124, 124, 112, 115, 109, 115, 111, 91, 95, 75, 70, 60, 77, 87, 66, 106, 87, 84, 110, 56, 74, 93, 80, 116, 99, 115, 116, 113, 117, 111, 131, 125, 130, 120, 116, 110, 98, 107, 103, 96, 50, 80, 65, 94, 101, 47, 144, 103, 99, 95, 103, 123, 115, 114, 107, 120, 117, 129, 127, 138, 124, 130, 121, 97, 122, 101, 114, 109, 91, 60, 89, 80, 110, 129, 125, 104, 78, 79, 94, 117, 111, 123, 139, 120, 117, 110, 131, 114, 115, 99, 101, 107, 100, 112, 105, 139, 116, 78, 75, 71, 129, 118, 105, 100, 90, 109, 115, 103, 99, 122, 130, 132, 132, 115, 88, 98, 114, 113, 126, 125, 129, 111, 121, 142, 98, 40, 52, 106, 127, 129, 122, 97, 94, 127, 124, 116, 122, 139, 129, 122, 125, 91, 71, 77, 96, 119, 126, 141, 140, 137, 148, 118, 91, 14, 4, 89, 137, 149, 118, 99, 86, 128, 131, 141, 122, 131, 129, 129, 113, 84, 49, 83, 96, 122, 126, 130, 175, 173, 171, 133, 86, 15, 18, 88, 132, 139, 169, 92, 85, 123, 113, 134, 132, 115, 100, 103, 102, 73, 65, 88, 106, 106, 125, 149, 134, 155, 176, 160, 113, 46, 24, 63, 85, 103, 150, 85, 136, 122, 132, 136, 95, 104, 99, 119, 85, 79, 72, 112, 118, 110, 124, 118, 132, 138, 157, 128, 122, 84, 60, 88, 85, 86, 120, 93, 124, 114, 136, 130, 98, 77, 96, 111, 102, 99, 87, 93, 124, 126, 127, 126, 120, 99, 121, 128, 108, 137, 75, 96, 86, 91, 62, 94, 109, 116, 130, 140, 119, 111, 115, 117, 101, 78, 83, 104, 116, 132, 103, 84, 94, 101, 97, 90, 94, 132, 119, 63, 142, 76, 51, 63, 88, 110, 137, 151, 164, 142, 137, 136, 123, 93, 96, 120, 135, 129, 106, 100, 102, 94, 103, 100, 94, 155, 105, 80, 108, 66, 83, 50, 56, 89, 101, 146, 166, 169, 167, 168, 147, 128, 104, 123, 132, 125, 104, 75, 86, 66, 95, 83, 102, 195, 128, 61, 101, 80, 96, 40, 68, 86, 74, 122, 150, 158, 165, 154, 134, 106, 108, 112, 119, 110, 106, 103, 84, 99, 97, 93, 99, 156, 120, 56, 89, 121, 100, 57, 106, 104, 109, 126, 113, 111, 116, 104, 120, 73, 92, 96, 80, 105, 82, 105, 94, 104, 108, 101, 125, 109, 100, 99, 114, 103, 107, 72, 71, 111, 105, 86, 86, 98, 82, 86, 103, 98, 96, 89, 98, 76, 84, 91, 107, 95, 78, 99, 127, 103, 82, 98, 82, 82, 91, 59, 71, 90, 77, 92, 80, 96, 91, 82, 96, 99, 92, 102, 106, 96, 98, 108, 103, 99, 114, 115, 136, 91, 91, 114, 82, 80, 83, 77, 72, 66, 102, 94, 113, 100, 111, 111, 127, 116, 104, 109, 88, 94, 96, 94, 120, 115, 147, 100, 118, 99, 53, 111, 111, 101, 31, 55, 49, 49, 95, 111, 108, 86, 102, 111, 120, 118, 119, 113, 103, 104, 107, 105, 119, 148, 135, 93, 111, 90, 29, 110, 101, 94, 80, 74, 70, 103, 65, 76, 95, 96, 100, 109, 108, 117, 99, 99, 118, 117, 96, 118, 118, 133, 143, 97, 100, 137, 104, 88, 87, 99, 67, 121, 122, 122, 91, 99, 75, 81, 88, 106, 106, 116, 117, 120, 125, 118, 112, 120, 127, 134, 97, 73, 55, 121, 96, 117, 100, 113, 115, 110, 109, 104, 138, 138, 144, 155, 118, 122, 118, 129, 130, 126, 116, 119, 125, 102, 117, 99, 124, 55, 103, 91, 93, 91, 96, 109, 96, 115, 97, 100, 94, 110, 110, 156, 109, 127, 127, 185, 188, 165, 176, 171, 180, 152, 139, 127, 121, 129, 88, 89, 113, 102], [95, 101, 102, 105, 95, 99, 91, 99, 108, 94, 116, 91, 88, 116, 116, 109, 97, 88, 106, 108, 102, 102, 100, 114, 117, 95, 92, 98, 112, 108, 114, 113, 77, 87, 70, 84, 73, 74, 50, 67, 51, 104, 152, 169, 169, 114, 68, 71, 75, 59, 90, 90, 97, 92, 115, 89, 92, 94, 100, 99, 83, 91, 100, 66, 57, 42, 52, 38, 50, 63, 58, 84, 84, 57, 71, 48, 40, 4, 28, 107, 137, 118, 113, 103, 113, 110, 84, 84, 76, 127, 89, 81, 69, 68, 90, 86, 112, 93, 89, 78, 95, 75, 76, 78, 103, 93, 92, 98, 115, 129, 81, 88, 94, 136, 154, 137, 118, 113, 120, 129, 125, 128, 143, 145, 143, 139, 133, 130, 122, 117, 134, 110, 114, 83, 88, 54, 124, 162, 162, 100, 109, 100, 107, 139, 125, 131, 127, 113, 124, 123, 141, 157, 152, 143, 127, 127, 117, 100, 101, 89, 102, 94, 97, 67, 108, 161, 128, 99, 117, 138, 140, 160, 107, 122, 119, 95, 132, 127, 142, 145, 131, 163, 152, 155, 163, 143, 129, 100, 122, 109, 80, 84, 99, 148, 148, 98, 103, 160, 149, 148, 132, 103, 117, 103, 119, 118, 129, 124, 145, 157, 161, 160, 156, 137, 137, 124, 133, 118, 93, 110, 112, 145, 145, 116, 96, 150, 144, 146, 115, 123, 108, 116, 119, 99, 110, 121, 154, 136, 161, 146, 127, 133, 131, 131, 130, 116, 128, 118, 132, 164, 149, 136, 116, 171, 145, 149, 140, 98, 125, 113, 105, 124, 118, 115, 128, 120, 129, 143, 122, 122, 127, 122, 118, 137, 128, 122, 132, 188, 181, 155, 118, 155, 137, 161, 101, 96, 120, 108, 95, 110, 114, 101, 95, 97, 109, 126, 115, 122, 125, 129, 134, 135, 156, 140, 140, 185, 171, 133, 142, 150, 153, 114, 93, 113, 100, 128, 115, 97, 108, 92, 79, 93, 135, 153, 107, 118, 129, 119, 143, 119, 143, 133, 155, 182, 188, 130, 121, 116, 127, 120, 126, 113, 110, 117, 103, 100, 99, 97, 87, 105, 150, 121, 124, 118, 138, 120, 137, 122, 99, 87, 79, 171, 170, 146, 87, 95, 113, 128, 129, 104, 93, 109, 106, 89, 78, 89, 116, 119, 149, 119, 122, 104, 126, 121, 134, 116, 89, 50, 26, 127, 162, 135, 79, 93, 105, 101, 107, 76, 97, 79, 88, 89, 72, 80, 90, 128, 139, 122, 108, 113, 131, 100, 98, 90, 66, 48, 47, 101, 165, 63, 98, 102, 89, 107, 118, 72, 91, 77, 76, 83, 84, 102, 108, 125, 113, 105, 115, 113, 111, 103, 75, 93, 76, 90, 74, 69, 124, 150, 133, 125, 93, 126, 105, 91, 92, 79, 103, 81, 96, 99, 115, 119, 95, 92, 107, 104, 86, 72, 58, 76, 84, 91, 99, 91, 126, 123, 90, 134, 93, 128, 113, 96, 91, 86, 99, 102, 88, 93, 126, 112, 87, 95, 103, 101, 84, 91, 73, 90, 99, 117, 111, 78, 137, 103, 126, 112, 121, 139, 110, 113, 115, 98, 100, 102, 105, 114, 85, 83, 78, 110, 94, 106, 94, 104, 108, 113, 123, 80, 105, 97, 139, 116, 112, 98, 113, 136, 116, 120, 124, 122, 120, 102, 95, 58, 85, 80, 78, 85, 90, 103, 100, 102, 109, 115, 109, 120, 105, 134, 107, 121, 95, 85, 107, 134, 117, 117, 135, 112, 115, 111, 102, 65, 63, 84, 77, 75, 83, 90, 92, 112, 105, 96, 119, 119, 104, 119, 101, 83, 116, 121, 136, 142, 113, 98, 123, 120, 111, 91, 91, 70, 74, 69, 90, 81, 106, 70, 86, 98, 113, 103, 94, 92, 85, 118, 61, 88, 99, 119, 119, 126, 127, 89, 109, 117, 107, 117, 106, 109, 110, 99, 106, 102, 110, 105, 107, 94, 107, 87, 104, 121, 104, 125, 97, 106, 111, 96, 115, 160, 147, 103, 104, 120, 102, 106, 122, 125, 127, 130, 113, 115, 104, 110, 99, 108, 78, 71, 93, 104, 130, 104, 118, 113, 113, 98, 145, 151, 201, 167, 155, 133, 139, 126, 121, 142, 132, 131, 106, 117, 113, 116, 100, 107, 120, 118, 109, 143, 143, 54, 82, 108, 112, 103, 140, 92, 129, 160, 152, 172, 198, 182, 165, 172, 184, 170, 167, 149, 175, 207, 214, 220, 206, 187, 137, 143, 142, 94, 79, 97, 97, 92, 112, 77, 104, 131, 126, 167, 204, 181, 190, 187, 186, 214, 242, 225, 236, 242, 208, 194, 196, 201, 176, 136, 114, 110, 108, 117, 96, 105, 98, 105, 125, 126, 132, 158, 162, 155, 184, 214, 179, 192, 209, 216, 192, 185, 187, 141, 81, 133, 116, 126, 89, 106, 111, 107], [90, 98, 115, 100, 94, 111, 110, 92, 92, 93, 90, 95, 92, 107, 96, 106, 87, 105, 93, 88, 91, 116, 108, 105, 104, 89, 96, 90, 90, 108, 117, 106, 111, 112, 89, 88, 70, 122, 144, 106, 108, 100, 118, 91, 64, 103, 142, 101, 84, 81, 60, 73, 87, 93, 88, 113, 100, 92, 107, 62, 74, 98, 120, 121, 110, 103, 117, 90, 88, 86, 85, 94, 85, 87, 106, 127, 121, 100, 97, 63, 46, 77, 103, 112, 107, 103, 92, 71, 132, 107, 115, 123, 119, 109, 97, 106, 84, 93, 91, 94, 70, 92, 103, 110, 113, 118, 144, 132, 91, 84, 93, 113, 108, 130, 97, 47, 112, 91, 63, 106, 90, 71, 101, 104, 96, 89, 84, 92, 101, 99, 106, 94, 95, 99, 116, 160, 149, 128, 75, 73, 90, 117, 70, 37, 75, 70, 83, 76, 72, 102, 93, 113, 102, 98, 97, 87, 114, 112, 110, 112, 127, 108, 117, 156, 132, 129, 114, 103, 107, 70, 87, 42, 63, 86, 80, 82, 77, 86, 100, 99, 100, 107, 95, 109, 99, 113, 101, 107, 113, 122, 116, 175, 211, 177, 152, 104, 85, 74, 55, 55, 38, 93, 85, 103, 109, 115, 111, 116, 102, 106, 99, 125, 105, 118, 100, 121, 111, 122, 99, 155, 212, 215, 132, 138, 102, 63, 76, 93, 47, 77, 80, 90, 98, 100, 92, 103, 111, 107, 85, 88, 106, 92, 98, 105, 116, 108, 122, 175, 240, 255, 143, 98, 81, 57, 118, 64, 55, 72, 87, 101, 105, 109, 114, 109, 116, 86, 53, 57, 71, 94, 90, 90, 115, 123, 124, 152, 243, 254, 170, 150, 98, 57, 82, 59, 106, 104, 89, 119, 121, 129, 155, 140, 150, 122, 59, 64, 55, 73, 103, 91, 100, 116, 111, 156, 205, 239, 181, 142, 76, 66, 110, 126, 139, 136, 122, 149, 147, 146, 148, 154, 150, 167, 111, 87, 85, 109, 98, 99, 96, 96, 103, 101, 127, 183, 217, 117, 89, 125, 127, 165, 142, 152, 184, 176, 157, 140, 152, 139, 156, 158, 136, 101, 98, 101, 112, 107, 110, 109, 110, 99, 87, 82, 127, 64, 116, 122, 124, 142, 139, 181, 167, 171, 139, 120, 125, 128, 152, 154, 109, 113, 99, 97, 125, 120, 118, 113, 115, 105, 87, 72, 43, 50, 139, 120, 110, 150, 123, 133, 153, 110, 124, 116, 113, 123, 130, 142, 107, 106, 107, 111, 94, 94, 106, 99, 106, 81, 113, 91, 9, 44, 110, 127, 129, 107, 76, 81, 80, 102, 105, 117, 112, 127, 147, 115, 89, 104, 108, 105, 98, 92, 81, 85, 99, 122, 85, 45, 3, 64, 91, 123, 93, 69, 73, 57, 98, 99, 107, 107, 91, 124, 118, 103, 102, 102, 105, 113, 69, 85, 84, 83, 88, 117, 97, 9, 2, 57, 105, 91, 76, 76, 71, 94, 86, 91, 101, 104, 116, 121, 107, 104, 88, 99, 111, 97, 111, 77, 98, 84, 79, 117, 96, 3, 13, 46, 83, 68, 107, 84, 75, 88, 127, 119, 119, 119, 108, 117, 86, 75, 91, 105, 96, 101, 75, 99, 92, 104, 94, 101, 73, 18, 40, 75, 123, 116, 104, 90, 85, 98, 106, 110, 124, 109, 115, 97, 86, 87, 87, 109, 108, 93, 108, 101, 111, 94, 105, 105, 69, 0, 56, 60, 107, 123, 98, 64, 65, 102, 103, 91, 107, 97, 101, 89, 105, 105, 96, 101, 111, 119, 103, 105, 103, 98, 103, 111, 58, 33, 65, 103, 109, 107, 77, 62, 88, 91, 89, 97, 97, 98, 102, 95, 102, 105, 110, 116, 95, 100, 108, 93, 105, 108, 89, 93, 60, 49, 49, 130, 104, 114, 59, 53, 69, 71, 83, 83, 99, 95, 98, 111, 114, 120, 110, 109, 108, 111, 118, 107, 115, 107, 97, 111, 92, 84, 116, 108, 100, 98, 86, 73, 49, 82, 79, 66, 108, 107, 102, 117, 125, 108, 118, 126, 129, 140, 109, 124, 133, 133, 93, 117, 118, 90, 112, 103, 101, 93, 123, 101, 70, 65, 65, 106, 107, 106, 119, 115, 128, 122, 106, 108, 134, 122, 156, 157, 133, 133, 123, 125, 81, 59, 68, 98, 97, 112, 84, 146, 104, 115, 118, 133, 99, 105, 115, 89, 93, 115, 101, 106, 116, 132, 142, 155, 130, 133, 154, 146, 133, 75, 68, 115, 110, 111, 106, 141, 122, 137, 130, 102, 82, 109, 98, 117, 116, 131, 103, 108, 122, 121, 112, 126, 126, 114, 110, 91, 75, 91, 95, 96, 109, 113, 94, 99, 94, 87, 96, 93, 64, 87, 51, 64, 70, 69, 61, 51, 48, 81, 97, 69, 128, 105, 131, 88, 108, 110, 90, 89], [115, 117, 102, 101, 88, 109, 103, 105, 107, 103, 87, 93, 101, 100, 111, 103, 94, 97, 103, 101, 112, 89, 92, 98, 90, 98, 105, 96, 94, 90, 91, 107, 92, 107, 145, 137, 127, 144, 129, 92, 107, 119, 128, 102, 64, 112, 146, 156, 154, 125, 143, 124, 117, 108, 96, 103, 100, 109, 118, 72, 85, 136, 141, 150, 174, 205, 203, 219, 205, 212, 189, 192, 185, 169, 185, 178, 176, 167, 145, 150, 136, 146, 95, 89, 103, 95, 102, 85, 130, 101, 156, 142, 126, 167, 133, 137, 123, 131, 112, 128, 107, 97, 139, 154, 146, 140, 158, 131, 133, 78, 100, 101, 98, 89, 74, 94, 88, 107, 122, 104, 116, 109, 142, 114, 125, 137, 135, 123, 121, 101, 87, 111, 109, 73, 84, 106, 72, 50, 118, 138, 102, 106, 136, 89, 124, 104, 96, 105, 109, 115, 103, 100, 138, 108, 136, 142, 118, 128, 103, 109, 110, 98, 90, 86, 109, 99, 114, 130, 103, 89, 44, 78, 107, 73, 76, 107, 97, 99, 108, 105, 96, 110, 102, 118, 114, 99, 93, 95, 92, 86, 81, 123, 126, 130, 127, 125, 108, 74, 98, 72, 121, 95, 72, 96, 98, 89, 96, 94, 98, 106, 100, 107, 115, 85, 93, 79, 91, 96, 105, 90, 108, 124, 140, 98, 111, 74, 72, 54, 118, 101, 106, 90, 92, 102, 111, 105, 104, 122, 111, 107, 78, 94, 81, 101, 95, 108, 93, 82, 101, 144, 174, 134, 104, 54, 80, 45, 77, 85, 103, 102, 100, 103, 97, 107, 95, 89, 66, 88, 68, 78, 94, 88, 100, 99, 122, 104, 67, 106, 133, 63, 97, 88, 42, 34, 87, 81, 103, 106, 86, 94, 104, 84, 96, 74, 64, 60, 72, 84, 91, 105, 94, 99, 107, 102, 87, 85, 83, 81, 83, 82, 27, 64, 81, 117, 89, 105, 100, 82, 100, 74, 94, 100, 107, 111, 90, 86, 107, 112, 124, 121, 124, 121, 132, 102, 61, 98, 78, 80, 19, 97, 90, 98, 85, 95, 96, 115, 87, 96, 102, 122, 160, 123, 115, 110, 111, 130, 121, 151, 124, 137, 164, 116, 57, 120, 100, 92, 66, 100, 112, 82, 111, 120, 101, 105, 86, 93, 125, 149, 177, 168, 128, 113, 137, 130, 138, 137, 120, 136, 110, 110, 116, 151, 85, 95, 55, 129, 103, 101, 122, 95, 111, 101, 85, 121, 141, 164, 173, 131, 123, 105, 110, 118, 94, 86, 102, 74, 90, 114, 151, 168, 67, 87, 104, 141, 93, 103, 127, 113, 117, 90, 91, 129, 148, 192, 179, 117, 130, 107, 98, 75, 69, 85, 67, 77, 101, 146, 138, 155, 110, 86, 129, 132, 86, 107, 127, 105, 112, 124, 138, 149, 165, 189, 156, 117, 128, 116, 76, 72, 51, 77, 96, 92, 114, 192, 140, 111, 115, 66, 151, 109, 68, 83, 115, 117, 139, 151, 162, 179, 187, 157, 148, 114, 104, 79, 72, 82, 99, 77, 74, 101, 126, 134, 109, 102, 116, 86, 108, 132, 80, 82, 90, 114, 136, 144, 168, 167, 170, 142, 112, 90, 108, 87, 102, 92, 86, 74, 103, 127, 141, 151, 109, 135, 113, 75, 69, 70, 72, 93, 80, 117, 122, 150, 144, 121, 121, 104, 109, 133, 109, 110, 99, 88, 112, 117, 119, 144, 137, 133, 163, 138, 97, 80, 59, 79, 84, 78, 101, 139, 129, 117, 131, 111, 105, 92, 109, 118, 120, 113, 131, 127, 123, 134, 133, 125, 127, 84, 140, 100, 124, 92, 101, 96, 82, 94, 131, 118, 107, 121, 109, 98, 107, 116, 118, 111, 108, 128, 117, 126, 115, 120, 122, 136, 108, 89, 75, 111, 134, 130, 88, 115, 125, 125, 117, 129, 102, 105, 107, 104, 102, 121, 99, 109, 103, 116, 128, 139, 143, 128, 103, 115, 112, 103, 109, 105, 101, 115, 118, 80, 93, 112, 108, 89, 101, 92, 87, 109, 127, 127, 98, 123, 128, 112, 142, 139, 143, 151, 146, 116, 88, 106, 145, 87, 100, 94, 97, 31, 26, 24, 61, 71, 92, 94, 112, 117, 119, 116, 111, 107, 137, 104, 122, 139, 142, 141, 112, 125, 112, 154, 139, 117, 97, 88, 130, 55, 17, 13, 42, 53, 54, 77, 83, 59, 74, 88, 92, 97, 81, 107, 89, 77, 119, 105, 87, 118, 47, 111, 119, 88, 99, 98, 103, 70, 94, 49, 59, 69, 60, 78, 98, 88, 103, 93, 117, 94, 77, 105, 109, 58, 106, 115, 63, 156, 60, 81, 104, 99, 104, 94, 109, 95, 104, 81, 113, 106, 95, 43, 59, 92, 75, 48, 86, 98, 92, 80, 66, 69, 132, 100, 74, 81, 100, 110, 92, 89], [102, 106, 88, 95, 91, 108, 92, 101, 116, 105, 104, 87, 108, 121, 109, 108, 110, 105, 91, 104, 109, 110, 106, 99, 103, 97, 104, 108, 98, 110, 106, 96, 103, 114, 141, 138, 137, 150, 134, 134, 146, 135, 80, 104, 157, 142, 130, 149, 126, 140, 124, 125, 97, 89, 116, 100, 89, 92, 96, 138, 133, 130, 96, 129, 154, 162, 168, 171, 160, 132, 138, 90, 134, 152, 141, 120, 97, 106, 129, 155, 155, 123, 89, 109, 96, 117, 100, 142, 119, 118, 139, 144, 178, 200, 188, 199, 231, 245, 206, 181, 175, 167, 143, 139, 145, 113, 84, 128, 172, 129, 121, 109, 87, 95, 88, 153, 70, 83, 118, 134, 128, 157, 177, 174, 146, 143, 139, 150, 127, 142, 135, 101, 94, 98, 95, 81, 96, 144, 140, 133, 94, 110, 126, 114, 89, 63, 87, 119, 129, 122, 139, 145, 116, 130, 125, 125, 144, 141, 130, 116, 126, 108, 89, 74, 96, 154, 149, 130, 87, 111, 131, 127, 91, 92, 88, 98, 100, 99, 113, 117, 135, 116, 134, 124, 128, 114, 123, 110, 106, 93, 86, 96, 115, 133, 115, 111, 111, 144, 110, 78, 115, 107, 119, 108, 118, 106, 111, 112, 114, 131, 137, 135, 125, 114, 112, 98, 103, 109, 118, 108, 120, 138, 94, 138, 107, 108, 103, 98, 76, 104, 99, 96, 93, 93, 116, 111, 116, 113, 128, 139, 122, 106, 92, 117, 109, 108, 116, 134, 141, 115, 127, 145, 88, 78, 118, 101, 102, 101, 99, 99, 97, 104, 109, 105, 104, 110, 103, 92, 104, 102, 94, 117, 120, 118, 113, 161, 163, 158, 118, 76, 81, 71, 123, 129, 97, 110, 103, 111, 108, 109, 107, 110, 94, 88, 101, 59, 92, 99, 114, 103, 132, 139, 122, 178, 193, 130, 166, 87, 95, 77, 113, 99, 85, 103, 107, 89, 91, 93, 79, 77, 84, 94, 58, 39, 50, 73, 92, 101, 122, 122, 124, 163, 189, 161, 139, 122, 77, 105, 59, 77, 71, 83, 94, 89, 89, 85, 96, 98, 107, 116, 82, 55, 67, 78, 79, 98, 110, 124, 108, 142, 183, 164, 94, 121, 105, 100, 80, 88, 32, 80, 86, 94, 84, 82, 101, 115, 123, 117, 87, 73, 75, 72, 102, 91, 90, 89, 100, 152, 190, 132, 133, 135, 113, 79, 77, 44, 44, 84, 100, 89, 77, 97, 108, 103, 120, 97, 88, 69, 66, 76, 88, 69, 81, 91, 100, 132, 165, 89, 169, 132, 103, 69, 102, 77, 73, 122, 92, 116, 107, 107, 111, 99, 106, 113, 67, 88, 78, 60, 82, 76, 103, 88, 89, 120, 147, 124, 125, 133, 81, 92, 117, 129, 107, 145, 116, 110, 112, 128, 113, 122, 116, 91, 74, 80, 79, 81, 92, 103, 95, 104, 105, 116, 167, 172, 157, 151, 106, 125, 139, 139, 128, 136, 137, 101, 119, 124, 134, 117, 105, 83, 61, 90, 103, 123, 97, 132, 98, 100, 120, 116, 147, 186, 141, 162, 114, 114, 125, 135, 126, 131, 133, 146, 124, 121, 142, 129, 106, 82, 82, 103, 130, 138, 129, 135, 121, 134, 158, 142, 147, 182, 90, 67, 104, 116, 101, 123, 143, 135, 138, 143, 150, 160, 153, 138, 140, 108, 106, 116, 124, 143, 140, 137, 139, 144, 165, 162, 160, 186, 122, 67, 88, 125, 106, 154, 172, 163, 145, 137, 148, 164, 146, 136, 143, 116, 118, 133, 122, 122, 147, 116, 157, 141, 170, 151, 130, 147, 117, 107, 89, 143, 174, 195, 165, 110, 134, 150, 126, 114, 119, 130, 137, 141, 121, 131, 115, 124, 126, 139, 131, 145, 164, 151, 131, 132, 164, 113, 94, 105, 182, 170, 136, 115, 89, 120, 115, 132, 107, 135, 136, 160, 121, 131, 126, 106, 119, 127, 126, 141, 160, 140, 99, 102, 85, 96, 99, 115, 174, 176, 139, 101, 100, 112, 102, 134, 122, 139, 131, 126, 134, 130, 121, 125, 115, 104, 119, 129, 133, 134, 80, 81, 85, 109, 101, 107, 119, 156, 126, 96, 117, 94, 122, 130, 121, 143, 151, 157, 158, 143, 150, 135, 139, 126, 111, 106, 136, 111, 130, 127, 122, 100, 114, 110, 140, 97, 98, 88, 110, 110, 108, 105, 125, 104, 125, 130, 102, 138, 136, 140, 133, 152, 98, 125, 116, 123, 132, 109, 114, 100, 90, 98, 100, 95, 108, 84, 86, 112, 101, 87, 121, 119, 133, 122, 95, 129, 137, 128, 130, 170, 136, 134, 106, 162, 103, 108, 99, 95, 115, 109, 91, 113, 121, 99, 105, 123, 113, 82, 77, 110, 94, 68, 91, 128, 109, 102, 94, 93, 88, 83, 90, 87, 100, 108, 99, 87]]}}, {"scale": 0.13082018494606018, "zero_point": 39, "tensor": null}], "outputs": [], "description": "Quantized Matrix Multiplication Node"}, {"op_type": "QLinearAdd", "name": "QLinearAdd", "inputs": [{"scale": 0.13082018494606018, "zero_point": 39, "tensor": null}, {"scale": 0.0016989829018712044, "zero_point": 29, "tensor": {"shape": [5], "dtype": "uint8", "tensor": [154, 0, 255, 89, 51]}}, {"scale": 0.11120704561471939, "zero_point": 0, "tensor": null}], "outputs": [], "description": ""}, {"op_type": "QLinearMatMul", "name": "QLinearMatMul", "inputs": [{"scale": 0.11120704561471939, "zero_point": 0, "tensor": null}, {"scale": 0.006968568544834852, "zero_point": 149, "tensor": {"shape": [32, 5], "dtype": "uint8", "tensor": [[105, 134, 151, 127, 129], [100, 160, 224, 121, 141], [141, 153, 120, 134, 226], [135, 220, 0, 181, 186], [227, 142, 109, 188, 148], [219, 186, 80, 117, 187], [214, 154, 108, 168, 73], [96, 249, 149, 163, 171], [120, 171, 156, 221, 197], [93, 182, 167, 184, 171], [223, 159, 116, 194, 113], [193, 236, 233, 104, 117], [104, 165, 77, 102, 144], [215, 191, 207, 129, 55], [84, 205, 204, 183, 34], [168, 182, 138, 71, 208], [45, 221, 89, 203, 171], [126, 110, 132, 95, 148], [92, 148, 99, 244, 119], [195, 193, 70, 135, 182], [213, 101, 221, 171, 204], [130, 247, 233, 162, 169], [197, 118, 183, 178, 46], [117, 214, 152, 195, 97], [228, 127, 155, 191, 208], [162, 170, 132, 161, 214], [125, 96, 138, 255, 158], [162, 77, 206, 224, 152], [136, 191, 165, 164, 59], [142, 216, 94, 141, 184], [101, 108, 167, 106, 94], [173, 93, 228, 92, 176]]}}, {"scale": 0.17586244642734528, "zero_point": 124, "tensor": null}], "outputs": [], "description": "Quantized Matrix Multiplication Node"}, {"op_type": "QLinearAdd", "name": "QLinearAdd", "inputs": [{"scale": 0.17586244642734528, "zero_point": 124, "tensor": null}, {"scale": 0.0038259930443018675, "zero_point": 109, "tensor": {"shape": [32], "dtype": "uint8", "tensor": [110, 255, 234, 117, 120, 131, 129, 141, 94, 91, 97, 161, 82, 198, 206, 198, 211, 106, 127, 136, 100, 110, 199, 3, 0, 78, 202, 204, 191, 14, 112, 175]}}, {"scale": 0.09006361663341522, "zero_point": 0, "tensor": null}], "outputs": [], "description": ""}, {"op_type": "QLinearMatMul", "name": "QLinearMatMul", "inputs": [{"scale": 0.09006361663341522, "zero_point": 0, "tensor": null}, {"scale": 0.007326321676373482, "zero_point": 135, "tensor": {"shape": [10, 32], "dtype": "uint8", "tensor": [[126, 70, 170, 86, 98, 181, 171, 156, 79, 103, 89, 96, 125, 78, 100, 192, 40, 181, 92, 145, 186, 123, 132, 152, 199, 149, 132, 145, 101, 185, 107, 205], [121, 122, 95, 143, 142, 95, 124, 183, 154, 136, 122, 61, 93, 82, 165, 200, 209, 152, 205, 175, 125, 148, 112, 122, 94, 92, 191, 168, 183, 126, 167, 175], [107, 138, 130, 199, 132, 157, 91, 127, 152, 160, 153, 69, 122, 156, 25, 129, 110, 102, 174, 175, 122, 95, 193, 84, 182, 171, 201, 143, 41, 175, 85, 82], [120, 141, 187, 190, 61, 127, 149, 188, 130, 165, 113, 99, 108, 144, 21, 104, 187, 112, 17, 152, 95, 195, 153, 174, 148, 155, 108, 151, 85, 104, 85, 119], [165, 140, 191, 125, 195, 91, 153, 66, 93, 80, 135, 84, 96, 170, 219, 86, 137, 158, 108, 111, 169, 138, 194, 133, 181, 128, 77, 202, 213, 67, 181, 136], [177, 252, 198, 130, 86, 116, 118, 172, 161, 149, 68, 155, 101, 130, 54, 113, 94, 92, 115, 97, 169, 163, 154, 25, 132, 110, 184, 148, 12, 175, 155, 132], [127, 173, 166, 37, 180, 105, 182, 41, 188, 168, 128, 24, 128, 11, 41, 179, 98, 163, 149, 72, 154, 104, 68, 134, 197, 101, 198, 224, 121, 85, 136, 145], [95, 134, 120, 255, 142, 174, 188, 88, 39, 53, 174, 173, 150, 223, 138, 176, 144, 102, 165, 193, 102, 133, 127, 118, 149, 55, 196, 47, 176, 167, 159, 245], [135, 52, 89, 100, 145, 83, 31, 156, 185, 169, 146, 129, 161, 130, 34, 23, 104, 89, 128, 99, 157, 176, 59, 208, 182, 140, 104, 145, 6, 195, 106, 90], [162, 139, 75, 14, 188, 194, 132, 126, 161, 90, 154, 150, 167, 129, 178, 97, 151, 120, 77, 181, 106, 174, 179, 171, 187, 136, 0, 96, 166, 32, 183, 59]]}}, {"scale": 0.23404625058174133, "zero_point": 144, "tensor": null}], "outputs": [], "description": "Quantized Matrix Multiplication Node"}, {"op_type": "QLinearAdd", "name": "QLinearAdd", "inputs": [{"scale": 0.23404625058174133, "zero_point": 144, "tensor": null}, {"scale": 0.003336104564368725, "zero_point": 144, "tensor": {"shape": [10], "dtype": "uint8", "tensor": [35, 198, 128, 181, 187, 255, 125, 160, 0, 97]}}, {"scale": 0.23404625058174133, "zero_point": 144, "tensor": null}], "outputs": [], "description": ""}, {"op_type": "DequantizeLinear", "name": "DequantizeLinear", "inputs": [{"scale": 0.23404625058174133, "zero_point": 144, "tensor": null}], "outputs": [], "description": "Casts a int8 value into float"}, {"op_type": "Softmax", "name": "Softmax", "inputs": [{"tensor": {"name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd:0", "dtype": "?", "shape": 10, "tensor": null}, "scale": null, "zero_point": null}], "outputs": [{"tensor": {"name": "dense_2", "dtype": "?", "shape": 10, "tensor": null}, "scale": null, "zero_point": null}], "description": ""}], "input": [{"zero_point": null, "scale": null, "tensor": {"name": "dense_input", "dtype": "?", "shape": 784, "tensor": null}}], "output": [{"zero_point": null, "scale": null, "tensor": {"name": "dense_input", "dtype": "?", "shape": 784, "tensor": null}}]}