{
  "ir_version": 3,
  "engine": "TFLITE",
  "graph": [
    {
      "description": "QUANTIZE",
      "op_type": "QUANTIZE",
      "name": "QUANTIZE",
      "inputs": [
        {
          "scale": null,
          "zero_point": null,
          "tensor": {
            "shape": [1, 9],
            "dtype": "FLOAT32",
            "name": "serving_default_input:0",
            "tensor": null
          }
        }
      ],
      "outputs": [
        {
          "scale": 0.003921568859368563,
          "zero_point": -128,
          "tensor": {
            "shape": [1, 9],
            "dtype": "INT8",
            "name": "tfl.quantize",
            "tensor": null
          }
        }
      ]
    },
    {
      "description": "FULLY_CONNECTED",
      "op_type": "FULLY_CONNECTED",
      "name": "FULLY_CONNECTED",
      "inputs": [
        {
          "scale": 0.003921568859368563,
          "zero_point": -128,
          "tensor": {
            "shape": [1, 9],
            "dtype": "INT8",
            "name": "tfl.quantize",
            "tensor": null
          }
        },
        {
          "scale": 0.006641572806984186,
          "zero_point": 0,
          "tensor": {
            "shape": [10, 9],
            "dtype": "INT8",
            "name": "sequential/dense1/MatMul",
            "tensor": [
              [29, 120, 62, -39, -48, -76, 74, 79, 6],
              [-1, -54, 10, -57, 0, 66, -33, -59, -46],
              [-2, -127, -30, 2, -12, 49, -79, 71, -31],
              [-14, 0, 9, 48, -8, -65, -45, -40, -7],
              [-80, -7, -32, -87, -38, 2, 50, -14, 58],
              [6, 39, -23, -71, -6, 76, 9, -38, -56],
              [-53, 125, 31, 37, -31, 59, -63, 50, -49],
              [26, -27, 10, 32, -17, 78, -58, -64, -11],
              [-71, 72, -16, 42, 43, 26, -50, -3, 27],
              [-6, -101, -35, 17, 60, 28, -96, 72, 1]
            ]
          }
        },
        {
          "scale": 2.6045385311590508e-5,
          "zero_point": 0,
          "tensor": {
            "shape": [10],
            "dtype": "INT32",
            "name": "sequential/dense1/BiasAdd/ReadVariableOp",
            "tensor": [
              -6267, 6178, -3091, 8222, 220, 1982, -3847, 1632, -2643, 1848
            ]
          }
        }
      ],
      "outputs": [
        {
          "scale": 0.007784145884215832,
          "zero_point": -5,
          "tensor": {
            "shape": [1, 10],
            "dtype": "INT8",
            "name": "sequential/dense1/MatMul;sequential/dense1/BiasAdd",
            "tensor": null
          }
        }
      ]
    },
    {
      "description": "TANH",
      "op_type": "TANHLUT",
      "name": "TANHLUT",
      "inputs": [
        {
          "scale": 0.007784145884215832,
          "zero_point": -5,
          "tensor": {
            "shape": [1, 10],
            "dtype": "INT8",
            "name": "sequential/dense1/MatMul;sequential/dense1/BiasAdd",
            "tensor": null
          },
          "LUT": {
            "LUT": [
              -95, -95, -94, -94, -93, -93, -92, -92, -91, -91, -90, -90, -89,
              -89, -88, -88, -87, -87, -86, -86, -85, -85, -84, -83, -83, -82,
              -82, -81, -80, -80, -79, -79, -78, -77, -77, -76, -75, -75, -74,
              -74, -73, -72, -71, -71, -70, -69, -69, -68, -67, -67, -66, -65,
              -64, -64, -63, -62, -61, -61, -60, -59, -58, -57, -57, -56, -55,
              -54, -53, -53, -52, -51, -50, -49, -48, -47, -47, -46, -45, -44,
              -43, -42, -41, -40, -40, -39, -38, -37, -36, -35, -34, -33, -32,
              -31, -30, -29, -28, -27, -27, -26, -25, -24, -23, -22, -21, -20,
              -19, -18, -17, -16, -15, -14, -13, -12, -11, -10, -9, -8, -7, -6,
              -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13,
              14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 27, 28,
              29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 40, 41, 42, 43,
              44, 45, 46, 47, 47, 48, 49, 50, 51, 52, 53, 53, 54, 55, 56, 57,
              57, 58, 59, 60, 61, 61, 62, 63, 64, 64, 65, 66, 67, 67, 68, 69,
              69, 70, 71, 71, 72, 73, 74, 74, 75, 75, 76, 77, 77, 78, 79, 79,
              80, 80, 81, 82, 82, 83, 83, 84, 85, 85, 86, 86, 87, 87, 88, 88,
              89, 89, 90, 90, 91, 91, 92, 92, 93, 93, 94, 94, 95, 95, 96, 96,
              96, 97, 97, 98, 98, 99, 99
            ],
            "offset": 128,
            "reduced_LUT": {
              "reduced_lut_len": 244,
              "reduced_lut": [
                -92, -92, -91, -91, -90, -90, -89, -89, -88, -88, -87, -87, -86,
                -86, -85, -85, -84, -83, -83, -82, -82, -81, -80, -80, -79, -79,
                -78, -77, -77, -76, -75, -75, -74, -74, -73, -72, -71, -71, -70,
                -69, -69, -68, -67, -67, -66, -65, -64, -64, -63, -62, -61, -61,
                -60, -59, -58, -57, -57, -56, -55, -54, -53, -53, -52, -51, -50,
                -49, -48, -47, -47, -46, -45, -44, -43, -42, -41, -40, -40, -39,
                -38, -37, -36, -35, -34, -33, -32, -31, -30, -29, -28, -27, -27,
                -26, -25, -24, -23, -22, -21, -20, -19, -18, -17, -16, -15, -14,
                -13, -12, -11, -10, -9, -8, -7, -6, -5, -4, -3, -2, -1, 0, 1, 2,
                3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
                21, 22, 23, 24, 25, 26, 27, 27, 28, 29, 30, 31, 32, 33, 34, 35,
                36, 37, 38, 39, 40, 40, 41, 42, 43, 44, 45, 46, 47, 47, 48, 49,
                50, 51, 52, 53, 53, 54, 55, 56, 57, 57, 58, 59, 60, 61, 61, 62,
                63, 64, 64, 65, 66, 67, 67, 68, 69, 69, 70, 71, 71, 72, 73, 74,
                74, 75, 75, 76, 77, 77, 78, 79, 79, 80, 80, 81, 82, 82, 83, 83,
                84, 85, 85, 86, 86, 87, 87, 88, 88, 89, 89, 90, 90, 91, 91, 92,
                92, 93, 93, 94, 94, 95, 95, 96, 96, 96
              ],
              "head": {
                "shift": 6,
                "tuples_len": 3,
                "tuples": [
                  [2, -95],
                  [4, -94],
                  [6, -93]
                ]
              },
              "tail": {
                "shift": 6,
                "tuples_len": 3,
                "tuples": [
                  [254, 99],
                  [252, 98],
                  [250, 97]
                ]
              },
              "depth": 3,
              "min_reduce": 0,
              "asymmetric": false,
              "description": "Reduced LUT of depth 3 with 0 minimum reduce"
            }
          }
        }
      ],
      "outputs": [
        {
          "scale": 0.0078125,
          "zero_point": 0,
          "tensor": {
            "shape": [1, 10],
            "dtype": "INT8",
            "name": "sequential/dense1/Tanh",
            "tensor": null
          }
        }
      ]
    },
    {
      "description": "FULLY_CONNECTED",
      "op_type": "FULLY_CONNECTED",
      "name": "FULLY_CONNECTED",
      "inputs": [
        {
          "scale": 0.0078125,
          "zero_point": 0,
          "tensor": {
            "shape": [1, 10],
            "dtype": "INT8",
            "name": "sequential/dense1/Tanh",
            "tensor": null
          }
        },
        {
          "scale": 0.004915129859000444,
          "zero_point": 0,
          "tensor": {
            "shape": [16, 10],
            "dtype": "INT8",
            "name": "sequential/dense2/MatMul",
            "tensor": [
              [-38, 14, 50, -34, -92, -86, 94, 11, 42, 49],
              [-29, -11, 1, -87, -72, -34, 36, 52, -39, -111],
              [-5, -31, 81, -88, 10, -45, -10, 32, 18, 100],
              [-90, -1, 52, -89, -43, -59, 87, 57, 87, 30],
              [52, 67, -32, -81, -59, -58, -4, -47, 95, -11],
              [5, 47, -17, 49, -19, 46, -17, 22, 12, 46],
              [-32, -25, -80, -74, 94, 82, 63, 8, 30, -71],
              [-9, -89, 23, -67, 5, 28, 68, 14, 55, -92],
              [34, 47, 37, -82, 37, 89, 54, -67, -84, 6],
              [61, -64, -71, -61, -38, 55, 60, 18, -42, 11],
              [74, -89, 70, 14, 17, -68, -50, -83, 19, 18],
              [-125, 62, -99, 106, -73, -38, 54, 2, 43, -66],
              [-19, -69, 65, 54, -73, -93, 67, -23, 44, -39],
              [79, -31, -78, 53, -14, 11, 0, -58, 18, -25],
              [-6, -27, -60, 77, -18, 14, 11, 15, -32, -6],
              [127, -61, -65, -41, -39, 25, 90, 39, 2, -73]
            ]
          }
        },
        {
          "scale": 3.839945202344097e-5,
          "zero_point": 0,
          "tensor": {
            "shape": [16],
            "dtype": "INT32",
            "name": "sequential/dense2/BiasAdd/ReadVariableOp",
            "tensor": [
              -488, -63, -1383, -466, -798, 2380, 335, -827, 736, -824, -395,
              2848, 134, 118, -29, -821
            ]
          }
        }
      ],
      "outputs": [
        {
          "scale": 0.008518006652593613,
          "zero_point": -36,
          "tensor": {
            "shape": [1, 16],
            "dtype": "INT8",
            "name": "sequential/dense2/MatMul;sequential/dense2/BiasAdd",
            "tensor": null
          }
        }
      ]
    },
    {
      "description": "TANH",
      "op_type": "TANHLUT",
      "name": "TANHLUT",
      "inputs": [
        {
          "scale": 0.008518006652593613,
          "zero_point": -36,
          "tensor": {
            "shape": [1, 16],
            "dtype": "INT8",
            "name": "sequential/dense2/MatMul;sequential/dense2/BiasAdd",
            "tensor": null
          },
          "LUT": {
            "LUT": [
              -84, -83, -83, -82, -81, -81, -80, -79, -79, -78, -77, -77, -76,
              -75, -74, -74, -73, -72, -71, -71, -70, -69, -68, -68, -67, -66,
              -65, -64, -64, -63, -62, -61, -60, -59, -59, -58, -57, -56, -55,
              -54, -53, -52, -51, -51, -50, -49, -48, -47, -46, -45, -44, -43,
              -42, -41, -40, -39, -38, -37, -36, -35, -34, -33, -32, -31, -30,
              -29, -28, -27, -26, -25, -24, -23, -22, -21, -19, -18, -17, -16,
              -15, -14, -13, -12, -11, -10, -9, -8, -7, -5, -4, -3, -2, -1, 0,
              1, 2, 3, 4, 5, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19,
              21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36,
              37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 51,
              52, 53, 54, 55, 56, 57, 58, 59, 59, 60, 61, 62, 63, 64, 64, 65,
              66, 67, 68, 68, 69, 70, 71, 71, 72, 73, 74, 74, 75, 76, 77, 77,
              78, 79, 79, 80, 81, 81, 82, 83, 83, 84, 84, 85, 86, 86, 87, 87,
              88, 89, 89, 90, 90, 91, 91, 92, 92, 93, 93, 94, 94, 95, 95, 96,
              96, 97, 97, 98, 98, 99, 99, 100, 100, 100, 101, 101, 102, 102,
              102, 103, 103, 104, 104, 104, 105, 105, 105, 106, 106, 106, 107,
              107, 107, 108, 108, 108, 109, 109, 109, 110, 110, 110, 110, 111,
              111, 111, 111, 112, 112, 112, 113, 113, 113
            ],
            "offset": 128,
            "reduced_LUT": {
              "reduced_lut_len": 242,
              "reduced_lut": [
                -81, -81, -80, -79, -79, -78, -77, -77, -76, -75, -74, -74, -73,
                -72, -71, -71, -70, -69, -68, -68, -67, -66, -65, -64, -64, -63,
                -62, -61, -60, -59, -59, -58, -57, -56, -55, -54, -53, -52, -51,
                -51, -50, -49, -48, -47, -46, -45, -44, -43, -42, -41, -40, -39,
                -38, -37, -36, -35, -34, -33, -32, -31, -30, -29, -28, -27, -26,
                -25, -24, -23, -22, -21, -19, -18, -17, -16, -15, -14, -13, -12,
                -11, -10, -9, -8, -7, -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5, 7,
                8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 21, 22, 23, 24,
                25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40,
                41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 51, 52, 53, 54, 55,
                56, 57, 58, 59, 59, 60, 61, 62, 63, 64, 64, 65, 66, 67, 68, 68,
                69, 70, 71, 71, 72, 73, 74, 74, 75, 76, 77, 77, 78, 79, 79, 80,
                81, 81, 82, 83, 83, 84, 84, 85, 86, 86, 87, 87, 88, 89, 89, 90,
                90, 91, 91, 92, 92, 93, 93, 94, 94, 95, 95, 96, 96, 97, 97, 98,
                98, 99, 99, 100, 100, 100, 101, 101, 102, 102, 102, 103, 103,
                104, 104, 104, 105, 105, 105, 106, 106, 106, 107, 107, 107, 108,
                108, 108, 109, 109, 109, 110, 110, 110, 110
              ],
              "head": {
                "shift": 4,
                "tuples_len": 3,
                "tuples": [
                  [1, -84],
                  [3, -83],
                  [4, -82]
                ]
              },
              "tail": {
                "shift": 10,
                "tuples_len": 3,
                "tuples": [
                  [253, 113],
                  [250, 112],
                  [246, 111]
                ]
              },
              "depth": 3,
              "min_reduce": 0,
              "asymmetric": false,
              "description": "Reduced LUT of depth 3 with 0 minimum reduce"
            }
          }
        }
      ],
      "outputs": [
        {
          "scale": 0.0078125,
          "zero_point": 0,
          "tensor": {
            "shape": [1, 16],
            "dtype": "INT8",
            "name": "sequential/dense2/Tanh",
            "tensor": null
          }
        }
      ]
    },
    {
      "description": "FULLY_CONNECTED",
      "op_type": "FULLY_CONNECTED",
      "name": "FULLY_CONNECTED",
      "inputs": [
        {
          "scale": 0.0078125,
          "zero_point": 0,
          "tensor": {
            "shape": [1, 16],
            "dtype": "INT8",
            "name": "sequential/dense2/Tanh",
            "tensor": null
          }
        },
        {
          "scale": 0.005258701741695404,
          "zero_point": 0,
          "tensor": {
            "shape": [32, 16],
            "dtype": "INT8",
            "name": "sequential/dense3/MatMul",
            "tensor": [
              [
                59, 76, 0, 47, -5, -5, -44, 41, -24, 40, -42, -12, -18, 33, -24,
                -35
              ],
              [
                25, -39, 48, -40, 26, -48, 24, 19, 108, -30, 40, -19, -81, -25,
                20, 66
              ],
              [
                -17, -19, 13, 35, 8, 44, -31, 60, 33, -6, -6, -64, -39, 45, 17,
                42
              ],
              [
                26, -53, 28, 34, -31, -24, -30, 22, -45, 20, -25, -35, 28, -23,
                44, -48
              ],
              [
                22, 6, -52, -16, -64, 53, -60, -17, 25, -25, -42, -19, 55, 18,
                -5, 29
              ],
              [
                62, -67, -1, 22, 72, -56, 7, 44, -11, -19, 39, -49, 57, 41, 5,
                65
              ],
              [
                -36, -25, -25, 33, -33, -39, -45, 12, -60, -1, -45, -35, -56,
                -32, 46, -2
              ],
              [
                -127, -32, -57, -61, -32, 24, 15, 38, 5, -43, -15, -33, -124,
                -50, 65, 41
              ],
              [
                -23, 65, -59, 54, 24, 27, 42, 56, 50, 59, 50, 34, 2, 13, -54, 28
              ],
              [
                -20, 37, -24, -10, 41, -39, -19, 24, -10, 27, 39, 33, -2, -28,
                -77, 1
              ],
              [
                -111, -16, -72, -96, 41, -22, 70, 52, 87, 40, -72, 15, -49, -70,
                -34, -7
              ],
              [
                -22, -30, -46, 12, -6, 91, 37, -3, -29, -89, -56, 92, -62, -50,
                -33, -89
              ],
              [
                50, -15, 73, 37, 37, -33, -60, -30, -6, 56, 23, -38, 18, 26,
                -23, 47
              ],
              [
                31, 9, 39, -71, 51, 47, -54, 23, 5, 3, -27, 23, 59, -22, -47,
                -72
              ],
              [
                -42, -8, -13, 15, -47, -16, 54, -53, -66, -25, -52, -31, -26,
                -9, 17, -59
              ],
              [
                -39, 38, -97, -24, -16, 23, -36, -54, -10, -62, -57, 64, 40, 27,
                -5, 26
              ],
              [
                -25, 31, 44, 81, 71, -5, 71, 39, -114, 59, 7, 52, 19, -29, 66,
                91
              ],
              [
                42, -25, 13, 2, 23, -47, 46, -4, 47, -30, 39, 41, -19, 46, 61, 2
              ],
              [
                65, -53, 13, -17, -6, -20, -35, -67, -52, -63, 56, 75, -47, 16,
                65, 11
              ],
              [
                22, 50, 0, -24, 12, 0, -2, -28, -13, -36, -32, -5, 37, 31, -70,
                0
              ],
              [
                56, -30, 30, -35, -41, -18, 46, -43, 13, 16, 55, 41, -64, -38,
                4, 12
              ],
              [
                36, 46, -17, -11, 10, -38, 65, 1, 18, -26, -67, 0, -6, 20, 39,
                -70
              ],
              [
                -45, 59, -47, -30, -25, -61, -47, -46, 46, 28, -48, -36, 65, 54,
                49, 66
              ],
              [
                4, -35, 40, 44, 25, -20, -50, 34, 11, -14, -28, -7, -11, 25, -3,
                -61
              ],
              [-3, 29, 1, 13, -24, 6, 45, -64, 2, -27, 33, 55, 28, 0, 17, 28],
              [
                -11, -42, 28, -44, 21, -1, -25, 43, -58, -6, -39, 87, 39, 0, 49,
                -54
              ],
              [
                -73, 1, -6, -13, 18, -41, -41, -45, -12, 52, -54, 60, 52, 26,
                -25, 40
              ],
              [
                -41, 28, -67, 16, 15, 23, -39, 53, -41, -12, 55, 57, 54, 24, 43,
                49
              ],
              [
                -23, 75, 56, 61, 37, 50, -7, -1, 80, -23, 23, -74, -57, 17, -17,
                7
              ],
              [13, -4, -67, 33, 35, 55, 48, -35, 38, -3, 37, 51, 3, 49, 15, 66],
              [
                -71, 55, 5, 63, -62, 39, 21, 4, -17, 18, -14, 7, -49, -19, -29,
                19
              ],
              [
                -11, -65, -49, -41, 11, 54, 10, 49, 40, -22, 51, -40, 36, 41,
                51, -4
              ]
            ]
          }
        },
        {
          "scale": 4.1083607356995344e-5,
          "zero_point": 0,
          "tensor": {
            "shape": [32],
            "dtype": "INT32",
            "name": "sequential/dense3/BiasAdd/ReadVariableOp",
            "tensor": [
              3023, 1363, 76, -947, -1510, -141, 1102, 396, 1738, 1397, -1483,
              717, -970, -635, 685, -257, 2639, -875, -694, 78, 82, -927, 2471,
              247, -912, -172, 427, -1095, 3275, 3163, -2454, 561
            ]
          }
        }
      ],
      "outputs": [
        {
          "scale": 0.008794457651674747,
          "zero_point": -5,
          "tensor": {
            "shape": [1, 32],
            "dtype": "INT8",
            "name": "sequential/dense3/MatMul;sequential/dense3/BiasAdd",
            "tensor": null
          }
        }
      ]
    },
    {
      "description": "TANH",
      "op_type": "TANHLUT",
      "name": "TANHLUT",
      "inputs": [
        {
          "scale": 0.008794457651674747,
          "zero_point": -5,
          "tensor": {
            "shape": [1, 32],
            "dtype": "INT8",
            "name": "sequential/dense3/MatMul;sequential/dense3/BiasAdd",
            "tensor": null
          },
          "LUT": {
            "LUT": [
              -102, -101, -101, -100, -100, -99, -99, -99, -98, -98, -97, -97,
              -96, -96, -95, -95, -94, -94, -93, -93, -92, -92, -91, -90, -90,
              -89, -89, -88, -87, -87, -86, -86, -85, -84, -84, -83, -82, -82,
              -81, -80, -80, -79, -78, -78, -77, -76, -75, -75, -74, -73, -72,
              -72, -71, -70, -69, -69, -68, -67, -66, -65, -64, -64, -63, -62,
              -61, -60, -59, -58, -57, -57, -56, -55, -54, -53, -52, -51, -50,
              -49, -48, -47, -46, -45, -44, -43, -42, -41, -40, -39, -38, -37,
              -36, -35, -34, -33, -32, -31, -30, -29, -28, -27, -26, -24, -23,
              -22, -21, -20, -19, -18, -17, -16, -15, -13, -12, -11, -10, -9,
              -8, -7, -6, -5, -3, -2, -1, 0, 1, 2, 3, 5, 6, 7, 8, 9, 10, 11, 12,
              13, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 26, 27, 28, 29, 30,
              31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46,
              47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 57, 58, 59, 60, 61,
              62, 63, 64, 64, 65, 66, 67, 68, 69, 69, 70, 71, 72, 72, 73, 74,
              75, 75, 76, 77, 78, 78, 79, 80, 80, 81, 82, 82, 83, 84, 84, 85,
              86, 86, 87, 87, 88, 89, 89, 90, 90, 91, 92, 92, 93, 93, 94, 94,
              95, 95, 96, 96, 97, 97, 98, 98, 99, 99, 99, 100, 100, 101, 101,
              102, 102, 102, 103, 103, 104, 104, 104, 105, 105
            ],
            "offset": 128,
            "reduced_LUT": {
              "reduced_lut_len": 244,
              "reduced_lut": [
                -99, -99, -99, -98, -98, -97, -97, -96, -96, -95, -95, -94, -94,
                -93, -93, -92, -92, -91, -90, -90, -89, -89, -88, -87, -87, -86,
                -86, -85, -84, -84, -83, -82, -82, -81, -80, -80, -79, -78, -78,
                -77, -76, -75, -75, -74, -73, -72, -72, -71, -70, -69, -69, -68,
                -67, -66, -65, -64, -64, -63, -62, -61, -60, -59, -58, -57, -57,
                -56, -55, -54, -53, -52, -51, -50, -49, -48, -47, -46, -45, -44,
                -43, -42, -41, -40, -39, -38, -37, -36, -35, -34, -33, -32, -31,
                -30, -29, -28, -27, -26, -24, -23, -22, -21, -20, -19, -18, -17,
                -16, -15, -13, -12, -11, -10, -9, -8, -7, -6, -5, -3, -2, -1, 0,
                1, 2, 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 15, 16, 17, 18, 19, 20,
                21, 22, 23, 24, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37,
                38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53,
                54, 55, 56, 57, 57, 58, 59, 60, 61, 62, 63, 64, 64, 65, 66, 67,
                68, 69, 69, 70, 71, 72, 72, 73, 74, 75, 75, 76, 77, 78, 78, 79,
                80, 80, 81, 82, 82, 83, 84, 84, 85, 86, 86, 87, 87, 88, 89, 89,
                90, 90, 91, 92, 92, 93, 93, 94, 94, 95, 95, 96, 96, 97, 97, 98,
                98, 99, 99, 99, 100, 100, 101, 101, 102, 102, 102
              ],
              "head": {
                "shift": 5,
                "tuples_len": 3,
                "tuples": [
                  [1, -102],
                  [3, -101],
                  [5, -100]
                ]
              },
              "tail": {
                "shift": 7,
                "tuples_len": 3,
                "tuples": [
                  [254, 105],
                  [251, 104],
                  [249, 103]
                ]
              },
              "depth": 3,
              "min_reduce": 0,
              "asymmetric": false,
              "description": "Reduced LUT of depth 3 with 0 minimum reduce"
            }
          }
        }
      ],
      "outputs": [
        {
          "scale": 0.0078125,
          "zero_point": 0,
          "tensor": {
            "shape": [1, 32],
            "dtype": "INT8",
            "name": "sequential/dense3/Tanh",
            "tensor": null
          }
        }
      ]
    },
    {
      "description": "FULLY_CONNECTED",
      "op_type": "FULLY_CONNECTED",
      "name": "FULLY_CONNECTED",
      "inputs": [
        {
          "scale": 0.0078125,
          "zero_point": 0,
          "tensor": {
            "shape": [1, 32],
            "dtype": "INT8",
            "name": "sequential/dense3/Tanh",
            "tensor": null
          }
        },
        {
          "scale": 0.0039908066391944885,
          "zero_point": 0,
          "tensor": {
            "shape": [4, 32],
            "dtype": "INT8",
            "name": "sequential/dense4/MatMul",
            "tensor": [
              [
                102, -27, 2, -69, -16, 86, 14, -74, -16, 19, -86, -80, -16, 3,
                -54, -51, 108, -64, -11, -16, -27, -50, -2, -55, 82, 20, 4, 10,
                -5, 56, -72, 60
              ],
              [
                73, 42, 38, 5, -40, 85, -72, -79, -69, 49, -48, -100, 80, -34,
                -38, -111, 10, -47, -47, -4, -20, -45, -1, 24, -7, -73, -39, 47,
                40, 9, -24, 30
              ],
              [
                70, 85, 19, 14, -89, -19, -27, 77, 97, 82, 127, -45, 21, -100,
                12, -52, 16, -71, -97, 21, 4, 32, 70, 86, -56, -69, 22, -3, 113,
                82, 9, -86
              ],
              [
                -53, 34, 34, 42, -15, 49, -76, -56, 6, -9, -42, -26, 26, 21, 15,
                -55, -88, 66, 19, 2, -1, -71, 0, -1, -66, -63, -55, 3, -7, -85,
                -17, 38
              ]
            ]
          }
        },
        {
          "scale": 3.117817686870694e-5,
          "zero_point": 0,
          "tensor": {
            "shape": [4],
            "dtype": "INT32",
            "name": "sequential/dense4/BiasAdd/ReadVariableOp",
            "tensor": [2712, -1299, 3900, 1151]
          }
        }
      ],
      "outputs": [
        {
          "scale": 0.011285418644547462,
          "zero_point": -38,
          "tensor": {
            "shape": [1, 4],
            "dtype": "INT8",
            "name": "sequential/dense4/MatMul;sequential/dense4/BiasAdd",
            "tensor": null
          }
        }
      ]
    },
    {
      "description": "TANH",
      "op_type": "TANHLUT",
      "name": "TANHLUT",
      "inputs": [
        {
          "scale": 0.011285418644547462,
          "zero_point": -38,
          "tensor": {
            "shape": [1, 4],
            "dtype": "INT8",
            "name": "sequential/dense4/MatMul;sequential/dense4/BiasAdd",
            "tensor": null
          },
          "LUT": {
            "LUT": [
              -98, -98, -97, -96, -96, -95, -95, -94, -93, -93, -92, -91, -90,
              -90, -89, -88, -87, -87, -86, -85, -84, -83, -83, -82, -81, -80,
              -79, -78, -77, -76, -75, -75, -74, -73, -72, -71, -70, -69, -68,
              -66, -65, -64, -63, -62, -61, -60, -59, -58, -57, -55, -54, -53,
              -52, -51, -49, -48, -47, -46, -44, -43, -42, -40, -39, -38, -37,
              -35, -34, -32, -31, -30, -28, -27, -26, -24, -23, -21, -20, -19,
              -17, -16, -14, -13, -12, -10, -9, -7, -6, -4, -3, -1, 0, 1, 3, 4,
              6, 7, 9, 10, 12, 13, 14, 16, 17, 19, 20, 21, 23, 24, 26, 27, 28,
              30, 31, 32, 34, 35, 37, 38, 39, 40, 42, 43, 44, 46, 47, 48, 49,
              51, 52, 53, 54, 55, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 68,
              69, 70, 71, 72, 73, 74, 75, 75, 76, 77, 78, 79, 80, 81, 82, 83,
              83, 84, 85, 86, 87, 87, 88, 89, 90, 90, 91, 92, 93, 93, 94, 95,
              95, 96, 96, 97, 98, 98, 99, 99, 100, 101, 101, 102, 102, 103, 103,
              104, 104, 105, 105, 106, 106, 107, 107, 107, 108, 108, 109, 109,
              109, 110, 110, 111, 111, 111, 112, 112, 112, 113, 113, 113, 114,
              114, 114, 115, 115, 115, 115, 116, 116, 116, 116, 117, 117, 117,
              117, 118, 118, 118, 118, 118, 119, 119, 119, 119, 119, 120, 120,
              120, 120, 120, 120, 121, 121, 121, 121, 121, 121, 122, 122, 122,
              122
            ],
            "offset": 128,
            "reduced_LUT": {
              "reduced_lut_len": 235,
              "reduced_lut": [
                -95, -95, -94, -93, -93, -92, -91, -90, -90, -89, -88, -87, -87,
                -86, -85, -84, -83, -83, -82, -81, -80, -79, -78, -77, -76, -75,
                -75, -74, -73, -72, -71, -70, -69, -68, -66, -65, -64, -63, -62,
                -61, -60, -59, -58, -57, -55, -54, -53, -52, -51, -49, -48, -47,
                -46, -44, -43, -42, -40, -39, -38, -37, -35, -34, -32, -31, -30,
                -28, -27, -26, -24, -23, -21, -20, -19, -17, -16, -14, -13, -12,
                -10, -9, -7, -6, -4, -3, -1, 0, 1, 3, 4, 6, 7, 9, 10, 12, 13,
                14, 16, 17, 19, 20, 21, 23, 24, 26, 27, 28, 30, 31, 32, 34, 35,
                37, 38, 39, 40, 42, 43, 44, 46, 47, 48, 49, 51, 52, 53, 54, 55,
                57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 68, 69, 70, 71, 72, 73,
                74, 75, 75, 76, 77, 78, 79, 80, 81, 82, 83, 83, 84, 85, 86, 87,
                87, 88, 89, 90, 90, 91, 92, 93, 93, 94, 95, 95, 96, 96, 97, 98,
                98, 99, 99, 100, 101, 101, 102, 102, 103, 103, 104, 104, 105,
                105, 106, 106, 107, 107, 107, 108, 108, 109, 109, 109, 110, 110,
                111, 111, 111, 112, 112, 112, 113, 113, 113, 114, 114, 114, 115,
                115, 115, 115, 116, 116, 116, 116, 117, 117, 117, 117, 118, 118,
                118, 118, 118, 119, 119, 119, 119, 119
              ],
              "head": {
                "shift": 5,
                "tuples_len": 3,
                "tuples": [
                  [2, -98],
                  [3, -97],
                  [5, -96]
                ]
              },
              "tail": {
                "shift": 16,
                "tuples_len": 3,
                "tuples": [
                  [252, 122],
                  [246, 121],
                  [240, 120]
                ]
              },
              "depth": 3,
              "min_reduce": 0,
              "asymmetric": false,
              "description": "Reduced LUT of depth 3 with 0 minimum reduce"
            }
          }
        }
      ],
      "outputs": [
        {
          "scale": 0.0078125,
          "zero_point": 0,
          "tensor": {
            "shape": [1, 4],
            "dtype": "INT8",
            "name": "sequential/dense4/Tanh",
            "tensor": null
          }
        }
      ]
    },
    {
      "description": "FULLY_CONNECTED",
      "op_type": "FULLY_CONNECTED",
      "name": "FULLY_CONNECTED",
      "inputs": [
        {
          "scale": 0.0078125,
          "zero_point": 0,
          "tensor": {
            "shape": [1, 4],
            "dtype": "INT8",
            "name": "sequential/dense4/Tanh",
            "tensor": null
          }
        },
        {
          "scale": 0.006675194017589092,
          "zero_point": 0,
          "tensor": {
            "shape": [1, 4],
            "dtype": "INT8",
            "name": "sequential/output/MatMul",
            "tensor": [[99, -127, 60, 82]]
          }
        },
        {
          "scale": 5.214995326241478e-5,
          "zero_point": 0,
          "tensor": {
            "shape": [1],
            "dtype": "INT32",
            "name": "sequential/output/BiasAdd/ReadVariableOp",
            "tensor": [1101]
          }
        }
      ],
      "outputs": [
        {
          "scale": 0.002430869499221444,
          "zero_point": -128,
          "tensor": {
            "shape": [1, 1],
            "dtype": "INT8",
            "name": "StatefulPartitionedCall:01",
            "tensor": null
          }
        }
      ]
    },
    {
      "description": "DEQUANTIZE",
      "op_type": "DEQUANTIZE",
      "name": "DEQUANTIZE",
      "inputs": [
        {
          "scale": 0.002430869499221444,
          "zero_point": -128,
          "tensor": {
            "shape": [1, 1],
            "dtype": "INT8",
            "name": "StatefulPartitionedCall:01",
            "tensor": null
          }
        }
      ],
      "outputs": [
        {
          "scale": null,
          "zero_point": null,
          "tensor": {
            "shape": [1, 1],
            "dtype": "FLOAT32",
            "name": "StatefulPartitionedCall:0",
            "tensor": null
          }
        }
      ]
    }
  ],
  "operators": 11,
  "input": [
    {
      "scale": null,
      "zero_point": null,
      "tensor": {
        "shape": [1, 9],
        "dtype": "FLOAT32",
        "name": "serving_default_input:0",
        "tensor": null
      }
    }
  ],
  "output": [
    {
      "scale": null,
      "zero_point": null,
      "tensor": {
        "shape": [1, 1],
        "dtype": "FLOAT32",
        "name": "StatefulPartitionedCall:0",
        "tensor": null
      }
    }
  ]
}
