{"ir_version": 3, "engine": "TFLITE", "graph": [{"description": "FULLY_CONNECTED", "op_type": "FULLY_CONNECTED", "name": "FULLY_CONNECTED", "inputs": [{"scale": 0.003921568859368563, "zero_point": -128, "tensor": {"shape": [1, 784], "dtype": "INT8", "name": "dense_input", "tensor": null}}, {"scale": 0.010932818986475468, "zero_point": 0, "tensor": {"shape": [5, 784], "dtype": "INT8", "name": "sequential/dense/MatMul", "tensor": [[1, -1, 7, 7, -2, -7, 6, -6, -7, -4, 1, 5, 2, -9, -17, -10, -3, -4, 0, 3, 0, -5, 3, -7, 6, -2, 5, -7, 0, 4, -5, -1, 2, 6, 14, 13, 0, 10, 22, -3, 3, -19, -4, -4, -40, -6, 35, 33, 28, 21, -1, -4, 4, 4, 1, -1, 6, -5, 8, -22, 0, 24, 30, 16, 42, 48, 59, 35, 28, 30, 23, 25, 29, 30, 44, 62, 64, 41, 30, -2, -19, -18, 1, -6, -6, 6, 1, -23, -1, 1, 22, 13, 24, 21, 19, -8, -7, -15, 2, -4, -16, -11, 15, 19, 23, 32, 54, 30, 12, -8, -4, 2, -3, -1, -6, -23, 10, -6, -4, -23, -29, -23, -31, -27, -21, -24, -8, -21, -10, -5, -14, 1, -7, 4, 32, 70, 45, 33, 3, 12, 3, 6, 9, -30, -20, -28, -29, -33, -23, -17, -23, -9, -4, -25, -14, -16, -15, 1, -9, -1, 7, 1, 21, 48, 57, 42, 28, 16, -5, -10, -22, -53, -39, -29, -35, -27, -22, -12, -15, -10, -10, -22, -17, -10, -10, -8, -18, 10, 3, -4, 6, 33, 63, 63, 17, 20, -7, -18, -20, -41, -42, -37, -36, -8, 3, -7, -4, -8, -14, -8, -15, -7, -5, -3, -10, -3, -7, -1, 4, 21, 58, 55, 50, 16, 0, -17, -15, -30, -55, -29, -30, -17, -8, -8, -5, -7, -8, -12, -29, -32, -16, -16, -5, -12, 3, 6, 2, 35, 57, 120, 41, 13, -19, -17, -29, -36, -52, -33, -8, -13, 4, -4, 1, 3, 5, -10, -46, -52, -40, -19, -21, -8, -10, 6, -2, 26, 54, 92, 16, -10, -10, -27, -38, -36, -23, -7, 4, 26, 17, 27, 38, 41, 41, 23, -11, -37, -46, -30, -20, -19, -16, -13, -10, -8, 6, 70, 25, -7, -10, -15, -11, -4, 12, 57, 48, 57, 50, 39, 44, 38, 48, 49, 35, -3, -10, -4, -3, -18, -24, -17, -15, -24, -14, 31, 14, 21, -6, 20, 15, 51, 65, 79, 67, 56, 34, 30, 26, 24, 24, 43, 34, 15, 4, 3, 19, 10, 5, 6, -10, -19, -20, -13, 0, -11, 0, 15, 17, 60, 50, 43, 45, 31, 23, 15, 6, 12, 12, 22, 24, 29, 7, 3, 18, 15, 16, 1, -9, -12, -14, -10, -21, -18, 4, 16, 11, 51, 25, -1, 10, 4, 8, 1, 3, 12, 24, 32, 25, 17, 11, 3, -4, 2, 0, -13, -11, -8, -14, 5, -47, -20, 8, 0, -2, 24, -12, -39, -8, 6, 0, 7, -3, 17, 15, 21, 18, 0, 2, 9, -4, -15, -10, -14, -11, -10, -6, -11, -49, -37, -21, -11, -29, -15, -22, -37, -19, -10, -4, 1, -3, 12, 19, 16, 7, 11, 13, -7, -21, -11, -11, -10, -8, -5, -8, -32, -57, -17, 1, -17, -1, -24, -15, -20, -7, -9, -6, 9, 10, 25, 22, 14, 15, 5, -3, -9, -6, -18, 7, -16, -6, -2, -15, -49, -56, -50, 13, -20, -20, -30, -16, -10, -2, -4, 0, 5, 3, 2, -2, -6, 0, -4, -4, -10, -6, -6, -5, -23, -9, -4, -26, -57, -23, -19, 6, -14, -39, -33, -10, 1, 3, -6, 4, -5, 0, -3, -11, -3, -4, 6, -3, -5, -12, -9, -10, -3, -14, -7, -24, -84, -36, 5, 1, -19, -27, -38, -36, -16, -14, -1, 1, -11, -6, -9, -5, 1, 8, -2, -3, 0, -7, -7, -14, -14, 1, 3, -24, -52, -13, 7, 21, -14, -21, -42, -30, -5, -12, -15, 0, -2, -4, -9, 2, 1, 8, 0, -1, 2, -2, -13, 8, -3, -1, 7, -20, -57, -41, -10, 12, 7, -33, -40, -24, -4, -11, -7, -19, -10, -3, 0, 0, -8, 0, -2, 6, 5, 9, -1, 2, -2, -3, -10, -22, -23, 2, -15, 4, 7, -5, -31, -22, -9, -4, -14, 7, -6, -5, -1, 1, 5, 6, 5, 18, 13, 2, 6, 22, 2, -8, 1, -13, -4, 11, -8, -8, 0, -18, -27, -28, -23, -33, -7, 0, 1, 0, -2, -2, -13, -12, -8, -1, 8, 33, 51, 46, 28, 9, 15, -13, -10, -28, -3, 3, 7, 9, 15, -5, -28, -26, -6, -24, -19, -9, -23, -18, -7, -10, -16, 6, 11, 6, 17, 53, 46, 30, 28, -17, 3, -26, 2, 6, 6, -7, 10, -3, 20, -2, -8, -32, -7, -12, -9, -1, 5, 15, -3, -1, 2, 10, -10, 28, 36, 6, 20, 1, 1, 0, -1, -5, -4, -5, 1, -13, -15, -19, -25, -30, -24, -29, -21, -21, -61, -53, -49, -34, -60, -31, -11, 0, 11, 9, -20, 6, -5, 1, 2], [6, 4, -1, -8, -1, -3, 5, -3, -6, 7, 0, 2, 3, 0, -2, -2, 1, 7, 7, -2, -4, -4, -5, -3, 5, 7, -5, -5, 4, -5, 3, -1, 9, -2, -12, 1, -12, 15, -6, 2, 6, 2, 5, -31, -28, -6, 13, -1, 7, 7, -18, -19, 6, 2, 2, 6, -3, -4, 9, 12, -2, 11, -12, 11, 16, -3, -16, -7, -20, -38, -32, -31, -22, -24, -34, -21, -30, -23, -26, -30, -36, -17, 4, -3, 2, -8, 11, 4, 6, -29, -35, -16, 12, -26, -17, -10, -10, -21, -23, -23, -16, -20, -39, -23, -14, 1, 12, 1, 27, 19, 3, 6, 4, 13, 7, -11, -6, -34, -13, -13, -21, -12, -21, 0, -12, -24, -16, -5, -11, 3, -11, -9, 0, 12, 35, 50, 50, 26, -16, 6, -2, -3, -1, -9, -23, -29, -5, -3, -8, -9, -6, -3, -13, -6, -7, -13, -8, 2, 6, 2, 8, 9, 13, 28, 23, 1, 0, 18, -4, 6, 11, -19, -12, -10, -13, -5, -15, -9, -4, -13, -6, -9, 1, -8, 0, -4, 5, 3, 6, 1, 17, 5, 16, -9, -2, -7, 14, -12, -5, -5, -29, -18, 1, 7, 0, 1, 4, 3, 2, -2, -6, -13, -7, 8, 8, 10, 5, 4, 7, 17, 14, 16, -10, 14, 17, 34, 27, 11, -23, -10, -7, -11, -3, -4, -3, 2, -8, -11, -10, -12, 5, 0, -5, -15, 8, -2, -5, 24, 21, 17, -18, -15, 16, 45, 46, 32, -8, -1, -9, -5, 11, -2, 4, 9, 7, 8, -3, -10, -1, -2, 10, 4, -5, -3, -5, 8, 35, 29, -10, 24, 14, 43, 54, 22, 9, 15, 3, 10, 9, 20, 19, 24, 20, 28, -1, -5, 3, 6, 9, -2, 13, 7, -8, 3, 11, 45, 23, 6, 16, 43, 64, 19, 6, -3, 27, 17, 20, 14, 9, 16, 18, 13, -12, -22, -12, -14, -7, -7, -13, -5, -17, -16, -31, 0, 10, 4, 10, 26, 59, 8, -8, 11, 19, 10, 15, 6, 6, 19, 17, 10, -27, -29, -19, -13, -15, -24, -13, -17, 0, -13, -19, -37, -25, -20, -10, 16, 37, 4, 2, 16, 12, 8, 5, -1, 15, 7, 14, -8, -28, -27, -18, -11, -12, -12, -14, -5, 10, 16, 17, -26, -59, -29, 18, -5, 24, -11, 6, 13, 11, 15, 7, 7, 14, -3, 5, -18, -30, -17, -14, -9, -12, -4, 7, 5, 18, 28, 34, -4, -73, -33, 20, 6, 9, -27, 14, -8, -3, 12, 2, 13, 13, -6, -4, -38, -31, -12, -18, -8, -2, 8, 11, -2, 12, 24, 16, -18, -58, -32, 18, 18, -8, -21, -3, -9, -2, -3, 11, -3, -6, -9, -24, -46, -18, -6, -15, -3, 10, 7, 19, 13, 11, 6, -4, -47, -59, -21, 5, 18, -25, -6, -16, -2, -2, 0, -10, -11, -11, -15, -31, -29, -12, -1, 0, 16, 4, 5, 8, 14, 5, 0, -6, -37, -55, 11, -11, 25, 21, -15, -7, -9, 8, -3, -1, -8, -7, -23, -32, -19, -7, -9, -12, 5, 4, 9, -2, 5, -6, -4, -21, -43, -37, -19, 3, 21, 37, 2, 1, -3, 9, 9, 3, -5, -7, -1, 7, -9, -8, -11, 0, -4, -2, 5, 0, -5, 2, -16, -14, -47, -30, -21, -4, 12, 26, -22, -4, 4, -10, -9, 6, -1, 3, 9, 23, 10, 0, -8, 4, -3, -8, -9, -12, -5, -2, -13, -17, -32, -37, -1, -13, 24, 1, -19, -5, 6, 0, -7, -1, -4, 8, 16, 12, 5, 6, 0, -3, -7, -7, -12, -9, 0, 11, -11, -27, -19, -5, 8, -8, 10, -2, -19, -18, -10, -19, -18, 1, -2, 0, 3, 9, 12, 5, 6, 0, -2, -7, 1, -13, -6, -3, -10, -15, -2, 11, 11, -6, 7, -20, -23, -17, -13, -5, 0, 7, -1, 11, 14, 1, 4, 10, 7, 5, 11, -1, -19, -6, -9, -13, -28, -11, -7, -14, -3, -5, -4, -19, -33, -28, -1, 2, -5, -6, 6, -1, -3, -1, 7, -2, 5, -2, 5, 3, 0, -13, -12, -14, -34, -29, -27, -15, -3, -1, 0, -24, 9, -4, 4, 6, 8, -10, -6, -8, 4, -10, -2, -2, 0, 2, -8, -8, 1, -9, 0, 9, 11, 20, -14, -8, -3, -7, 3, -3, -7, 25, 55, 49, 41, 45, 18, 8, 15, 16, 4, 1, 14, 16, 1, 8, 22, -8, -11, 20, -29, -12, 12, -2, 6, -3, -1, -4, 3, 22, 18, 23, 17, 35, 33, 38, 27, 20, 50, 15, 29, 42, 63, 40, 22, 4, 1, 8, 31, -3, -5, -3, 6], [-3, -5, -5, -5, 2, 1, -4, 4, 6, 3, -2, 7, 19, 11, -3, 7, -8, -8, 1, 5, 3, -2, -6, 1, -8, -5, 6, -5, -3, -4, 0, -7, 4, -6, 30, 18, 14, 12, 21, 9, 10, 12, 12, 20, 7, 8, 38, 29, 27, 27, 17, 10, 4, 3, -7, 2, 1, 4, 10, -4, 2, 24, 23, 36, 37, 43, 46, 32, 50, 58, 53, 68, 72, 52, 53, 43, 63, 41, 42, 21, 13, 1, 4, 6, 3, -7, 4, -5, 19, 26, 40, 30, 25, 18, 11, -5, -6, -4, -6, 16, 11, 23, 36, 29, 25, 27, 23, 15, 7, -3, -9, 8, 2, -1, -12, -20, 7, 4, 4, -9, -1, -7, -19, -29, -22, -13, -19, -8, -14, -9, -17, 1, 14, 23, 38, 32, -12, -39, -18, 11, -6, 0, 19, -14, -1, -11, -8, -6, -5, -12, -18, -35, -13, -20, -4, -8, -12, -10, -14, 1, 14, 29, 31, 40, 1, -60, -21, 14, -7, -3, 15, -12, -5, -19, -21, -8, -26, -25, -20, -25, -24, -31, -32, -27, -25, -28, -15, -4, -11, 1, 8, 0, -43, -73, -52, -6, 6, -21, 16, -31, -1, 3, -18, -8, -21, -20, -23, -18, -27, -27, -25, -25, -23, -10, -23, -11, -11, -9, 9, -19, -53, -90, -48, -24, -6, -9, 10, -35, -6, -4, -12, -6, -19, -20, -16, -20, -14, -6, -19, -21, -20, -12, -20, -24, -21, -11, -18, -55, -83, -97, -62, -23, 1, -3, -3, -36, -27, -30, -24, -4, -14, -25, -20, -15, -6, -4, -2, -6, -10, -12, -19, -20, -33, -20, -31, -66, -105, -100, -62, -28, 7, 9, -17, -62, -35, -26, -18, -4, -3, -17, -13, -5, 1, 3, 10, 2, -16, -18, -11, -23, -38, -32, -31, -51, -87, -94, -62, -15, -5, -10, -29, -53, -53, -10, 1, -1, 0, -13, -4, -10, 2, -5, 11, 15, -2, -5, -17, -15, -29, -17, -20, -13, -37, -73, -41, 15, -5, -15, -27, -49, -46, -5, 14, 7, 3, 7, 7, 7, 2, 0, 32, 18, -3, -3, 0, -17, -10, 4, 8, 26, 42, -23, -36, 0, 10, -7, -10, -26, -34, -5, 13, 19, 19, 11, 24, 0, -9, 9, 25, 18, 6, 6, -10, 8, -1, 18, 28, 44, 31, -1, -40, -3, -7, 4, 0, -7, -19, -15, 28, 29, 22, 18, 7, -6, -3, 17, 36, 18, -2, -10, -10, 2, 4, 14, 42, 43, 16, 13, -25, 8, -3, 12, 10, 2, -8, -1, 29, 30, 24, 13, -3, 3, 2, 22, 36, 22, 1, 0, -11, -5, 1, 16, 22, 23, -12, -5, -49, -9, -6, 9, 6, -39, -22, -13, 12, 21, 11, 17, 11, 2, -12, 14, 44, 17, -3, -22, -9, -7, 9, 16, 7, -3, -18, -6, -43, -14, 4, 16, -9, -36, -43, -40, -13, 2, 15, 15, 29, 6, 2, 26, 35, 17, -20, -29, -3, -5, 2, 1, -9, -21, -22, -23, -36, -32, 15, 10, -28, -36, -50, -63, -60, -23, 3, 15, 17, 5, 9, 18, 27, -11, -16, -13, 5, -3, -8, -4, -23, -19, -25, -34, -14, -1, 9, -11, -44, -47, -51, -74, -66, -36, -11, 5, 12, 22, 13, 13, 4, 5, 7, 4, 9, 4, -5, -13, -33, -19, -30, -39, -8, 16, -7, -24, -33, -70, -69, -59, -38, -25, -7, -7, 15, 17, 25, 18, 17, 9, 11, 11, 14, -3, -13, -20, -33, -29, -36, -35, 3, -1, 14, -19, -25, -42, -41, -24, -13, -12, -14, -10, 7, 2, 8, 10, 21, 12, 3, 13, -5, -14, -17, -16, -31, -30, -21, -20, -6, -5, 17, 6, -17, -28, -27, 25, 9, -11, -12, -18, -14, -20, -23, -22, -11, -4, 7, 18, 7, 1, -6, -25, -15, -4, 2, -4, 22, 4, 6, 0, -20, -40, -7, 23, 31, 0, 0, -8, -23, -21, -18, -11, -11, -4, 1, 13, 15, 20, 21, 1, -3, -1, 5, 2, 20, 2, 0, 3, -6, -29, -27, 13, 0, -13, -7, -1, -3, -18, -20, -26, -32, -27, -17, -13, 1, 5, 8, 17, -2, 5, -8, 9, 6, -3, -6, -6, 0, -8, -27, -21, -32, -41, -29, -26, -41, -61, -56, -46, -41, -50, -56, -67, -53, -54, -43, -39, -6, 1, -12, 3, 1, -2, 0, -6, -5, 7, -2, -15, -14, -13, -24, -10, -7, -20, -39, -48, -41, -33, -35, -37, -39, -44, -54, -34, -34, 1, -6, 0, 5, 0, -5, 5, -6, -6, -10, -15, -2, -14, -26, -13, -38, -27, -14, -26, -27, -20, -3, -20, -17, -11, -14, -6, -22, -1, -1, -1, 6, 2], [-1, 7, 5, -6, 2, 2, 4, 6, 5, 5, 1, -1, 8, 0, 16, 12, 7, -5, -5, 1, -4, 1, -8, -5, -6, -6, 6, 6, -6, -1, 1, -7, -6, 1, -4, -3, 6, -6, 3, 3, -6, 9, 22, 21, 27, 22, -11, -16, -19, -8, -16, 10, 2, 4, -6, 4, 1, 4, -5, 8, -2, -14, -16, -11, -17, -32, -25, -2, 12, -4, -4, 7, 15, -12, -35, -52, -48, -41, -43, -22, -8, 3, 0, -2, 3, 7, -10, 12, -14, 2, -17, -7, -7, -25, -8, 7, 24, 13, 0, -5, -9, -18, -22, -21, -31, -26, -33, -20, -15, 16, -1, -8, -5, 8, 14, 23, -11, 15, -2, -7, 7, 3, 19, 7, 3, -2, 9, 2, -19, -17, -19, -23, -7, 5, -2, -12, 12, 12, 34, -7, -2, 4, 7, 22, 13, 22, 0, 1, -2, -12, -15, 11, -12, 7, -7, -9, -6, -21, -10, -10, -1, 19, 30, 3, 13, 24, 20, -16, 1, 11, 8, 40, 12, -5, 5, -19, -9, -8, 3, 6, 17, 18, 19, 21, 24, 13, 18, 11, 21, 14, -4, -9, 13, 21, 15, 19, 5, 16, 2, 18, 9, -1, -8, -13, -2, -2, -1, 7, 14, 20, 25, 20, 18, 15, 19, 10, 13, 4, -8, -10, -7, 5, -2, 20, -4, 2, 9, 22, 6, -4, -4, -2, -11, -6, -7, -3, 9, 14, 16, 14, 17, 8, 17, 11, 2, 6, 6, 3, 18, 12, 23, 22, 0, 19, 5, 30, 18, 6, 9, 5, 4, 0, -4, 10, 15, 16, 29, 19, 11, 11, 3, 5, 3, 2, 4, 12, 38, 60, 55, 22, 2, 12, 25, 31, 17, 2, 15, 21, 15, 8, 14, 11, 15, 24, 39, 30, 13, 7, 5, -3, 0, 8, -3, 20, 32, 49, 71, 25, 8, 7, 38, 29, 16, 9, 26, 22, 15, 3, 5, 11, 4, 43, 52, 30, 1, -1, 11, 3, -1, -17, -9, -4, 30, 56, 54, 18, 10, 8, 37, 13, 3, 9, 9, 4, 4, -1, -4, -7, -9, 29, 43, 13, -4, 9, 2, 0, 8, -2, -11, -24, 8, 50, 38, 20, -1, 9, 27, 5, 2, -5, -5, -3, -4, -10, -20, -34, -12, 15, 32, -1, 1, -4, -3, -2, 3, -3, -12, -15, -12, 8, 28, 18, -7, 2, 15, -13, -11, -17, -9, -14, -16, -11, -26, -43, -30, 13, 27, 10, -6, 2, -1, -1, 0, 1, -16, -18, -20, -13, 32, -5, 0, -6, 6, -4, 7, -11, -10, -8, -6, -14, -14, -37, -32, 11, 10, -5, -12, -11, 8, 0, 3, -4, -2, -8, -3, -4, 18, 18, -1, 12, 23, 32, 25, -15, -23, -10, -5, -4, -20, -30, -18, 3, 1, -19, -18, -17, -9, 0, -4, -3, 5, -8, -12, 2, 26, 13, 1, 18, 11, 42, 26, -12, -23, -24, -11, -3, -13, -14, -3, -3, -11, -14, -18, -13, -9, 6, -6, -1, 8, -7, -21, 7, 21, 16, -9, 23, 14, 33, 10, -8, -7, -26, -23, -21, -16, -26, -24, -19, -21, -18, -18, -8, -1, -6, -5, -2, 6, -21, -26, -10, -8, -8, 2, 4, 14, 14, 7, -1, -3, 2, -11, -12, -23, -45, -26, -12, -25, -17, -14, -2, -3, 2, -1, -22, -8, -25, -30, -12, -3, -2, -3, 4, 13, 16, 5, 20, 19, 9, 2, -7, -4, -10, -18, -10, -12, -16, -11, -12, -11, -7, -16, -13, -10, -28, -35, -13, -9, -5, 0, 6, 13, 5, 2, 12, 21, 12, 5, 5, 5, -4, -5, -16, -12, -10, -5, -11, -9, -7, -15, -8, -30, -34, -48, -11, -19, -5, 10, -2, 12, -3, -3, 7, 20, 11, 8, 9, 15, 10, 12, 8, 9, -4, 4, 10, 1, -11, -3, -12, -21, -6, -19, -13, -18, -14, -8, -6, 20, 16, 19, 6, 0, -7, 2, 4, 19, 22, 24, 32, 28, 24, 20, 20, 12, 4, -6, -4, -2, 16, 3, -9, -9, 7, -7, -3, 4, 23, 31, 6, 13, 20, 22, 21, 23, 16, 12, 9, 11, 3, 3, 5, 10, 19, 20, 13, 13, 8, 32, -9, 2, 4, 3, 4, 6, -7, 18, 16, 15, 8, 9, 12, 0, 10, 7, 12, 9, 7, 13, 25, 36, 30, 26, 40, 28, 1, 35, -12, 7, 6, 3, -1, 6, -8, 1, -12, -3, 10, 25, 17, 34, 27, 38, 31, 44, 35, 48, 31, 29, 29, 22, 29, 25, 26, 21, 9, -8, -4, -5, 4, -3, 7, -4, 10, 13, 26, 29, 31, 32, 20, 7, 27, 46, 37, 32, 27, 27, 22, 8, 14, 22, 17, 8, 0, -2, 4], [0, 4, -5, 7, 4, 5, 5, -4, 5, 7, -1, 2, -8, -18, 0, -4, 1, -8, -7, 8, 8, -4, 3, -6, 7, -7, -2, -1, 2, 6, 4, -1, 2, -7, -32, -26, -20, -41, -42, -58, -49, -39, -30, -45, -41, -43, -17, -22, -37, -34, -33, -21, 2, 2, -1, 2, 0, 5, 5, -17, -17, -22, -36, -40, -51, -72, -74, -85, -77, -84, -79, -72, -72, -45, -61, -46, -26, -40, -39, -46, -19, -15, 6, 3, -6, -1, 7, -12, -12, -17, -35, -60, -61, -74, -64, -77, -98, -127, -99, -101, -73, -49, -48, -22, -21, -13, -9, -5, -14, -7, -9, -7, 1, 14, -4, -12, 2, 9, -5, -33, -29, -39, -61, -26, -31, -41, -47, -57, -34, -29, -28, -24, -7, 8, 19, 14, -9, -27, -28, -12, -5, 7, -15, -14, -8, 21, 12, 10, 1, 5, -11, 0, -3, -10, 0, -12, -22, -20, -13, -17, -18, -12, -6, 5, 10, 0, -23, -6, 4, -15, 4, -11, -18, 0, 5, -1, 5, 1, -8, -1, -4, -11, -5, -5, 8, 2, -10, -5, -2, 5, 7, -13, -8, -8, -5, -17, 11, -24, 9, 15, -8, -1, 4, 4, 1, 2, 0, 9, 5, 4, 7, -3, 6, 9, 10, -2, 6, -3, -5, -14, -23, -9, 10, -30, 13, 16, 23, 25, 9, 19, 10, 11, 9, 6, -2, 2, 1, -6, 5, 6, 0, -4, 8, -5, 0, -11, -8, -15, -27, -4, -25, -25, 18, 8, 9, 32, 4, 22, 1, 0, 4, 2, 1, 9, 11, 8, 10, 9, 3, 12, 8, 3, -1, -5, -1, -24, -41, -40, -42, -11, 12, 13, 4, 19, -7, -5, 2, -6, 1, 5, -2, -2, 14, -1, -1, 23, 9, 5, 7, 2, 6, 2, -4, -37, -53, -41, -42, -3, 24, 29, 2, 9, -2, 11, 8, 13, 12, 4, 16, 12, 9, -14, -1, 40, 23, 19, 20, 14, 6, 7, -1, -40, -65, -50, -27, 14, 16, 8, 38, 12, 29, 5, 14, 28, 13, 14, 3, 7, -12, -22, 1, 32, 29, 22, 17, 5, 9, 0, 16, -35, -76, -35, -3, 2, -9, -2, 46, 4, 48, 22, 1, 12, 9, 3, 13, -1, -24, -25, 8, 20, 19, 13, 13, 15, 26, 33, 24, -46, -62, -27, -10, -13, -11, 14, 14, 20, 48, 8, 3, 15, 6, -2, -7, -18, -16, -7, 9, 17, 18, 20, 20, 22, 22, 14, 13, -32, -48, -36, -57, -22, -5, 15, -14, 19, 29, 8, 7, 14, 2, -10, 2, -4, -10, -23, -7, 23, 22, 30, 22, 16, 14, 9, 10, -30, -56, -49, -23, -22, 9, 4, 0, -18, 4, 0, 8, 9, 22, 4, -10, -11, -10, 4, 14, 17, 20, 21, 2, 5, 11, 13, 2, -46, -57, -73, -48, -18, -1, 11, -8, -28, -12, -9, -14, 8, 20, 4, -3, -7, 6, 19, 12, 15, 3, 10, -3, -13, -7, -4, -24, -40, -63, -66, -58, -23, -8, 21, -10, -30, -18, -18, -32, -8, -10, -11, -11, 1, 2, 4, 15, 14, 0, -17, -8, -5, -1, -15, -40, -86, -75, -53, -18, -13, 9, 5, 9, 0, -16, -16, -29, -31, -35, -47, -36, -27, -18, -15, -4, -13, -28, -14, -28, -22, -24, -39, -67, -73, -68, -29, -17, -3, 5, 7, 3, -14, -34, -42, -39, -42, -27, -24, -27, -36, -23, -22, -16, -26, -15, -23, -34, -29, -33, -34, -47, -52, -31, -5, -22, -13, 0, -2, -22, -43, -19, -35, -33, -19, -16, -6, -8, -22, -25, -33, -18, -26, -10, -19, -30, -17, -14, -23, -26, -32, -17, 3, -27, 2, 0, 9, -25, -30, -26, -9, -12, 1, 4, 3, -3, -5, -13, -19, -13, -8, -10, -9, -7, -20, -25, -25, -10, -18, -13, -8, -28, 8, -5, 6, -39, -38, -10, -5, -8, 14, -11, -18, -11, -12, -21, -17, -13, -27, -12, -6, -11, -6, -12, -10, -5, -6, -5, -10, -13, -2, -4, -5, -19, -19, -7, 15, 6, -5, -5, -19, -8, -22, -23, -13, -28, -30, -20, -21, -15, 2, 6, 10, -2, 0, -16, -21, -15, 5, 7, -6, -20, 15, 12, 25, -4, 12, -4, -9, -10, -2, -6, -12, -6, -8, -11, -11, -13, 8, 42, 20, -4, 4, -15, -3, -15, -4, 2, 8, 7, 0, 22, 35, 60, 58, 56, 50, 34, 24, 10, 16, 37, 31, -4, 4, -5, 9, 13, 5, 17, 6, 18, 10, -3, 2, 3, 2, -3, -1, 10, 10, 35, 26, 18, 33, 39, 53, 33, 48, 61, 63, 84, 74, 18, 19, 30, 29, 29, 21, -2, -4, -7, 5]]}}, {"scale": 4.287380215828307e-05, "zero_point": 0, "tensor": {"shape": [5], "dtype": "INT32", "name": "sequential/dense/BiasAdd/ReadVariableOp/resource", "tensor": [-545, 11656, 480, 5180, 789]}}], "outputs": [{"scale": 0.19090917706489563, "zero_point": 41, "tensor": {"shape": [1, 5], "dtype": "INT8", "name": "sequential/dense/MatMul;sequential/dense/BiasAdd", "tensor": null}}]}, {"description": "LOGISTIC", "op_type": "SIGMOIDLUT", "name": "SIGMOIDLUT", "inputs": [{"scale": 0.19090917706489563, "zero_point": 41, "tensor": {"shape": [1, 5], "dtype": "INT8", "name": "sequential/dense/MatMul;sequential/dense/BiasAdd", "tensor": null}, "LUT": {"LUT": [-128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -127, -127, -127, -127, -127, -127, -126, -126, -125, -125, -124, -123, -122, -121, -120, -118, -116, -114, -111, -108, -104, -100, -95, -89, -82, -75, -66, -57, -47, -36, -24, -12, 0, 12, 24, 36, 47, 57, 66, 75, 82, 89, 95, 100, 104, 108, 111, 114, 116, 118, 120, 121, 122, 123, 124, 125, 125, 126, 126, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127], "offset": 128, "reduced_LUT": {"reduced_lut_len": 47, "reduced_lut": [-125, -125, -124, -123, -122, -121, -120, -118, -116, -114, -111, -108, -104, -100, -95, -89, -82, -75, -66, -57, -47, -36, -24, -12, 0, 12, 24, 36, 47, 57, 66, 75, 82, 89, 95, 100, 104, 108, 111, 114, 116, 118, 120, 121, 122, 123, 124], "head": {"shift": 145, "tuples_len": 3, "tuples": [[137, -128], [143, -127], [145, -126]]}, "tail": {"shift": 64, "tuples_len": 3, "tuples": [[196, 127], [194, 126], [192, 125]]}, "depth": 3, "min_reduce": 0, "asymmetric": false, "description": "Reduced LUT of depth 3 with 0 minimum reduce"}}}], "outputs": [{"scale": 0.00390625, "zero_point": -128, "tensor": {"shape": [1, 5], "dtype": "INT8", "name": "sequential/dense/Sigmoid", "tensor": null}}]}, {"description": "FULLY_CONNECTED", "op_type": "FULLY_CONNECTED", "name": "FULLY_CONNECTED", "inputs": [{"scale": 0.00390625, "zero_point": -128, "tensor": {"shape": [1, 5], "dtype": "INT8", "name": "sequential/dense/Sigmoid", "tensor": null}}, {"scale": 0.0200429018586874, "zero_point": 0, "tensor": {"shape": [32, 5], "dtype": "INT8", "name": "sequential/dense_1/MatMul", "tensor": [[-66, 74, 36, -3, 95], [-6, -81, 72, -38, 102], [69, 91, -69, -30, 38], [8, -25, -105, 103, -3], [-73, -74, 41, 17, -57], [-4, -13, -82, 114, 13], [-78, 92, -56, 28, 17], [-84, 11, -73, 40, 90], [58, -71, 75, -14, -67], [89, -16, 6, -12, 29], [75, 109, -23, -57, -127], [-70, 66, 43, -30, -95], [-49, -102, -55, -42, -54], [76, 89, -78, -19, 35], [27, -80, 80, -60, 34], [-75, -108, 21, 17, -27], [-10, -30, -15, 80, -50], [33, 85, -4, -57, 57], [-33, 98, 43, -91, -96], [-9, 70, 14, -28, 88], [62, -16, 41, -16, 66], [58, -67, 74, -3, -63], [-15, 48, -73, 57, -58], [40, -90, -43, 77, -58], [-4, -18, 39, 5, -104], [69, -62, 60, -14, -73], [-39, 1, 15, 61, -61], [-29, -75, 30, 45, -63], [66, -61, 48, -7, 72], [55, 93, 4, -63, -22], [-34, 72, -76, 25, -84], [85, -52, -27, -37, 4]]}}, {"scale": 7.829258538549766e-05, "zero_point": 0, "tensor": {"shape": [32], "dtype": "INT32", "name": "sequential/dense_1/BiasAdd/ReadVariableOp/resource", "tensor": [-7448, 362, -216, -2674, 5381, -3428, -3158, -524, 1121, -4424, 822, 4950, 10288, -1496, 2806, 4809, 2749, -2988, 10245, -5365, -5449, -3605, 892, -1717, 5480, 1358, 4243, 1297, -5555, -1428, 6084, -1165]}}], "outputs": [{"scale": 0.0326266884803772, "zero_point": 16, "tensor": {"shape": [1, 32], "dtype": "INT8", "name": "sequential/dense_1/MatMul;sequential/dense_1/BiasAdd", "tensor": null}}]}, {"description": "LOGISTIC", "op_type": "SIGMOIDLUT", "name": "SIGMOIDLUT", "inputs": [{"scale": 0.0326266884803772, "zero_point": 16, "tensor": {"shape": [1, 32], "dtype": "INT8", "name": "sequential/dense_1/MatMul;sequential/dense_1/BiasAdd", "tensor": null}, "LUT": {"LUT": [-126, -126, -126, -125, -125, -125, -125, -125, -125, -125, -125, -125, -125, -124, -124, -124, -124, -124, -124, -124, -124, -123, -123, -123, -123, -123, -123, -122, -122, -122, -122, -122, -122, -121, -121, -121, -121, -120, -120, -120, -120, -119, -119, -119, -119, -118, -118, -118, -117, -117, -117, -116, -116, -115, -115, -115, -114, -114, -113, -113, -112, -112, -112, -111, -110, -110, -109, -109, -108, -108, -107, -106, -106, -105, -104, -104, -103, -102, -101, -101, -100, -99, -98, -97, -96, -95, -94, -94, -93, -92, -90, -89, -88, -87, -86, -85, -84, -83, -81, -80, -79, -77, -76, -75, -73, -72, -71, -69, -68, -66, -65, -63, -61, -60, -58, -56, -55, -53, -51, -49, -48, -46, -44, -42, -40, -38, -37, -35, -33, -31, -29, -27, -25, -23, -21, -19, -17, -15, -12, -10, -8, -6, -4, -2, 0, 2, 4, 6, 8, 10, 12, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 38, 40, 42, 44, 46, 48, 49, 51, 53, 55, 56, 58, 60, 61, 63, 65, 66, 68, 69, 71, 72, 73, 75, 76, 77, 79, 80, 81, 83, 84, 85, 86, 87, 88, 89, 90, 92, 93, 94, 94, 95, 96, 97, 98, 99, 100, 101, 101, 102, 103, 104, 104, 105, 106, 106, 107, 108, 108, 109, 109, 110, 110, 111, 112, 112, 112, 113, 113, 114, 114, 115, 115, 115, 116, 116, 117, 117, 117, 118, 118, 118, 119, 119, 119, 119, 120, 120, 120, 120, 121, 121, 121, 121], "offset": 128, "reduced_LUT": {"reduced_lut_len": 223, "reduced_lut": [-123, -123, -123, -123, -123, -123, -122, -122, -122, -122, -122, -122, -121, -121, -121, -121, -120, -120, -120, -120, -119, -119, -119, -119, -118, -118, -118, -117, -117, -117, -116, -116, -115, -115, -115, -114, -114, -113, -113, -112, -112, -112, -111, -110, -110, -109, -109, -108, -108, -107, -106, -106, -105, -104, -104, -103, -102, -101, -101, -100, -99, -98, -97, -96, -95, -94, -94, -93, -92, -90, -89, -88, -87, -86, -85, -84, -83, -81, -80, -79, -77, -76, -75, -73, -72, -71, -69, -68, -66, -65, -63, -61, -60, -58, -56, -55, -53, -51, -49, -48, -46, -44, -42, -40, -38, -37, -35, -33, -31, -29, -27, -25, -23, -21, -19, -17, -15, -12, -10, -8, -6, -4, -2, 0, 2, 4, 6, 8, 10, 12, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 38, 40, 42, 44, 46, 48, 49, 51, 53, 55, 56, 58, 60, 61, 63, 65, 66, 68, 69, 71, 72, 73, 75, 76, 77, 79, 80, 81, 83, 84, 85, 86, 87, 88, 89, 90, 92, 93, 94, 94, 95, 96, 97, 98, 99, 100, 101, 101, 102, 103, 104, 104, 105, 106, 106, 107, 108, 108, 109, 109, 110, 110, 111, 112, 112, 112, 113, 113, 114, 114, 115, 115, 115, 116, 116, 117, 117, 117, 118, 118, 118], "head": {"shift": 21, "tuples_len": 3, "tuples": [[3, -126], [13, -125], [21, -124]]}, "tail": {"shift": 12, "tuples_len": 3, "tuples": [[252, 121], [248, 120], [244, 119]]}, "depth": 3, "min_reduce": 0, "asymmetric": false, "description": "Reduced LUT of depth 3 with 0 minimum reduce"}}}], "outputs": [{"scale": 0.00390625, "zero_point": -128, "tensor": {"shape": [1, 32], "dtype": "INT8", "name": "sequential/dense_1/Sigmoid", "tensor": null}}]}, {"description": "FULLY_CONNECTED", "op_type": "FULLY_CONNECTED", "name": "FULLY_CONNECTED", "inputs": [{"scale": 0.00390625, "zero_point": -128, "tensor": {"shape": [1, 32], "dtype": "INT8", "name": "sequential/dense_1/Sigmoid", "tensor": null}}, {"scale": 0.01331605389714241, "zero_point": 0, "tensor": {"shape": [64, 32], "dtype": "INT8", "name": "sequential/dense_2/MatMul", "tensor": [[-16, 55, 34, -41, -27, -65, -20, -3, 16, 22, -11, 10, 32, 18, 54, -21, -37, 48, 1, 13, 1, 14, -65, -27, -26, 16, -52, -35, 2, 22, -34, 13], [-24, -19, -25, -21, 33, -27, -15, -52, 49, -17, 21, 29, -6, -38, -7, 24, 24, -1, 60, -25, 4, 39, -12, 14, 36, 29, 21, 1, -10, 7, 31, -5], [-32, -22, 77, 23, -56, 1, 0, 7, -17, 8, 72, 2, 8, 89, -31, -66, -8, 46, 40, 24, 12, -32, 10, -29, -13, -3, -16, -56, -8, 60, 39, 39], [13, 39, -94, -2, 73, 11, -36, -19, 20, -7, -108, 4, 13, -85, 13, 71, 19, -64, -36, -7, 7, 22, -10, 21, 16, 1, 31, 62, 24, -67, -50, -32], [-62, -60, -22, 56, 25, 13, 3, -28, 25, -10, 51, 26, -26, -26, -44, 20, 38, -62, 13, -37, -40, 24, 26, 62, 63, 10, 25, 33, -8, -34, 21, -17], [-62, 32, -31, 11, 57, 29, -43, 0, 52, 26, -38, -18, 48, -34, 46, 52, 43, -49, -61, -30, -2, 59, -17, 76, 32, 67, 23, 70, 25, -44, -13, 42], [-6, 34, 64, 35, -16, 12, 15, 67, -22, 17, -48, -47, 60, 49, 11, 3, -29, 35, -86, -3, 15, -27, -15, -1, -41, -31, -34, -33, 13, -24, -28, 41], [-35, 2, 5, -30, -31, -32, -65, -91, 83, 28, 59, -30, -20, 8, 37, -44, -21, 32, -13, -8, 46, 85, -27, 29, 14, 68, -21, -2, 48, 36, -44, 56], [61, 49, 44, -15, -40, 10, 32, 73, -63, 29, -62, -42, 24, 23, 3, 4, -50, 59, -41, 70, 41, -46, -33, -45, -88, -36, -51, -55, 35, 6, -34, 35], [-8, 44, -10, -40, 19, -48, -64, -66, 72, 4, 33, 16, 25, -31, 75, 32, -17, -11, 16, -17, 14, 35, -37, 12, 42, 60, -19, 5, 13, -3, -38, 25], [40, 37, 19, 23, -30, 39, -10, 71, -43, 38, -80, -73, -26, 25, 29, 6, -20, 41, -67, 64, 43, -34, -43, -34, -66, -46, -19, -9, 26, -5, -62, 2], [-61, -64, -6, 30, 5, -3, -32, -61, 46, -6, 61, 31, -45, -22, -44, -38, 30, -26, 23, -45, -27, 43, 14, 48, 43, 51, 33, 44, -26, 2, 7, -28], [27, 35, -49, -64, 74, -57, -16, -8, 18, -15, -59, 30, 64, -51, 71, 52, -14, 2, 26, 21, -12, 37, -39, -37, 25, 27, 11, 16, 17, -25, -55, 5], [-38, -22, -44, -1, 54, -22, -29, -70, 70, -28, 44, 43, 18, -33, -11, 34, 37, -47, 89, -54, -35, 69, 33, 30, 76, 55, 47, 23, -22, -2, 46, -17], [2, 27, 33, -93, 15, -67, 9, -48, 5, -8, 40, 58, 66, 21, 44, -1, -31, 58, 106, 14, -8, 1, -41, -82, -14, -2, -30, -12, -5, 43, 6, 21], [-15, 67, -21, -51, 23, -30, -50, -57, 52, 19, -34, -24, 68, -18, 71, 50, -29, -9, 6, 5, 27, 65, -30, 3, 28, 61, -18, 33, 36, 23, -39, 39], [-1, -4, 38, -78, -31, -49, 8, -65, 20, 2, 82, 78, 33, 34, 12, -28, -54, 66, 127, 30, -9, -3, -33, -78, 16, 13, -50, -30, -32, 57, 50, -3], [-9, -25, -6, 69, 7, 58, 22, 68, -34, -6, -11, 29, 30, 25, -19, 13, 21, -15, 8, -29, -38, -35, 54, 41, 20, -33, 40, 30, -20, -25, 36, 2], [34, -30, -32, 3, 47, 11, 48, 17, 5, -4, 55, 64, 0, -17, -40, 39, 17, -20, 48, 6, -10, -3, 47, -6, 55, -2, 52, 45, -31, -10, 52, -51], [-31, 2, -78, 34, 57, 40, -39, -8, 47, -13, -83, -31, 29, -69, -4, 57, 63, -69, -76, -58, -25, 46, 22, 44, 33, 39, 41, 44, -9, -56, 3, -24], [-35, -47, -22, -25, 48, -45, -11, -80, 70, 2, 87, 75, 15, -17, -1, 26, 22, -33, 99, -24, -19, 40, 31, 30, 86, 46, 23, 25, -32, 24, 38, 12], [19, 38, -99, -37, 61, -30, -26, -18, 24, -19, -55, 57, -32, -80, 57, 48, 25, -37, 67, -2, 7, 18, -27, -10, 26, 4, 42, 44, 4, -13, -27, -34], [13, 24, 39, 12, -61, 29, -27, -45, 39, 61, 17, -86, -89, 42, 10, -65, -4, 16, -95, 20, 68, 40, -28, 19, -43, 49, -17, -34, 66, 9, -53, 53], [-16, -23, 70, -36, -51, -31, 4, -40, 7, 1, 65, 21, 29, 57, 11, -49, -56, 43, 73, 23, 4, 8, 15, -39, -13, 4, -35, -45, -24, 73, 39, 36], [-10, 9, -26, 75, 48, 51, -17, 43, -12, 17, -74, -61, 44, -16, -6, 39, 29, -43, -93, -12, 11, 4, 26, 69, -16, 4, 5, 45, 15, -68, 3, 11], [-3, -29, -30, 97, 39, 97, 35, 29, -19, -19, -40, -25, -25, -20, -52, 39, 61, -57, -49, -14, -10, -3, 48, 53, 14, -22, 43, 60, -23, -29, 23, -38], [-13, -27, 12, 78, -37, 50, -15, 50, -30, 16, -47, -33, -33, 12, -33, -23, 16, -16, -93, -11, 14, -29, 24, 66, -24, -36, 22, -11, 22, -9, -11, 18], [-8, -33, 67, 39, -76, 38, -42, -31, 6, 58, 50, -71, -56, 49, -41, -46, 7, 29, -85, -3, 50, 8, 21, 26, -13, 25, -37, -33, 56, 15, -20, 49], [48, 36, 44, -33, -24, 4, 46, 59, -64, -13, 19, 40, -10, 36, 13, -16, -36, 29, 24, 42, 1, -48, -8, -68, -37, -35, -33, -22, -21, 13, -3, -24], [77, 31, 38, -65, -42, -38, 46, -2, -27, 6, 43, 27, -18, 29, 26, -33, -43, 69, 78, 64, 31, -13, -37, -52, -17, -32, -26, -52, -14, 47, -11, -14], [-24, 36, -29, -45, 35, -37, -53, -53, 65, 16, -7, 39, 50, -46, 80, 16, -26, 3, 60, -15, 20, 64, -45, -33, 43, 33, 7, 9, 32, 14, -42, 24], [-41, -63, 29, 65, -9, 36, 75, 34, -43, -25, 51, 31, 60, 20, -87, 20, 14, -10, 39, -12, -52, -47, 85, 15, 2, -25, 11, 10, -39, 6, 109, -46], [-70, 0, -15, 2, -16, 21, -76, -76, 65, 16, 17, -26, -1, 19, 43, 7, 4, -13, -27, -21, 34, 74, -15, 58, 17, 68, -5, 44, 47, 13, -34, 56], [44, -17, 72, 76, -51, 79, 29, 64, -39, 21, -1, -56, -71, 49, -45, -79, 19, 37, -65, 30, 28, -40, 17, 22, -57, -55, -10, -28, 2, 26, 15, 18], [-81, -11, -7, 5, 21, -12, -33, -54, 42, 6, 51, 3, 46, 13, -8, 10, 7, -21, 24, -60, -14, 32, 4, 56, 58, 58, 9, 41, 0, -4, 23, 38], [-62, -49, 53, -3, -41, -27, -23, -33, -17, 23, 115, 23, 6, 63, -16, -63, -25, 19, 81, -30, -13, 3, 16, 11, -2, 8, -11, -10, -35, 38, 49, 25], [-51, -51, -6, -7, 1, -30, -19, -91, 45, -1, 85, 40, 16, -28, -24, -23, 19, -23, 65, -66, -25, 24, 33, 15, 64, 36, 9, 18, -59, 18, 60, -9], [-16, 4, 40, -59, -26, -70, -23, -22, 16, -7, 36, 18, 42, 3, 14, -3, -60, 52, 49, 16, 13, 4, -31, -60, -11, 2, -26, -33, 15, 26, -12, 26], [57, 70, -27, -56, 16, -25, 57, 16, 1, -6, -18, 47, -4, -32, 37, 16, -38, 52, 62, 61, 25, -12, -34, -39, -19, -31, -20, 0, 8, -2, -35, -7], [49, 45, -44, 19, 51, 34, 64, 69, -59, -27, -66, 22, 17, -46, -5, 56, 20, -13, -9, 39, 13, -53, -6, -31, -33, -61, 30, 15, -7, -40, 7, -37], [25, 28, 0, 34, 12, 31, 0, 84, -18, -12, -62, -25, 75, 15, 9, 52, -9, -14, -27, 11, 11, -36, -7, 14, -40, -33, -3, -8, 6, -44, 28, 24], [58, 15, -5, 9, 61, 16, 55, 82, -39, -54, -35, 44, 62, -36, -26, 76, 5, -20, 25, -8, -54, -70, 29, -15, 20, -56, 14, 22, -29, -37, 57, -65], [-5, 73, -28, -27, 15, -28, -50, -29, 62, 17, -67, -16, 49, -24, 106, 24, -29, 3, -22, -15, 46, 62, -64, 17, 22, 62, -34, 16, 39, -17, -64, 53], [12, -27, 85, 31, -41, 20, 34, 17, -56, 8, 59, 8, -34, 72, -53, -71, -21, 56, 35, 45, -7, -43, 23, -10, -21, -31, 1, -26, -38, 58, 46, 6], [-25, -63, -21, 6, 3, 15, 31, -23, -40, -41, 22, 49, 2, -1, -47, 2, 30, -48, 58, -32, -34, -36, 44, 19, 38, -4, 11, 13, -67, -15, 49, -30], [39, 45, -62, 72, 23, 43, -6, 52, 7, -9, -107, -48, -5, -51, 23, 54, 45, -43, -111, -19, 15, 25, -9, 43, -18, -21, 17, 50, 49, -56, -26, -10], [-60, -9, -26, 39, 35, 46, -46, -16, 34, 0, -35, -29, 48, -9, 2, 45, 51, -31, -40, -36, -7, 34, 9, 86, 53, 47, 12, 41, 25, -37, -7, 13], [-55, -35, 13, 34, -37, 16, -29, -13, 14, 32, -8, -50, -20, 37, 3, -12, 7, -18, -52, -42, 16, 9, 21, 36, 10, 13, -9, 3, 17, -31, -2, 21], [85, 29, 59, 2, -30, -10, 68, 71, -43, -2, -23, 15, -31, 34, -12, -21, -10, 44, 24, 66, 9, -59, 7, -44, -31, -48, -7, -53, 11, 30, 14, -11], [36, -2, 60, 38, -64, 43, 14, 47, -38, 20, -9, -29, 1, 62, -8, -31, -29, 23, -37, 38, 28, -51, 3, -10, -40, -40, -45, -42, 9, -2, -18, 13], [-21, 23, -64, 24, 41, 35, -30, 11, 25, -15, -84, -12, 56, -59, 0, 64, 55, -40, -56, -52, -5, 31, 20, 62, 12, 12, 20, 50, 17, -75, -37, -1], [18, -34, 17, 50, -4, 20, 50, 64, -79, -22, -30, 11, -2, 7, -80, 12, -3, -2, -17, 24, -5, -85, 17, -3, -34, -86, -8, -14, -20, -39, 26, -43], [-27, 3, 30, 44, -41, 53, -24, 18, 14, 13, -1, -87, 7, 39, -4, -10, 1, 3, -90, 5, 26, -6, -9, 27, -36, -4, -27, 2, 57, -18, -11, 46], [61, 22, 22, -46, -1, -25, 66, 47, -47, -9, 18, 28, 31, -8, -3, 22, -50, 42, 62, 39, -19, -50, -22, -83, -37, -44, -20, -42, -37, 22, 9, -3], [55, -22, -5, -22, 56, 4, 70, 68, -50, -59, 19, 92, 39, -16, -12, 53, 23, -8, 80, 17, -29, -49, 30, -41, 13, -45, 16, 14, -69, -18, 69, -64], [46, 25, 1, -88, 10, -74, 35, -52, 6, -6, 27, 81, -3, 3, 38, 5, -47, 32, 117, 41, 17, 16, -11, -76, 17, 23, 15, -9, -7, 56, -14, -15], [-30, -54, 19, 70, -22, 46, 33, 53, -43, -16, 16, 7, 15, 14, -44, -12, 38, 6, 5, -2, -13, -21, 36, 27, 10, -42, 19, -10, -33, 5, 45, -6], [-20, -60, 54, 46, 18, 22, 77, 79, -69, -19, 30, 42, 97, 33, -37, 23, 11, 15, 66, -21, -35, -63, 51, 12, 12, -46, -1, -34, -49, 16, 94, -17], [38, -54, 1, 45, 6, 44, 73, 71, -84, -38, 23, 21, 1, 18, -65, -11, 19, 4, 36, -2, -52, -63, 50, -10, 2, -81, 5, -3, -64, -2, 72, -32], [42, -8, 26, -21, -44, -1, -11, -13, -28, 28, 18, -25, -27, 12, -13, -64, -19, 23, -17, 15, 26, -31, -8, -25, -30, -31, -46, -36, 16, 4, -24, -6], [40, -46, -13, 49, 10, 50, 72, 44, -83, -31, -19, -15, -39, 12, -84, -17, 6, -7, -23, 6, -30, -59, 50, -27, -26, -73, 35, -11, -15, -10, 31, -61], [26, -36, 53, -3, -40, 6, 30, -36, -28, 27, 45, -1, -92, 42, -33, -80, -9, 46, 21, 33, 30, -1, 1, -35, -14, -11, -28, -36, 10, 45, -4, -6], [15, 21, -55, 23, 30, 21, -20, 9, 7, 4, -84, -50, 46, -25, 33, 48, 15, -20, -68, 8, 22, 23, 4, 20, -26, 12, -1, 26, 36, -27, -53, 2], [-6, 60, -9, -1, -3, -15, -66, -24, 51, 32, -58, -85, -55, -20, 57, 5, -8, -10, -80, 7, 34, 50, -53, 17, -15, 25, -40, 24, 54, -19, -72, 19]]}}, {"scale": 5.201583553571254e-05, "zero_point": 0, "tensor": {"shape": [64], "dtype": "INT32", "name": "sequential/dense_2/BiasAdd/ReadVariableOp/resource", "tensor": [385, -747, 717, -1966, -2368, 888, 938, 2891, 2539, 736, 1693, -2373, 891, 846, 1813, 2076, 1759, 1568, 855, -1245, 1602, -36, 766, 1893, 462, 61, -700, -594, 1828, 1305, 1474, -816, -193, 988, 514, -294, -2813, -1174, 2547, 1277, 1728, 1835, 1397, 2145, -3938, 414, 265, -1146, 2955, 1071, -127, -840, 166, 1506, 2476, 1539, 446, 1600, -1339, -257, -1889, -884, -209, -750]}}], "outputs": [{"scale": 0.047650933265686035, "zero_point": 2, "tensor": {"shape": [1, 64], "dtype": "INT8", "name": "sequential/dense_2/MatMul;sequential/dense_2/BiasAdd", "tensor": null}}]}, {"description": "LOGISTIC", "op_type": "SIGMOIDLUT", "name": "SIGMOIDLUT", "inputs": [{"scale": 0.047650933265686035, "zero_point": 2, "tensor": {"shape": [1, 64], "dtype": "INT8", "name": "sequential/dense_2/MatMul;sequential/dense_2/BiasAdd", "tensor": null}, "LUT": {"LUT": [-127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -126, -126, -126, -126, -126, -126, -126, -126, -126, -126, -126, -125, -125, -125, -125, -125, -125, -125, -124, -124, -124, -124, -124, -123, -123, -123, -123, -122, -122, -122, -122, -121, -121, -121, -120, -120, -120, -119, -119, -118, -118, -117, -117, -116, -116, -115, -115, -114, -113, -113, -112, -111, -111, -110, -109, -108, -107, -106, -105, -104, -103, -102, -101, -100, -99, -98, -96, -95, -93, -92, -91, -89, -87, -86, -84, -82, -80, -79, -77, -75, -73, -70, -68, -66, -64, -62, -59, -57, -54, -52, -49, -47, -44, -41, -38, -36, -33, -30, -27, -24, -21, -18, -15, -12, -9, -6, -3, 0, 3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36, 38, 41, 44, 47, 49, 52, 54, 57, 59, 62, 64, 66, 68, 70, 73, 75, 77, 79, 80, 82, 84, 86, 87, 89, 91, 92, 93, 95, 96, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 111, 112, 113, 113, 114, 115, 115, 116, 116, 117, 117, 118, 118, 119, 119, 120, 120, 120, 121, 121, 121, 122, 122, 122, 122, 123, 123, 123, 123, 124, 124, 124, 124, 124, 125, 125, 125, 125, 125, 125, 125, 126, 126, 126, 126, 126, 126, 126, 126, 126, 126, 126, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127], "offset": 128, "reduced_LUT": {"reduced_lut_len": 179, "reduced_lut": [-124, -124, -124, -124, -124, -123, -123, -123, -123, -122, -122, -122, -122, -121, -121, -121, -120, -120, -120, -119, -119, -118, -118, -117, -117, -116, -116, -115, -115, -114, -113, -113, -112, -111, -111, -110, -109, -108, -107, -106, -105, -104, -103, -102, -101, -100, -99, -98, -96, -95, -93, -92, -91, -89, -87, -86, -84, -82, -80, -79, -77, -75, -73, -70, -68, -66, -64, -62, -59, -57, -54, -52, -49, -47, -44, -41, -38, -36, -33, -30, -27, -24, -21, -18, -15, -12, -9, -6, -3, 0, 3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36, 38, 41, 44, 47, 49, 52, 54, 57, 59, 62, 64, 66, 68, 70, 73, 75, 77, 79, 80, 82, 84, 86, 87, 89, 91, 92, 93, 95, 96, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 111, 112, 113, 113, 114, 115, 115, 116, 116, 117, 117, 118, 118, 119, 119, 120, 120, 120, 121, 121, 121, 122, 122, 122, 122, 123, 123, 123, 123, 124, 124, 124, 124, 124], "head": {"shift": 41, "tuples_len": 3, "tuples": [[23, -127], [34, -126], [41, -125]]}, "tail": {"shift": 36, "tuples_len": 3, "tuples": [[238, 127], [227, 126], [220, 125]]}, "depth": 3, "min_reduce": 0, "asymmetric": false, "description": "Reduced LUT of depth 3 with 0 minimum reduce"}}}], "outputs": [{"scale": 0.00390625, "zero_point": -128, "tensor": {"shape": [1, 64], "dtype": "INT8", "name": "sequential/dense_2/Sigmoid", "tensor": null}}]}, {"description": "FULLY_CONNECTED", "op_type": "FULLY_CONNECTED", "name": "FULLY_CONNECTED", "inputs": [{"scale": 0.00390625, "zero_point": -128, "tensor": {"shape": [1, 64], "dtype": "INT8", "name": "sequential/dense_2/Sigmoid", "tensor": null}}, {"scale": 0.010033829137682915, "zero_point": 0, "tensor": {"shape": [10, 64], "dtype": "INT8", "name": "sequential/dense_3/MatMul", "tensor": [[-16, -6, 31, -35, 18, -113, -61, -101, -22, -40, -77, 18, -28, 26, 32, -57, 30, 32, 46, -52, 28, 8, -79, 26, -63, -11, -54, -41, 75, 35, -55, 25, -96, 24, -33, 46, 18, -16, 17, 16, -18, 68, -29, 57, 56, -98, -41, -45, 31, -7, -85, 61, -71, 74, 93, 51, 17, 42, 52, -26, 51, 33, -87, -52], [-50, 25, -86, 104, 45, 55, -44, 52, -43, 52, 16, 30, 58, 42, -73, 47, -111, -8, 15, 99, 32, 87, 37, -118, 35, 40, -13, -24, -45, -49, 44, -76, 28, -55, -15, -113, -14, -63, 14, 26, -23, -43, 85, -127, -27, 112, 28, 2, -27, -66, 94, -83, -3, -74, -75, -3, -44, -122, -74, -38, -38, -28, 56, 94], [12, 35, -17, 39, 6, 6, -1, -60, 40, 44, 10, -19, 56, 30, 48, 49, 29, 9, -7, 34, 16, 27, -98, -7, 5, -23, -60, -102, -9, 8, 46, 27, -5, -96, 34, -25, 21, 25, 42, 19, 38, 53, 50, -62, 35, 4, 30, -38, -4, -17, 47, -20, -14, 29, 28, 33, 16, 46, 16, -23, -41, -52, 31, -39], [5, 26, -12, -10, 39, 46, 27, -67, -31, -47, -25, -7, -21, 51, -41, -8, -54, 49, -3, 29, 34, -2, -42, -36, 53, 7, 0, -30, -8, -53, -54, 24, -12, 13, 39, -5, 12, -20, -22, 47, 13, 33, -33, -4, 51, 26, 29, 27, 17, 16, 28, 31, -4, -24, 29, -58, -6, 43, 39, -44, 47, -38, -12, -35], [40, -35, 32, -28, -52, -25, 42, 51, 65, 44, 55, -70, 20, -59, 62, 37, 48, -78, -46, -25, -21, -60, 21, 38, -41, -91, -26, 15, 49, 20, 29, -50, -13, 40, -39, 11, -56, 54, 12, -46, -9, -11, 25, 8, -8, -27, -60, 8, 43, 53, -21, -32, 18, 47, -35, 60, -69, -58, -42, 52, -50, 22, -16, 41], [-34, 39, 39, -28, 38, -23, -36, 14, -72, -34, -33, 56, -43, 28, -42, -39, 21, -26, -11, -63, 48, -31, 43, 3, -30, -4, 23, 57, -23, 16, -41, 41, 42, 40, 44, 15, 53, -17, -10, -61, -47, -64, -72, 28, 41, -86, 29, -5, 12, 32, -72, -14, 42, -50, -43, -7, 42, 11, 46, 14, 5, 57, -46, -69], [28, 30, 18, -28, -9, 15, -45, 42, -71, 17, -77, 25, 51, 51, 72, 21, 88, -70, -1, -79, 61, 33, -15, 45, -113, -80, -94, -15, 10, 59, 46, -57, 8, -118, 46, 22, 60, 61, 48, -46, -96, -40, 16, -64, 8, -68, 5, -39, 1, -42, -61, -47, -48, 23, 30, 63, -58, -49, -8, -1, -3, 7, -8, 22], [-39, -54, 19, 46, -26, -54, 42, -57, 55, -45, 65, -77, 29, -85, -33, -47, -29, 10, 37, 3, -97, -4, 27, -31, 31, 9, 18, 18, 29, 33, -40, 38, -66, 23, -89, -50, -83, 12, 40, 92, 44, 60, -47, -20, -45, 27, -29, -43, 29, 49, 9, 74, 37, 73, 19, 4, 4, 19, 61, 24, 90, -5, 30, -5], [-39, -14, 46, -13, 52, 44, 8, 48, -62, 39, -74, 35, -31, 43, -53, 29, -57, 25, 21, 39, 24, -62, 31, -7, 29, 4, -6, 64, -78, -62, 6, 41, 47, -5, 18, 48, 37, 8, -76, -61, -5, -63, 28, -25, -5, 5, 7, 36, -51, -30, 24, -36, 29, -47, -108, -71, 17, 17, -48, -31, -24, -15, 15, 15], [3, -53, 20, -59, -26, 35, 27, 52, 53, -49, 53, -13, -39, -73, -28, 12, -38, 3, -55, -65, -76, -64, 37, 6, 23, -12, 65, 27, 27, 20, -39, -18, 33, 56, -19, -28, -42, -18, 8, -4, 25, -47, 34, -11, -1, 39, 46, 19, 37, 48, -10, 5, -7, -27, -67, -45, 31, 17, -9, 7, -36, 23, 23, 42]]}}, {"scale": 3.9194645069073886e-05, "zero_point": 0, "tensor": {"shape": [10], "dtype": "INT32", "name": "sequential/dense_3/BiasAdd/ReadVariableOp/resource", "tensor": [-220, 697, 714, 1176, -635, 111, -1031, 1128, -754, -323]}}], "outputs": [{"scale": 0.08783381432294846, "zero_point": 27, "tensor": {"shape": [1, 10], "dtype": "INT8", "name": "sequential/dense_3/MatMul;sequential/dense_3/BiasAdd", "tensor": null}}]}, {"description": "SOFTMAX", "op_type": "SOFTMAX", "name": "SOFTMAX", "inputs": [{"scale": 0.08783381432294846, "zero_point": 27, "tensor": {"shape": [1, 10], "dtype": "INT8", "name": "sequential/dense_3/MatMul;sequential/dense_3/BiasAdd", "tensor": null}}], "outputs": [{"scale": 0.00390625, "zero_point": -128, "tensor": {"shape": [1, 10], "dtype": "INT8", "name": "Identity", "tensor": null}}]}], "operators": 8, "input": [{"scale": 0.003921568859368563, "zero_point": -128, "tensor": {"shape": [1, 784], "dtype": "INT8", "name": "dense_input", "tensor": null}}], "output": [{"scale": 0.00390625, "zero_point": -128, "tensor": {"shape": [1, 10], "dtype": "INT8", "name": "Identity", "tensor": null}}]}