{"ir_version": 3, "engine": "TFLITE", "graph": [{"description": "QUANTIZE", "op_type": "QUANTIZE", "name": "QUANTIZE", "inputs": [{"scale": null, "zero_point": null, "tensor": {"shape": [1, 784], "dtype": "FLOAT32", "name": "dense_input", "tensor": null}}], "outputs": [{"scale": 0.003921568859368563, "zero_point": -128, "tensor": {"shape": [1, 784], "dtype": "INT8", "name": "tfl.quantize", "tensor": null}}]}, {"description": "FULLY_CONNECTED", "op_type": "FULLY_CONNECTED", "name": "FULLY_CONNECTED", "inputs": [{"scale": 0.003921568859368563, "zero_point": -128, "tensor": {"shape": [1, 784], "dtype": "INT8", "name": "tfl.quantize", "tensor": null}}, {"scale": 0.006795650348067284, "zero_point": 0, "tensor": {"shape": [5, 784], "dtype": "INT8", "name": "sequential/dense/MatMul", "tensor": [[-1, 10, 0, -7, -9, 2, -8, -9, 3, 4, 5, -3, 3, -14, -13, -5, -5, 1, -8, 5, -3, 3, 4, 5, 11, 0, -10, -11, 1, 7, 3, -8, 0, -1, -16, -43, -25, -12, -29, -36, -36, -23, 0, -19, -31, -17, -18, -21, -33, -22, -43, -33, 3, -7, -10, 6, -1, 10, -8, -16, -9, -16, -21, -44, -47, -20, -32, -21, -32, -54, -26, -19, -42, -16, -23, -20, 7, 18, -5, -36, -42, -30, -9, 0, 10, 7, 3, -47, -29, -31, -51, -32, -39, -33, -28, -9, -52, -74, -38, -51, -32, -27, -38, -17, -39, -17, -13, -6, -11, -13, 23, 2, 13, -3, -12, -44, -10, -33, -27, -14, -19, -24, -27, -9, 4, -4, -4, -13, -24, -7, -17, -21, -4, -16, -7, 5, 1, -14, -43, -7, 5, 9, -20, -31, -28, -49, -15, -7, -4, 14, 11, 22, 18, 18, 9, 10, 6, 11, 7, -9, -5, -22, -26, -35, -21, -12, -29, 3, -12, -15, 7, -38, -23, -7, -18, 11, -2, 11, 11, 9, 12, 7, 24, 19, 23, 15, 12, 7, -4, 4, 1, -5, -43, -18, -31, -7, -1, -45, 35, 1, -2, -6, 1, 17, 10, 10, 4, 15, 13, 23, 20, 30, 18, 23, 15, -4, 16, -1, 10, 5, -9, -35, -11, -18, 7, 23, 19, 2, -20, -19, -6, 13, 7, 18, 31, 15, 12, 7, 24, 10, 11, -2, -1, 4, -2, 8, 3, 30, 12, -20, -23, -26, 23, 13, 2, -2, -10, 6, 11, 1, -2, 17, 23, 25, 25, 11, -12, -4, 10, 9, 20, 19, 22, 8, 15, 33, -4, -51, -41, 3, 21, 22, 16, -4, -7, 21, 18, 12, 17, 30, 23, 16, 19, -9, -26, -21, -5, 14, 20, 33, 32, 29, 38, 13, -9, -73, -81, -10, 29, 39, 13, -2, -13, 22, 24, 32, 16, 24, 22, 23, 9, -15, -44, -16, -5, 17, 20, 23, 61, 59, 57, 26, -14, -72, -70, -11, 25, 30, 56, -8, -14, 17, 10, 27, 25, 11, -2, 1, 0, -24, -31, -11, 3, 3, 19, 39, 27, 44, 61, 48, 9, -47, -64, -32, -14, 0, 40, -14, 28, 17, 25, 28, -6, 2, -3, 14, -14, -19, -25, 8, 13, 6, 19, 13, 25, 30, 45, 21, 17, -15, -34, -12, -14, -13, 15, -8, 18, 10, 29, 23, -3, -21, -5, 7, 0, -2, -12, -7, 19, 20, 20, 20, 15, -3, 16, 22, 5, 29, -23, -5, -14, -9, -33, -6, 6, 12, 23, 31, 14, 8, 11, 12, -1, -19, -16, 2, 11, 25, 0, -15, -7, -1, -4, -10, -6, 25, 14, -32, 33, -21, -42, -33, -11, 7, 29, 40, 52, 33, 29, 28, 18, -8, -5, 15, 28, 22, 3, -2, 0, -7, 1, -2, -7, 44, 2, -18, 5, -30, -16, -43, -38, -11, -1, 36, 53, 56, 54, 54, 37, 22, 2, 17, 25, 19, 1, -22, -13, -30, -6, -16, 0, 77, 22, -34, -1, -18, -5, -51, -28, -14, -23, 16, 40, 46, 52, 43, 26, 3, 5, 9, 14, 7, 4, 1, -15, -3, -4, -8, -3, 44, 14, -38, -11, 16, -2, -38, 4, 2, 6, 20, 9, 8, 12, 2, 15, -24, -8, -5, -18, 2, -17, 2, -6, 2, 5, -1, 19, 6, -2, -2, 10, 1, 4, -25, -26, 8, 3, -14, -13, -3, -16, -13, 1, -4, -5, -11, -3, -22, -15, -9, 4, -6, -20, -2, 21, 1, -16, -3, -16, -17, -9, -36, -26, -10, -21, -8, -18, -5, -9, -17, -5, -3, -8, 0, 3, -5, -3, 5, 1, -2, 10, 10, 28, -9, -9, 10, -16, -18, -16, -21, -25, -29, 0, -7, 9, -2, 8, 7, 21, 12, 2, 6, -12, -7, -5, -7, 15, 11, 37, -1, 13, -2, -40, 7, 8, -1, -59, -39, -44, -44, -6, 8, 5, -14, 0, 8, 15, 13, 14, 9, 1, 2, 4, 2, 14, 38, 27, -8, 7, -10, -60, 6, -1, -6, -18, -23, -27, 0, -31, -22, -6, -5, -1, 6, 5, 13, -2, -3, 13, 12, -5, 13, 14, 26, 34, -4, -2, 29, 2, -11, -13, -2, -29, 16, 17, 16, -9, -3, -23, -18, -11, 3, 3, 11, 13, 15, 19, 13, 9, 15, 20, 26, -4, -24, -39, 16, -5, 12, -2, 9, 11, 6, 6, 2, 30, 30, 35, 44, 14, 17, 13, 22, 23, 20, 12, 14, 19, 0, 12, -3, 18, -38, 1, -9, -8, -9, -5, 6, -5, 11, -4, -2, -7, 6, 7, 45, 6, 20, 21, 69, 71, 52, 61, 57, 64, 42, 30, 20, 16, 23, -11, -11, 9, 0], [-5, -1, 0, 2, -6, -2, -9, -2, 5, -7, 12, -9, -12, 11, 12, 6, -4, -12, 4, 5, 0, 0, -2, 10, 12, -6, -8, -4, 8, 5, 10, 9, -20, -12, -27, -15, -24, -23, -43, -29, -42, 2, 41, 55, 55, 10, -28, -26, -23, -36, -10, -10, -4, -8, 11, -10, -8, -7, -1, -3, -16, -9, -2, -30, -37, -50, -41, -53, -43, -32, -36, -15, -15, -37, -26, -45, -52, -81, -61, 4, 29, 13, 9, 1, 9, 7, -15, -15, -21, 21, -11, -18, -27, -28, -10, -13, 8, -7, -10, -20, -6, -23, -21, -20, 1, -8, -9, -3, 11, 23, -18, -11, -7, 28, 43, 29, 13, 9, 15, 22, 19, 22, 34, 36, 34, 30, 26, 23, 16, 12, 27, 7, 10, -16, -11, -40, 19, 50, 50, -2, 6, -2, 4, 30, 19, 24, 21, 9, 18, 18, 32, 45, 41, 34, 21, 21, 12, -1, -1, -11, 0, -6, -5, -29, 5, 49, 22, -3, 13, 30, 32, 48, 4, 17, 14, -5, 25, 21, 33, 36, 24, 51, 41, 44, 50, 34, 23, -2, 16, 5, -18, -15, -2, 38, 38, -4, 1, 48, 39, 38, 25, 1, 13, 1, 14, 13, 22, 19, 35, 45, 49, 48, 44, 29, 29, 18, 26, 13, -8, 7, 8, 35, 35, 12, -5, 39, 34, 36, 11, 18, 5, 11, 14, -3, 7, 16, 43, 28, 49, 36, 21, 25, 24, 24, 23, 11, 21, 13, 24, 51, 39, 28, 12, 57, 36, 39, 31, -3, 19, 9, 2, 18, 13, 11, 21, 15, 22, 34, 17, 16, 21, 17, 13, 29, 22, 17, 25, 71, 65, 44, 14, 43, 29, 49, -1, -5, 15, 5, -6, 7, 10, -1, -5, -4, 6, 20, 11, 16, 19, 23, 27, 28, 45, 32, 31, 69, 57, 25, 33, 40, 42, 10, -8, 9, -2, 22, 11, -4, 5, -8, -19, -7, 27, 42, 4, 13, 23, 14, 34, 14, 34, 26, 44, 66, 71, 23, 16, 11, 21, 15, 20, 9, 6, 13, 1, -2, -3, -4, -12, 2, 39, 16, 18, 13, 30, 15, 29, 16, -2, -13, -19, 57, 56, 36, -12, -6, 9, 21, 23, 2, -7, 6, 4, -11, -19, -10, 12, 14, 39, 14, 16, 2, 20, 16, 27, 11, -11, -43, -63, 21, 49, 27, -19, -7, 2, -1, 4, -21, -4, -19, -11, -11, -25, -19, -10, 22, 30, 17, 5, 9, 24, -1, -4, -10, -30, -45, -46, -1, 52, -32, -3, 0, -11, 5, 13, -25, -9, -21, -22, -16, -15, 0, 5, 19, 9, 2, 11, 9, 7, 1, -22, -8, -21, -10, -23, -27, 18, 40, 25, 19, -7, 20, 2, -9, -9, -19, 0, -17, -5, -3, 11, 14, -6, -9, 4, 2, -13, -25, -36, -22, -15, -9, -3, -9, 20, 17, -10, 26, -7, 21, 9, -5, -9, -13, -3, 0, -11, -8, 20, 8, -13, -6, 1, -1, -15, -9, -24, -10, -3, 12, 8, -20, 29, 1, 20, 9, 15, 31, 7, 9, 11, -3, -1, 0, 2, 10, -14, -15, -20, 6, -7, 3, -7, 1, 5, 9, 17, -18, 2, -5, 31, 11, 9, -3, 9, 28, 12, 15, 18, 17, 15, 0, -6, -36, -14, -18, -20, -14, -10, 1, -1, 0, 6, 11, 6, 15, 2, 26, 4, 16, -6, -14, 4, 26, 12, 12, 27, 8, 11, 7, 0, -31, -32, -15, -21, -22, -16, -10, -8, 9, 2, -5, 14, 14, 1, 14, -1, -16, 11, 16, 28, 33, 9, -3, 17, 15, 7, -9, -9, -26, -23, -27, -10, -17, 4, -26, -14, -3, 9, 1, -7, -8, -14, 13, -34, -11, -2, 14, 14, 20, 21, -10, 6, 12, 4, 12, 4, 6, 7, -2, 3, 0, 7, 3, 4, -7, 4, -12, 1, 16, 2, 19, -4, 3, 7, -5, 11, 48, 37, 1, 1, 15, 0, 3, 16, 19, 21, 23, 9, 11, 1, 7, -3, 5, -20, -25, -7, 2, 23, 1, 13, 9, 9, -3, 36, 40, 82, 53, 44, 26, 31, 20, 16, 33, 24, 24, 3, 13, 9, 12, -2, 4, 15, 13, 6, 34, 34, -39, -16, 5, 8, 1, 31, -8, 23, 48, 41, 58, 80, 66, 52, 58, 68, 56, 54, 39, 60, 87, 92, 98, 86, 70, 29, 34, 33, -7, -19, -4, -4, -8, 8, -21, 2, 24, 20, 54, 85, 65, 73, 70, 69, 92, 116, 101, 111, 116, 88, 76, 78, 82, 61, 28, 10, 7, 5, 13, -5, 2, -3, 2, 19, 20, 25, 46, 50, 44, 68, 93, 64, 75, 88, 94, 74, 69, 70, 32, -17, 26, 11, 20, -10, 3, 7, 4], [-10, -4, 11, -2, -7, 8, 7, -8, -8, -8, -10, -6, -8, 4, -5, 3, -13, 3, -8, -11, -9, 11, 5, 3, 2, -11, -5, -10, -10, 5, 12, 4, 7, 8, -11, -11, -26, 17, 35, 4, 5, -1, 13, -9, -32, 1, 33, -1, -15, -17, -35, -24, -12, -8, -12, 9, -2, -8, 4, -33, -23, -3, 15, 16, 6, 1, 12, -10, -12, -13, -14, -6, -14, -13, 3, 21, 16, -2, -4, -32, -47, -21, 1, 8, 4, 0, -8, -26, 25, 4, 10, 17, 14, 6, -4, 3, -15, -8, -9, -7, -26, -8, 1, 6, 9, 13, 35, 25, -9, -15, -8, 9, 5, 23, -4, -46, 9, -9, -32, 3, -10, -26, -1, 2, -5, -10, -15, -8, 0, -2, 3, -6, -6, -2, 11, 48, 39, 22, -22, -24, -10, 12, -27, -54, -22, -26, -15, -22, -25, 0, -7, 9, 0, -3, -4, -13, 10, 8, 7, 8, 21, 5, 12, 45, 25, 22, 10, 1, 4, -27, -13, -49, -33, -13, -18, -17, -21, -13, -1, -3, -2, 4, -6, 6, -2, 9, 0, 4, 9, 16, 12, 61, 90, 62, 42, 2, -14, -23, -39, -39, -53, -7, -14, 1, 5, 10, 7, 12, 0, 4, -2, 19, 3, 13, -2, 15, 7, 17, -2, 44, 91, 93, 25, 29, 0, -32, -22, -7, -46, -20, -18, -10, -3, -2, -8, 0, 7, 4, -14, -12, 3, -8, -3, 3, 11, 5, 16, 60, 114, 127, 34, -4, -18, -37, 13, -32, -39, -25, -12, -1, 2, 6, 10, 6, 12, -13, -40, -37, -26, -7, -10, -10, 11, 17, 18, 41, 117, 126, 57, 39, -3, -37, -17, -36, 4, 2, -11, 14, 16, 23, 44, 31, 40, 17, -36, -31, -39, -24, 1, -9, -2, 11, 7, 45, 85, 114, 65, 34, -21, -30, 6, 20, 30, 28, 17, 39, 37, 36, 38, 43, 40, 54, 7, -12, -14, 6, -4, -2, -5, -5, 1, -1, 21, 67, 95, 13, -11, 19, 20, 52, 33, 41, 68, 61, 46, 32, 41, 30, 44, 46, 28, -1, -4, -1, 8, 4, 6, 6, 6, -2, -12, -17, 21, -31, 12, 16, 18, 33, 31, 66, 54, 57, 31, 15, 19, 21, 41, 43, 5, 9, -3, -4, 19, 15, 13, 9, 11, 2, -13, -25, -49, -43, 31, 15, 6, 40, 18, 26, 42, 7, 18, 12, 9, 17, 23, 33, 4, 3, 4, 8, -7, -6, 3, -3, 3, -18, 9, -9, -77, -48, 6, 21, 23, 4, -22, -17, -18, 0, 3, 13, 8, 20, 37, 11, -11, 2, 5, 2, -3, -9, -18, -14, -2, 16, -14, -47, -82, -31, -9, 18, -8, -27, -24, -37, -3, -2, 4, 4, -9, 18, 13, 1, 0, 0, 3, 9, -28, -14, -15, -15, -11, 12, -4, -77, -83, -37, 2, -9, -22, -22, -25, -7, -13, -9, -1, 2, 11, 16, 4, 2, -12, -3, 7, -4, 8, -20, -3, -15, -19, 13, -5, -82, -74, -47, -16, -28, 5, -15, -22, -11, 21, 14, 14, 14, 5, 12, -14, -23, -9, 3, -5, -1, -22, -2, -8, 2, -6, -1, -24, -69, -51, -22, 18, 12, 2, -10, -14, -4, 3, 6, 18, 6, 10, -4, -13, -13, -12, 6, 5, -8, 5, 0, 7, -7, 2, 3, -27, -84, -38, -35, 4, 18, -4, -31, -30, 0, 0, -9, 4, -4, -1, -10, 2, 3, -5, -1, 8, 14, 1, 2, 1, -3, 1, 8, -36, -57, -31, 1, 6, 4, -20, -33, -12, -9, -11, -4, -4, -4, 0, -6, 0, 3, 7, 12, -6, -2, 5, -8, 3, 5, -10, -7, -34, -44, -44, 23, 2, 10, -36, -40, -27, -25, -15, -16, -3, -6, -4, 7, 10, 15, 7, 6, 5, 7, 13, 4, 11, 4, -4, 7, -8, -15, 12, 5, -2, -3, -14, -24, -44, -17, -19, -30, 5, 4, 0, 13, 19, 5, 14, 20, 23, 31, 6, 18, 25, 26, -7, 13, 13, -10, 8, 0, -1, -7, 18, -1, -26, -31, -30, 3, 4, 3, 14, 11, 21, 17, 4, 5, 27, 17, 45, 45, 26, 25, 17, 19, -17, -35, -28, -3, -4, 8, -15, 36, 2, 10, 14, 26, -3, 3, 11, -11, -8, 11, 0, 3, 12, 25, 33, 44, 23, 26, 43, 36, 26, -23, -28, 10, 6, 7, 3, 32, 16, 29, 23, 0, -16, 5, -3, 13, 12, 24, 1, 5, 16, 15, 8, 20, 19, 10, 6, -9, -22, -9, -5, -5, 5, 9, -7, -3, -7, -12, -5, -7, -32, -13, -42, -32, -27, -27, -34, -42, -44, -17, -4, -27, 21, 2, 24, -11, 5, 6, -10, -11], [11, 12, 0, -1, -12, 6, 1, 3, 4, 1, -12, -7, -1, -2, 7, 1, -7, -4, 1, -1, 8, -11, -8, -3, -10, -3, 3, -5, -6, -10, -9, 4, -8, 4, 35, 29, 20, 35, 23, -8, 4, 14, 21, 0, -31, 8, 36, 45, 43, 19, 34, 19, 13, 5, -5, 1, -2, 6, 13, -25, -14, 28, 32, 40, 60, 85, 84, 97, 86, 91, 72, 75, 69, 56, 68, 63, 61, 54, 36, 40, 28, 36, -6, -11, 1, -6, 0, -14, 23, -1, 45, 33, 20, 54, 26, 29, 17, 24, 8, 22, 4, -4, 30, 43, 37, 31, 47, 24, 26, -20, -1, -1, -3, -11, -23, -7, -12, 4, 16, 2, 11, 6, 33, 10, 19, 29, 27, 17, 16, -1, -12, 8, 6, -24, -15, 4, -25, -43, 14, 30, 0, 4, 28, -10, 18, 1, -5, 3, 6, 11, 1, -2, 30, 5, 28, 33, 13, 21, 1, 6, 7, -3, -10, -13, 6, -3, 10, 23, 1, -11, -48, -20, 4, -24, -21, 4, -4, -2, 5, 3, -5, 6, 0, 14, 10, -2, -7, -6, -8, -14, -17, 18, 20, 23, 21, 19, 5, -23, -4, -25, 16, -6, -25, -5, -3, -11, -5, -7, -4, 3, -2, 4, 11, -14, -7, -19, -9, -5, 3, -10, 5, 18, 31, -3, 8, -23, -25, -40, 13, -1, 4, -10, -8, 0, 8, 3, 2, 17, 7, 4, -20, -6, -17, -1, -6, 5, -7, -16, 0, 35, 60, 26, 2, -40, -18, -47, -21, -14, 1, 0, -2, 1, -4, 4, -6, -10, -30, -11, -28, -20, -6, -11, -2, -2, 17, 2, -29, 4, 25, -32, -4, -11, -50, -56, -12, -18, 0, 3, -14, -6, 1, -15, -5, -23, -31, -35, -25, -15, -9, 2, -7, -3, 4, 0, -12, -14, -16, -17, -16, -16, -62, -31, -17, 12, -11, 2, -1, -17, -2, -23, -7, -2, 4, 7, -10, -14, 5, 8, 19, 16, 18, 16, 24, 0, -34, -3, -20, -18, -68, -4, -10, -3, -14, -6, -5, 11, -12, -5, 0, 16, 48, 17, 11, 6, 8, 23, 16, 40, 18, 29, 51, 11, -38, 15, -1, -8, -30, -1, 8, -16, 8, 15, 0, 3, -13, -7, 19, 39, 62, 55, 22, 9, 29, 23, 30, 29, 15, 28, 7, 6, 12, 41, -14, -5, -39, 22, 1, -1, 17, -6, 7, -1, -14, 16, 32, 52, 59, 24, 17, 2, 7, 14, -7, -13, 0, -23, -10, 10, 40, 54, -29, -12, 2, 32, -7, 0, 21, 9, 13, -10, -9, 22, 38, 75, 64, 12, 23, 4, -3, -23, -27, -14, -29, -20, -1, 37, 30, 44, 7, -13, 23, 25, -14, 4, 20, 2, 8, 18, 30, 39, 52, 72, 45, 13, 22, 12, -22, -25, -42, -20, -5, -8, 10, 74, 31, 7, 11, -30, 40, 6, -28, -16, 11, 13, 31, 40, 50, 64, 70, 46, 38, 10, 2, -19, -25, -17, -3, -21, -23, -1, 20, 26, 5, 0, 12, -13, 5, 24, -18, -16, -10, 10, 28, 35, 55, 53, 57, 33, 8, -10, 5, -13, 0, -8, -13, -23, 1, 21, 32, 40, 6, 27, 9, -23, -27, -27, -25, -7, -19, 12, 16, 39, 35, 16, 16, 2, 6, 26, 5, 7, -2, -11, 8, 13, 14, 35, 29, 25, 50, 29, -4, -19, -35, -19, -15, -20, -1, 30, 22, 12, 24, 7, 2, -8, 5, 13, 15, 9, 24, 21, 18, 26, 26, 19, 21, -15, 32, -2, 18, -8, -1, -5, -16, -6, 24, 13, 4, 15, 6, -3, 4, 12, 13, 7, 5, 21, 13, 20, 11, 15, 16, 28, 5, -10, -22, 8, 26, 24, -11, 11, 19, 19, 13, 23, 0, 3, 4, 1, 0, 16, -2, 6, 0, 11, 22, 31, 34, 22, 1, 11, 8, 1, 5, 3, -1, 11, 13, -18, -7, 8, 5, -11, -1, -8, -12, 6, 21, 21, -3, 17, 22, 8, 33, 30, 34, 41, 37, 12, -12, 3, 36, -12, -1, -6, -4, -59, -63, -65, -34, -26, -8, -6, 8, 12, 14, 11, 8, 4, 29, 2, 17, 30, 33, 32, 8, 19, 9, 43, 30, 12, -4, -12, 24, -39, -71, -74, -49, -41, -40, -21, -16, -36, -23, -11, -8, -4, -17, 4, -11, -21, 14, 2, -12, 13, -46, 7, 14, -11, -2, -3, 1, -27, -7, -44, -35, -28, -35, -20, -3, -11, 0, -7, 12, -7, -21, 2, 5, -36, 3, 11, -32, 45, -35, -17, 1, -3, 2, -7, 6, -6, 1, -17, 9, 3, -6, -49, -36, -8, -23, -45, -13, -4, -9, -18, -29, -27, 25, -1, -23, -17, -1, 7, -9, -11], [0, 4, -12, -6, -9, 5, -8, -1, 11, 3, 2, -12, 5, 16, 6, 5, 6, 3, -9, 2, 6, 6, 3, -2, 1, -4, 2, 5, -3, 6, 3, -5, 1, 10, 32, 29, 29, 39, 27, 27, 37, 27, -18, 2, 45, 33, 23, 39, 20, 31, 18, 19, -4, -11, 12, -2, -11, -8, -5, 30, 26, 23, -5, 23, 43, 50, 55, 57, 48, 25, 29, -10, 27, 41, 32, 15, -4, 3, 22, 44, 44, 17, -11, 6, -5, 12, -2, 33, 14, 13, 31, 35, 63, 81, 71, 80, 107, 118, 86, 65, 60, 54, 34, 30, 36, 9, -15, 22, 58, 22, 16, 6, -13, -6, -12, 42, -27, -15, 13, 26, 22, 46, 62, 59, 36, 34, 30, 40, 21, 33, 28, -1, -7, -3, -6, -17, -5, 34, 32, 25, -7, 7, 20, 10, -11, -32, -13, 14, 23, 16, 31, 36, 11, 23, 19, 19, 35, 32, 23, 11, 20, 5, -11, -23, -5, 43, 39, 23, -12, 8, 24, 21, -9, -8, -11, -3, -1, -3, 9, 13, 27, 12, 26, 18, 21, 10, 18, 7, 3, -7, -13, -5, 11, 26, 11, 7, 8, 35, 7, -20, 10, 4, 14, 5, 13, 3, 8, 8, 10, 24, 29, 27, 19, 10, 8, -3, 1, 6, 13, 5, 15, 30, -7, 30, 5, 5, 1, -3, -21, 1, -2, -5, -7, -7, 12, 8, 11, 9, 21, 31, 17, 4, -8, 12, 6, 5, 12, 27, 32, 11, 21, 36, -12, -19, 13, -1, 0, -1, -2, -2, -4, 1, 5, 2, 2, 7, 0, -8, 2, 0, -7, 12, 15, 13, 9, 49, 50, 46, 13, -22, -17, -26, 17, 22, -4, 7, 1, 7, 5, 6, 4, 7, -7, -12, -1, -35, -8, -2, 10, 1, 25, 30, 16, 63, 76, 23, 53, -12, -6, -21, 9, -3, -14, 1, 4, -11, -9, -7, -19, -21, -15, -7, -37, -52, -43, -24, -8, -1, 16, 17, 18, 50, 72, 49, 30, 16, -21, 3, -36, -21, -26, -16, -7, -11, -11, -14, -5, -3, 4, 12, -16, -39, -29, -20, -19, -4, 7, 18, 5, 33, 67, 51, -7, 16, 2, -2, -18, -12, -58, -19, -13, -7, -15, -16, -1, 11, 17, 13, -12, -24, -22, -24, 0, -9, -10, -11, -2, 41, 73, 25, 26, 27, 9, -19, -21, -48, -48, -15, -2, -10, -20, -4, 5, 1, 15, -4, -12, -28, -30, -21, -11, -28, -18, -9, -1, 25, 52, -11, 56, 25, 1, -28, 0, -21, -24, 17, -9, 12, 4, 4, 8, -2, 3, 9, -29, -11, -20, -34, -17, -22, 1, -11, -11, 14, 37, 18, 19, 26, -17, -8, 12, 22, 5, 36, 11, 6, 8, 22, 9, 16, 11, -9, -23, -18, -19, -18, -9, 1, -5, 2, 2, 11, 54, 58, 45, 40, 3, 19, 30, 31, 21, 28, 29, -1, 14, 18, 26, 12, 2, -16, -34, -10, 0, 17, -4, 25, -3, -2, 15, 11, 37, 70, 32, 50, 10, 10, 19, 27, 19, 24, 26, 36, 18, 16, 33, 22, 4, -17, -17, 1, 23, 29, 22, 27, 16, 26, 46, 33, 37, 66, -10, -29, 2, 12, -1, 17, 34, 28, 30, 34, 39, 48, 42, 30, 32, 5, 3, 11, 18, 34, 31, 29, 31, 35, 52, 49, 48, 70, 17, -29, -12, 19, 3, 43, 58, 51, 36, 29, 38, 51, 36, 28, 34, 12, 13, 26, 16, 16, 37, 12, 46, 33, 57, 40, 23, 37, 13, 4, -10, 34, 59, 77, 52, 7, 26, 40, 20, 10, 14, 23, 29, 33, 16, 24, 11, 18, 20, 31, 24, 35, 51, 41, 24, 25, 51, 9, -7, 2, 66, 56, 28, 10, -11, 15, 11, 25, 4, 27, 28, 48, 16, 24, 20, 4, 14, 21, 20, 33, 48, 32, -3, 0, -14, -5, -2, 10, 60, 61, 31, -1, -2, 8, 0, 26, 17, 30, 24, 20, 27, 23, 15, 19, 11, 1, 14, 22, 25, 26, -18, -17, -14, 6, -1, 4, 14, 45, 20, -5, 12, -6, 16, 23, 16, 34, 41, 45, 46, 34, 40, 27, 30, 20, 7, 3, 28, 7, 23, 21, 17, -2, 10, 6, 32, -4, -3, -12, 6, 6, 5, 3, 19, 2, 19, 23, 0, 30, 28, 32, 25, 42, -3, 19, 11, 18, 25, 6, 10, -2, -10, -4, -1, -6, 5, -15, -13, 8, -1, -12, 16, 14, 26, 17, -6, 22, 29, 21, 23, 56, 28, 27, 4, 50, 1, 5, -3, -6, 11, 6, -10, 9, 16, -2, 3, 18, 9, -17, -21, 7, -6, -28, -9, 22, 6, 0, -6, -7, -11, -15, -10, -12, -2, 5, -3, -12]]}}, {"scale": 2.6649609935702756e-05, "zero_point": 0, "tensor": {"shape": [5], "dtype": "INT32", "name": "sequential/dense/BiasAdd/ReadVariableOp/resource", "tensor": [7950, -1865, 14392, 3823, 1379]}}], "outputs": [{"scale": 0.1112070232629776, "zero_point": -128, "tensor": {"shape": [1, 5], "dtype": "INT8", "name": "sequential/dense/MatMul;sequential/dense/BiasAdd;sequential/dense/Relu", "tensor": null}}]}, {"description": "FULLY_CONNECTED", "op_type": "FULLY_CONNECTED", "name": "FULLY_CONNECTED", "inputs": [{"scale": 0.1112070232629776, "zero_point": -128, "tensor": {"shape": [1, 5], "dtype": "INT8", "name": "sequential/dense/MatMul;sequential/dense/BiasAdd;sequential/dense/Relu", "tensor": null}}, {"scale": 0.008152888156473637, "zero_point": 0, "tensor": {"shape": [32, 5], "dtype": "INT8", "name": "sequential/dense_1/MatMul", "tensor": [[-38, -13, 2, -19, -17], [-42, 9, 64, -24, -7], [-6, 3, -25, -13, 66], [-12, 61, -127, 27, 32], [66, -6, -34, 33, 0], [60, 31, -59, -27, 32], [55, 5, -35, 17, -65], [-45, 86, 0, 12, 19], [-24, 19, 6, 62, 41], [-48, 28, 15, 30, 18], [63, 8, -28, 38, -31], [37, 74, 72, -39, -28], [-38, 13, -61, -40, -4], [56, 36, 49, -17, -80], [-56, 48, 47, 29, -98], [17, 28, -9, -67, 51], [-89, 61, -51, 46, 19], [-19, -33, -15, -46, -1], [-49, -1, -43, 81, -25], [39, 38, -68, -12, 28], [54, -41, 62, 19, 47], [-16, 84, 72, 11, 17], [41, -27, 29, 25, -88], [-27, 56, 3, 39, -44], [68, -19, 5, 36, 51], [11, 18, -14, 10, 56], [-20, -45, -9, 91, 8], [11, -62, 49, 64, 3], [-11, 36, 13, 12, -77], [-6, 58, -47, -7, 30], [-41, -35, 15, -37, -47], [20, -47, 67, -49, 23]]}}, {"scale": 0.0009066584170795977, "zero_point": 0, "tensor": {"shape": [32], "dtype": "INT32", "name": "sequential/dense_1/BiasAdd/ReadVariableOp/resource", "tensor": [3, 616, 528, 32, 45, 92, 83, 136, -62, -76, -49, 219, -114, 377, 410, 377, 430, -13, 76, 116, -37, 3, 382, -445, -460, -131, 394, 401, 347, -403, 11, 279]}}], "outputs": [{"scale": 0.09006362408399582, "zero_point": -128, "tensor": {"shape": [1, 32], "dtype": "INT8", "name": "sequential/dense_1/MatMul;sequential/dense_1/BiasAdd;sequential/dense_1/Relu", "tensor": null}}]}, {"description": "FULLY_CONNECTED", "op_type": "FULLY_CONNECTED", "name": "FULLY_CONNECTED", "inputs": [{"scale": 0.09006362408399582, "zero_point": -128, "tensor": {"shape": [1, 32], "dtype": "INT8", "name": "sequential/dense_1/MatMul;sequential/dense_1/BiasAdd;sequential/dense_1/Relu", "tensor": null}}, {"scale": 0.007787976413965225, "zero_point": 0, "tensor": {"shape": [10, 32], "dtype": "INT8", "name": "sequential/dense_2/MatMul", "tensor": [[-8, -61, 33, -46, -35, 43, 34, 20, -52, -30, -43, -36, -9, -53, -33, 53, -89, 43, -41, 9, 48, -11, -3, 16, 60, 13, -3, 9, -32, 47, -26, 66], [-13, -13, -38, 7, 6, -38, -10, 45, 18, 1, -13, -70, -39, -50, 28, 61, 70, 16, 66, 38, -10, 12, -22, -12, -38, -40, 52, 32, 45, -8, 31, 37], [-27, 3, -5, 60, -3, 21, -41, -8, 16, 24, 17, -62, -12, 20, -104, -6, -24, -31, 36, 37, -12, -37, 54, -48, 45, 34, 62, 7, -88, 37, -47, -50], [-14, 6, 49, 52, -69, -7, 13, 49, -5, 29, -21, -33, -25, 8, -107, -29, 49, -22, -111, 16, -38, 57, 16, 37, 12, 19, -25, 15, -47, -29, -47, -15], [29, 4, 53, -9, 56, -42, 17, -65, -39, -52, 0, -48, -37, 33, 79, -46, 2, 21, -25, -23, 32, 3, 56, -2, 43, -6, -55, 63, 74, -64, 43, 1], [40, 110, 59, -5, -46, -18, -16, 34, 24, 13, -63, 19, -32, -5, -76, -21, -38, -40, -19, -36, 32, 27, 17, -103, -3, -24, 46, 13, -115, 38, 19, -3], [-7, 36, 29, -92, 42, -28, 44, -88, 50, 31, -7, -104, -6, -116, -89, 42, -35, 27, 13, -59, 18, -30, -63, -1, 59, -32, 60, 84, -13, -47, 1, 9], [-38, -1, -14, 113, 7, 37, 50, -44, -90, -77, 37, 35, 14, 83, 3, 39, 8, -31, 28, 54, -31, -2, -8, -16, 13, -75, 57, -83, 39, 30, 22, 103], [0, -78, -43, -33, 9, -49, -97, 19, 47, 32, 11, -6, 24, -5, -95, -106, -29, -43, -7, -34, 21, 39, -72, 69, 44, 5, -30, 9, -122, 56, -27, -42], [25, 4, -56, -114, 50, 55, -3, -8, 24, -43, 17, 14, 30, -6, 41, -36, 15, -14, -54, 43, -27, 37, 42, 33, 49, 1, -127, -37, 29, -97, 45, -71]]}}, {"scale": 0.0007014133734628558, "zero_point": 0, "tensor": {"shape": [10], "dtype": "INT32", "name": "sequential/dense_2/BiasAdd/ReadVariableOp/resource", "tensor": [-516, 255, -75, 176, 203, 526, -91, 78, -686, -226]}}], "outputs": [{"scale": 0.23404625058174133, "zero_point": 16, "tensor": {"shape": [1, 10], "dtype": "INT8", "name": "sequential/dense_2/MatMul;sequential/dense_2/BiasAdd", "tensor": null}}]}, {"description": "SOFTMAX", "op_type": "SOFTMAX", "name": "SOFTMAX", "inputs": [{"scale": 0.23404625058174133, "zero_point": 16, "tensor": {"shape": [1, 10], "dtype": "INT8", "name": "sequential/dense_2/MatMul;sequential/dense_2/BiasAdd", "tensor": null}}], "outputs": [{"scale": 0.00390625, "zero_point": -128, "tensor": {"shape": [1, 10], "dtype": "INT8", "name": "Identity1", "tensor": null}}]}, {"description": "DEQUANTIZE", "op_type": "DEQUANTIZE", "name": "DEQUANTIZE", "inputs": [{"scale": 0.00390625, "zero_point": -128, "tensor": {"shape": [1, 10], "dtype": "INT8", "name": "Identity1", "tensor": null}}], "outputs": [{"scale": null, "zero_point": null, "tensor": {"shape": [1, 10], "dtype": "FLOAT32", "name": "Identity", "tensor": null}}]}], "operators": 6, "input": [{"scale": null, "zero_point": null, "tensor": {"shape": [1, 784], "dtype": "FLOAT32", "name": "dense_input", "tensor": null}}], "output": [{"scale": null, "zero_point": null, "tensor": {"shape": [1, 10], "dtype": "FLOAT32", "name": "Identity", "tensor": null}}]}