{"ir_version": 3, "engine": "TFLITE", "graph": [{"description": "QUANTIZE", "op_type": "QUANTIZE", "name": "QUANTIZE", "inputs": [{"scale": null, "zero_point": null, "tensor": {"shape": [1, 784], "dtype": "FLOAT32", "name": "dense_input", "tensor": null}}], "outputs": [{"scale": 0.003921568859368563, "zero_point": -128, "tensor": {"shape": [1, 784], "dtype": "INT8", "name": "tfl.quantize", "tensor": null}}]}, {"description": "FULLY_CONNECTED", "op_type": "FULLY_CONNECTED", "name": "FULLY_CONNECTED", "inputs": [{"scale": 0.003921568859368563, "zero_point": -128, "tensor": {"shape": [1, 784], "dtype": "INT8", "name": "tfl.quantize", "tensor": null}}, {"scale": 0.006489303428679705, "zero_point": 0, "tensor": {"shape": [5, 784], "dtype": "INT8", "name": "sequential/dense/MatMul", "tensor": [[-6, 8, 10, 4, -8, 7, -3, 5, -3, 8, -11, 1, 0, -12, 6, -9, -8, 0, -3, -8, -13, 12, -8, -10, -8, -11, 0, 6, -8, -5, 6, 5, -19, -34, -45, -35, -21, -1, -25, -20, -23, 21, -27, -18, 3, 24, -24, -14, 9, 10, 24, 5, -10, -3, 10, -8, 11, 3, -8, 20, -25, 10, 17, -29, 0, 42, 21, -4, 9, -25, 14, -24, 11, -2, -12, -18, 0, 9, -15, 12, 39, 45, 7, 2, -9, 9, 11, 6, -6, -21, -3, 0, 0, 24, -3, 6, -1, 4, -9, -9, 1, 12, -20, 10, -15, -6, -20, -5, 10, -16, -3, 12, -8, -8, 5, 7, -1, -21, 13, -6, 19, -4, -3, 10, -4, 5, -9, -2, -11, 0, -14, -7, 2, 3, 3, 8, -10, -11, -28, 27, -10, 10, -27, -23, -7, -5, 6, -7, 18, 5, 1, 0, 5, 2, 0, -1, -7, 5, 6, -7, -11, -8, -6, -15, 13, -24, -28, 18, 1, -32, 8, -5, 16, 8, 14, 0, -1, 16, 0, 3, 0, -10, 5, 2, 2, -4, 8, -4, -1, 11, -3, -12, -45, -61, -55, -20, 7, 13, 39, 17, 7, -2, 21, 2, 3, -5, 7, 5, 1, 2, -12, -3, 6, 7, 0, 4, -3, 5, -4, -18, -42, -79, -51, -49, -1, 17, 20, 17, 0, -5, -8, 10, 4, 2, -1, 4, -1, 0, 3, 13, -7, -1, -6, -2, -11, -4, -13, 5, -44, -77, -64, -27, -4, 29, 5, 9, 18, 16, -2, -13, -4, 3, 9, -3, 12, 6, 6, 3, 15, 6, 12, 5, 8, -13, -10, -10, -36, -76, -74, -6, 13, 13, 12, 23, -5, 18, 7, 14, -2, 5, -5, 8, 5, 6, -1, -3, 13, 10, 7, 8, 11, 5, -7, -7, -42, -81, -72, -22, 5, 53, 35, 18, 6, 11, 12, -10, -5, -3, 12, -7, -7, -10, -29, -5, -1, 2, 2, 8, 10, 11, 9, 15, -21, -51, -31, -20, -7, 44, 58, 23, 18, -5, -8, 8, 0, -12, -13, 2, -8, -23, -36, -19, 7, 5, -5, 2, -5, 12, 48, 47, 84, 42, 17, 0, -15, 26, 49, 14, 12, -8, 5, -5, -3, -5, 5, 5, -16, -29, -14, -17, -1, 2, -8, -2, 0, 9, 27, 28, 78, 48, 26, 8, -14, 22, 26, -2, 20, -14, 6, 21, -4, -5, -3, 5, -10, -17, -27, -7, -1, -3, 10, 10, 11, 12, 0, 12, 25, 49, 22, 24, 14, -19, -26, 15, 36, 38, 27, 22, 23, -6, 0, -4, -22, -32, -17, -4, 1, 8, 3, 6, 7, 13, -2, -16, -21, 51, 47, 20, 38, -29, -24, -13, 24, 10, 20, 29, 19, 23, 2, -1, -8, -19, -2, 4, 13, 3, -2, 6, 11, 1, 10, -6, -2, 83, 53, 21, 11, -15, -14, -12, -8, 8, -3, 11, 15, 31, 20, 20, -2, -10, -2, 11, 4, 14, 8, 5, -7, -10, -5, -8, 3, 74, 27, 28, 2, -1, 5, -37, 5, -3, -14, -1, 3, 12, 18, 16, 23, -2, -1, 3, 1, 1, 2, 1, 10, 2, 1, -7, 15, 49, 2, 10, -25, 33, 23, -16, 20, 3, 13, -2, -4, -15, -9, 11, 9, -1, 3, 6, -6, -4, -4, -6, -10, -4, 0, -13, 13, 19, -18, -9, -9, 38, 25, 7, 6, 7, -6, 3, -4, -4, 4, -2, 11, 4, 2, 1, -1, 0, -5, -4, 1, 4, -22, -17, 37, 10, -13, -1, -25, -2, -11, 1, -10, -10, -4, -10, -5, 0, -5, 4, 2, 4, -6, -12, 3, -10, -12, 6, -8, -8, 1, 10, 39, 19, 23, -5, -32, -47, -3, -3, -9, 6, 1, 4, 6, -6, 5, -2, 6, 0, -6, 4, -10, -10, -3, -11, -16, 4, -9, -7, 46, 19, -37, 9, -10, 13, -39, -32, -22, -5, 3, 5, -1, 3, -6, 5, 4, -3, 3, -4, -8, -7, -13, -1, 1, 11, 32, -14, -1, 18, -48, 6, 8, -2, 6, -34, -8, 8, 5, -18, -6, -3, -7, -14, -7, -2, 0, 3, -11, -4, -3, -3, 7, -1, -1, -5, 4, -4, 29, -1, 7, 10, -21, 9, 22, 24, 16, 6, -7, -6, -19, -3, -5, -1, -6, 3, -2, -2, -3, -9, -11, -7, -29, -52, -23, -11, 34, -4, -13, 4, 9, -17, 8, 50, 50, 27, 43, 17, 27, 18, 5, 13, 19, 17, 16, 32, 16, -2, 1, -10, -4, -29, 24, 4, -9, -10, 5, -10, 9, 12, -4, 2, 22, 25, 35, 46, 46, 18, 11, 27, 14, 10, 36, 35, 15, 48, 34, 22, 26, 6, 3, 10, -13, 7], [7, -1, -13, 5, -9, -3, 7, -6, -9, -7, 11, 5, -12, -20, -10, -21, -2, -8, 11, 5, 9, -11, -1, 10, -2, -9, 8, 9, 4, 7, -10, -9, 1, -19, -27, -11, -35, -42, -20, 25, 5, 6, -29, -42, -43, -28, -42, -21, -39, -20, -31, -10, 13, 4, -9, -1, 2, -7, -23, 9, -6, -25, -30, -24, -66, -77, -48, -42, -23, -45, -39, -18, -16, -8, -31, -13, -20, -27, -22, -36, -53, -22, -1, 6, 9, -4, -1, -24, -10, 13, -27, 2, 4, -8, -8, 4, 9, -8, 13, 7, 3, 9, -1, -1, 3, -1, 5, -21, -2, 18, 8, -4, -10, 20, 16, -13, 7, 8, 10, 11, 9, 3, -6, 9, 3, 0, 2, 4, -7, 0, 6, 2, -7, 11, 4, 28, 37, 40, 1, -19, 0, 9, -32, 38, 12, 11, 8, 6, 6, 9, 10, 8, -3, 2, -8, -5, -2, -6, -1, -3, 7, 1, 10, 10, 7, 26, -14, -15, -12, 21, -3, 20, 12, 17, 21, -3, 2, 12, 7, 6, 2, 5, 9, -4, 6, 12, 6, 5, 7, 0, 9, 6, 21, 12, 35, -6, 1, 12, -14, 29, 22, 8, 9, 6, 2, 7, -2, 7, 7, 5, 11, 2, 8, 4, 13, 1, 11, -4, 3, 7, 18, 22, 6, 14, -8, -11, 9, 23, 15, 6, 3, -14, 5, 4, 3, 3, -1, -6, 5, 7, 6, -2, 8, -3, 6, 9, 2, 5, 37, 17, 3, -6, 9, 5, 13, 4, 12, -4, -1, -1, 4, -6, 8, 0, 4, 7, -6, 14, 9, 9, 2, 10, 8, -7, 7, -8, 35, 20, -7, 28, -6, 1, 16, 20, -2, 1, -1, -6, -10, -4, 2, 1, -2, -2, -1, 5, 14, 2, 14, -5, 15, 6, -6, 9, 34, 57, 34, 4, 9, -13, 41, 52, -1, -14, -9, -9, 1, 0, -4, 11, 8, 4, -5, 1, 7, 8, 0, -2, -5, -3, 0, -28, -22, 16, 41, 9, 8, 1, 24, 4, 8, -3, -5, 9, 5, 15, 13, 8, 15, -1, -13, -6, -2, 11, -1, -1, -3, -29, -20, -25, -37, -30, 3, -28, 2, 35, -12, 10, 3, 13, 15, 17, 11, -2, 9, 5, 4, 5, -8, -11, -1, 0, -1, 2, 0, 3, -7, -36, -29, -3, -30, -23, -34, 15, -1, 9, 51, 35, 20, 12, 24, 18, 6, -14, -2, -6, -10, -2, 1, 6, 9, 0, 2, -1, -9, -5, -14, 5, -23, -43, 5, 26, -13, 16, 43, 22, -4, 8, 1, -7, -1, 2, -1, -18, -22, -6, -3, 0, 3, 0, 8, -1, 12, 17, -10, -31, 27, -32, 17, 18, -22, 4, 32, 13, 1, -6, -17, -11, -5, -11, -8, -3, -20, -10, 4, 4, 7, 12, 12, 9, 7, 6, -1, -27, -1, -8, 12, 10, -15, 7, 15, 12, 5, -2, -18, -17, -28, -24, -13, -18, -18, 3, -3, 13, 8, 2, 3, 8, 4, 4, -16, -33, 1, -30, 3, 5, 28, 15, 7, 3, 7, -9, -13, -14, -17, -19, -22, -19, -8, 4, 13, 6, 8, 5, 1, 5, -3, -19, -25, -35, 22, -43, -9, 7, -3, 23, 9, 4, 14, 6, 0, -13, -14, -13, -10, -11, 4, -5, -6, -6, 3, -1, 5, 2, 3, -10, 8, -25, -38, -12, 13, 13, 10, 14, 8, 5, -7, -20, -2, -8, 0, -10, -1, -2, -6, -1, 2, 8, -9, 6, -12, -10, -13, -8, -33, 14, -27, 13, -2, -4, 30, 11, 5, -2, 2, -1, 3, -4, -10, 3, -12, -3, -9, -11, -1, -17, -2, -11, -3, -12, 0, -23, -16, -18, -42, 4, -23, 7, 10, -6, -9, -16, -6, -10, -1, -13, -2, -3, 3, -6, 0, 2, -3, -3, -14, -1, -7, -8, -14, 3, 17, 18, 4, 12, 12, -8, -4, 38, -3, -11, 1, 7, 1, 0, 6, 2, -3, -6, -1, 0, 0, -8, -1, -17, -8, -21, -11, 7, 35, 21, -19, -11, 13, 8, 25, 66, 43, 28, 23, 11, 9, 1, 2, 11, -8, 13, -4, -7, -6, 8, -16, -12, 8, -3, -2, 37, -20, -27, -22, 11, -7, -7, 10, 41, 16, 39, 41, 36, 31, 27, 11, 20, 14, 17, 6, 8, 11, 16, 25, 47, 34, 42, 31, 53, 18, 1, -9, -11, 13, -10, -8, 7, 27, 39, 17, 32, 19, 37, 14, 0, 23, 22, 38, 26, 41, 20, 37, 45, 55, 68, 28, -25, 2, -4, 12, -10, 10, 9, -11, 5, 5, 0, 6, -12, -33, -20, -23, -1, 21, 0, 0, 9, -36, 7, 9, -23, 13, 35, 14, -1, -5, -2, 3, -7], [2, 7, -4, -6, 4, 11, 10, -1, 3, -9, 9, 1, -11, -6, 8, 13, 10, -4, 8, -1, 9, 4, -10, -12, 5, -9, -6, 2, 10, 3, 1, 7, 0, -16, -22, -12, -24, -33, -56, -24, -13, -4, 36, 35, 1, -30, -55, -26, -42, -21, -33, -17, -13, -9, 0, 5, 0, 12, -24, -23, -45, -7, -32, -41, -44, -78, -46, -46, -50, -45, -53, -23, -55, -40, -21, -46, -22, -36, -30, -38, -30, -39, 6, 3, -10, 4, -9, -41, -47, 0, -45, -86, -52, -85, -71, -60, -98, -101, -86, -52, -52, -34, -14, -20, -27, -9, -3, -22, -39, -17, -19, 10, 4, 13, 25, -30, 1, 6, -18, -27, -23, -23, 0, 1, -6, -1, 4, -8, 1, -3, -6, -2, 0, -1, 5, 5, 12, -10, -9, -32, 6, -6, -32, -14, -28, 4, -9, 12, -8, 7, -13, -1, 3, 1, 1, -3, -8, -8, -8, 1, -7, -3, 3, -9, -2, -3, -11, -3, -3, -16, -12, -14, 0, 18, 6, -11, 7, -8, 4, -2, -4, 0, -5, 9, -3, 3, 3, 2, -3, -4, 12, 8, -4, 13, -6, -11, 3, -30, 14, 5, -17, -19, 2, -6, 4, -1, -3, 6, -1, 5, -8, 0, 7, 1, -1, -5, 6, 5, -14, 9, 8, 0, -2, -31, -9, -22, 30, 2, 5, 5, -3, 6, 3, 14, -3, -6, 1, 4, 6, -5, -3, -3, 8, 2, -3, 2, -2, -2, 1, 13, -2, -2, -4, 7, 4, 16, -13, 6, 18, 1, 0, -4, 10, 2, 3, -3, -3, 2, -2, 3, 0, 3, 0, 1, 3, 2, -8, -2, 3, 26, 5, 31, -21, -11, -6, -11, 2, 8, 5, 7, 13, 7, 9, 1, -11, 0, -1, 5, 0, 10, 0, 4, 13, -9, -14, -30, -32, 8, 35, 15, -19, -24, 2, 14, -1, 20, 19, 20, 4, 7, 3, -5, 10, 22, -1, 7, 13, -2, 7, 9, 8, 8, -9, -9, -18, -9, 22, 7, 11, -21, 8, 20, 24, 6, -2, 7, 4, 1, 3, 2, 11, 17, 13, 9, 12, 17, 10, 18, 12, 11, -15, 2, -5, -1, -25, 2, -6, -7, 21, 13, 15, 21, 3, 3, -7, -1, 3, 5, 12, 18, 10, 5, 10, 11, 9, 12, 28, -12, -26, 2, 6, -15, -4, 20, -6, 5, 7, -15, -4, -10, -4, -7, 0, 5, 0, 5, 6, 16, 7, 15, 4, 10, 14, -8, -7, -7, -29, 17, -36, -3, 30, 33, -20, 1, 7, -18, -1, -5, 7, -2, 2, 6, -3, 3, 17, 18, 11, 14, 10, 1, -7, 4, 2, -10, -25, -22, -23, -13, 32, 19, -16, -24, -24, -17, 0, 2, 4, 2, 3, -6, 9, 0, 8, 8, 5, 5, 3, -7, -5, -11, -8, -16, -22, -48, -30, -34, -8, 7, -16, -28, -11, -21, -15, 9, 8, 10, 0, 6, 8, 17, 17, 5, 4, 3, -12, -11, -6, -9, -7, 5, 8, -23, 11, -33, 15, -2, -7, -37, -31, -13, -9, -10, 1, 8, 8, 11, -1, 8, 0, -1, -10, -12, -5, -8, -6, -5, -8, -19, -28, -17, 29, 3, -26, -12, -30, -29, -21, -11, -9, -14, -11, -13, -14, -14, -8, -12, -4, -10, -6, -12, -11, -4, -15, -17, -11, -12, -42, -16, 5, -1, -12, -21, -13, -43, -44, -8, -16, -11, -12, -16, -16, -14, -19, -8, -16, -8, -8, -4, -11, -2, -5, -11, -20, -16, -4, 5, 16, -22, 0, 4, -19, -53, -37, -15, -3, -17, -11, -10, -3, -17, -7, -16, -1, -14, -5, -12, -10, -12, 4, 0, -6, -25, -1, -12, -32, -14, -4, -18, -16, -11, 7, 1, -11, 6, -8, -12, -3, -1, -11, -9, -2, -4, -2, 1, -8, -9, -18, -17, -10, -15, 5, -3, -21, -7, -8, -10, -21, -55, -31, -10, -13, 1, -3, -2, -5, -10, -1, -3, -7, -8, -11, -2, -1, -18, -9, -19, -11, -12, -1, -18, -41, 9, -2, -8, 17, -24, -6, 3, 0, -11, 6, -20, -2, 2, -13, -7, -9, -7, 0, -10, -3, 18, 5, 10, -5, 10, -31, -29, -36, 5, -4, -5, -5, 7, 2, 27, -8, 14, 2, 8, 0, 0, 1, 3, 2, 5, 1, 14, 6, 0, 43, 42, -16, 8, -2, 5, -37, -11, -2, -7, -4, 24, -6, 34, 29, 32, 13, 36, 4, 9, 14, 5, 36, 3, 2, 24, 19, 2, 16, -2, 2, 15, 42, -14, -10, 2, -2, -4, 3, -7, -8, -5, 7, -3, -33, -8, 37, 9, 8, -2, 20, 31, 17, -4, 23, 33, 27, 22, 13, 13, 7, 5, -9, -5], [-5, -6, 6, 7, -7, -11, -7, 1, 9, 11, 8, -5, -14, 6, 16, 0, -10, 10, -8, 2, 9, -2, 1, -13, 5, -8, -4, 2, 1, -11, -7, 12, -9, -11, -23, -15, -32, -13, -29, -40, -47, -17, 9, -5, 1, -12, -37, -37, -35, -6, -13, -27, -9, 4, 9, -2, 8, -3, -13, -29, -30, -17, -34, -41, -28, 18, -12, -14, -6, -3, -2, -11, 1, -15, -4, -19, -16, -24, -25, 8, 22, 25, 5, -3, -3, -8, -17, -28, -31, 22, -7, 5, -9, -7, 0, 0, 17, 7, 10, 19, 10, 10, 12, -6, 2, 1, -8, -18, -34, 16, -20, 3, -11, 20, 18, 14, -10, 7, 14, 2, 19, 23, 14, 16, 17, 14, 14, 5, 7, 0, 0, 2, 6, 1, -14, -23, -21, -25, -8, -25, 2, 4, -9, 13, 29, 37, 20, 19, 0, 9, 9, 2, 6, 5, 5, 11, -1, -9, 2, -4, -12, -4, -4, -3, 4, -31, -4, -4, 11, 24, 4, 57, 5, 4, 15, 10, 20, 6, 9, 11, -1, 6, 1, 11, 8, 4, 8, -6, 2, -10, -12, -28, -12, -42, 7, -3, 2, 43, 20, 33, 34, 14, 11, -3, -6, 8, -2, 6, 3, 16, 2, -2, 6, 3, -8, -4, 1, -7, -5, -17, -50, -77, 3, 7, 6, 26, 33, 1, 38, 0, 8, 13, -7, -1, -4, 2, 7, 2, 13, 7, -4, 4, 7, 7, 3, -1, 6, -34, -108, -71, 2, -11, -9, 44, 54, 32, 45, 14, 5, 6, -1, 6, 0, -6, 1, 1, 28, 17, 14, 7, 10, -4, -5, 5, 17, -24, -118, -52, 1, 1, -15, 37, 23, 35, 11, 7, 20, -3, -13, -19, -19, -25, -18, -9, 19, 22, 12, 13, 0, 11, 4, 5, 8, -19, -127, -10, 14, 25, 2, 7, -1, 34, -19, -12, -25, -27, -28, -31, -14, -16, -12, -27, 9, 16, 7, 10, 12, 3, 10, 3, 4, 0, -81, -3, -4, 17, 23, 9, 12, -16, -25, -35, -60, -22, -19, -3, -13, -18, -23, -11, 10, 5, 2, 0, -2, 2, -3, -15, -27, -55, -40, 45, 5, 36, 0, -24, 34, -31, -17, -49, -25, -17, -3, -11, -3, -12, -10, -5, 18, -2, 8, 6, 4, 1, -5, -11, -33, -35, -6, 24, 27, 15, -21, -12, 5, 4, 15, -29, -7, -6, 0, 4, -8, -10, -6, -3, 12, 0, -1, -1, 6, -3, -8, 1, -7, -19, -22, 26, 32, 44, 0, 2, 10, 13, 17, 17, 10, -4, -6, -7, -14, -4, 1, 15, 1, 9, 3, 2, -2, 7, -6, -6, -2, -1, 17, 15, 55, 28, 20, 19, 22, 11, 28, 24, 9, -6, -13, 0, 3, -2, 3, 5, 8, -8, -3, 3, 10, 0, 4, 3, 12, 18, 12, 32, 57, 13, -3, 3, 16, 1, 12, 15, 0, 0, -10, -20, -25, -14, -2, 7, 4, 1, -4, 6, -7, -1, -3, 4, 2, -1, 0, 27, 63, -2, 15, 21, 15, 35, 10, 0, -1, 1, -7, -4, -6, -11, -9, -3, 9, 8, 2, -2, 4, 3, 2, 15, 8, 1, 11, 11, 37, 17, -14, 6, -5, 12, 10, 0, -4, 6, -5, -6, -6, -2, -6, -1, 1, -1, -3, 1, 2, -1, 1, -6, 4, 5, -6, 36, 42, 5, 2, -8, -11, 14, 24, 3, 3, 7, 7, 7, 8, -6, -8, -9, 1, -5, 2, 2, 4, 5, 6, 0, -6, 4, 10, 15, 20, -16, -6, 25, 9, 5, 13, 7, 10, 7, 0, -1, 0, -4, -7, -10, -4, -5, 2, -12, 3, 3, 3, -5, -3, -1, -12, 12, -2, -8, 1, 20, 38, 24, 14, 4, 16, 9, 0, 2, -3, 2, -10, -5, -13, 1, 1, -3, -1, -2, 1, -8, -2, -8, 8, -10, -4, 11, 3, 4, -7, -7, 5, 11, 12, 1, 1, -1, 1, -1, -12, 3, -7, -6, -13, -2, -2, 0, -9, -12, -3, -2, 0, -12, 14, 11, 7, -7, 28, 0, 21, 12, 11, 11, -3, -2, 0, 2, 2, -4, 10, -6, -3, -1, -18, -20, -10, -15, -8, -15, 23, 7, 27, 8, 11, -4, 23, -22, 10, 20, 3, 5, 17, 16, 3, 5, 10, 5, 7, 3, -3, -1, -3, -1, -23, -14, -41, -46, -30, -7, 11, 7, 2, -9, -9, -4, -18, 9, 23, 0, 9, 26, 20, 22, -3, 7, 11, 18, 20, 18, 3, 13, -2, -4, 27, -4, 2, -10, 2, 12, 5, 9, 3, -12, -6, 9, 13, 15, 51, 40, 39, 30, 7, 49, 29, 25, 25, 18, -8, 31, -20, -30, 8, 34, -11, -11, -9, -8], [9, 12, -4, 8, -10, 6, 13, -9, -13, 9, -8, 1, -7, 0, -5, -14, 1, 8, -7, -6, 1, 3, -7, -5, -12, 11, -4, -7, 4, 7, -5, -9, 5, 10, 1, -5, 10, -1, 11, -38, -20, -25, -12, -16, -53, -32, 1, 1, 11, 8, 18, 32, -13, -5, -9, 6, 1, 6, -6, -28, -25, 32, -21, -14, 12, -10, -20, 8, -8, 13, 23, 15, 17, -8, -26, 13, 10, -1, 19, -37, -24, -18, -13, -2, -8, -13, -8, -35, 1, 19, 23, -7, -21, 7, 0, 1, -4, 6, 23, 26, 3, 18, 34, 33, 13, 10, 38, 20, -25, -28, 8, -4, -2, -1, 1, -11, 13, 24, 20, 7, 6, 6, 11, -12, -1, -6, -6, -9, -1, 0, -10, 6, 6, 21, 19, 28, 0, -30, -17, -1, -2, 1, -5, -5, 25, 1, 21, 0, 17, 9, 1, -11, -6, -15, -7, 0, -4, -8, -1, -6, -7, 9, 0, 27, 23, -43, -12, 14, -7, 3, -6, 11, 26, 2, 19, 15, -4, -2, -11, -5, -12, -16, -17, -14, -15, -15, -14, 0, -11, -4, 5, 14, 19, -21, -4, -23, 11, -9, -3, 9, 4, 7, -20, 3, -4, 0, -8, -2, -10, -4, -11, -19, -8, -5, -8, -6, -6, -4, -4, 1, 13, -8, 13, -13, -3, -15, -2, -23, 13, -10, 4, -12, -12, -4, -7, 2, -17, -10, -5, -10, -15, -3, -9, -4, -4, -10, -15, -14, 0, 6, -5, -28, -8, -19, 8, -20, -7, -10, -9, -6, -4, -4, -8, -5, 2, -10, -12, -4, -6, -10, 0, -10, -5, 0, -1, -9, -19, -18, -20, -26, 0, -11, -36, -27, -16, -2, -5, -5, -6, -4, -5, -14, -8, -27, -29, -4, -8, -5, -9, 1, -15, -12, 1, -26, -4, -3, -31, -13, 2, -42, -48, -18, -15, -3, -6, -10, -8, -8, -5, -13, -5, -20, -4, 2, -4, 0, 1, -7, 3, -3, -13, -8, -24, -30, -35, 11, -5, -34, -51, 0, -8, -15, -13, -5, -6, 3, 7, 6, 15, 23, 5, 0, 1, -11, -2, 1, -5, 9, -13, -18, -14, -22, -34, -4, -10, -40, -20, 14, -17, 4, 17, 11, 10, 5, 17, 13, 14, 14, 0, 11, 5, 12, -3, 6, -7, 16, 5, 3, -7, 3, -31, -17, -6, -1, -29, 19, 21, 12, 12, 17, 9, 21, 10, 15, 14, -1, 10, 8, 12, 5, 14, 8, 7, -8, 18, -13, -2, -5, -16, -37, -5, 2, -14, 31, 14, 15, 16, 12, 14, 9, 4, 14, 7, 11, 11, 8, 10, 5, 2, 9, 2, -2, -1, -1, -3, 0, 10, 7, -8, 11, -9, 7, 6, 9, 8, 12, 13, -2, 11, 3, 4, 13, 18, 13, 7, 11, 11, 4, 10, 13, 3, -1, 6, 31, 29, 10, 1, 22, 12, -20, 8, -1, 6, 12, -4, 5, 10, 6, -1, 19, 17, 8, 3, 5, 3, -1, 11, 6, 9, 23, -2, 11, 29, -16, -25, 31, -15, 24, 2, -2, 0, -1, 4, 3, -1, 0, 5, 16, 11, 8, 9, -7, 2, 4, 1, 10, 2, 20, 14, 0, 25, -7, 9, -27, 1, 49, -4, -8, -15, -4, -7, -7, -5, 8, 0, -1, 9, 7, 5, 4, -3, 3, -2, -5, -13, -17, -11, -22, -15, 19, 5, -31, 0, 16, -29, -32, -11, -10, -4, -13, -13, 3, -9, 0, -2, 4, 9, -1, 4, -23, -12, -12, -36, -45, -38, -17, 26, -3, 31, 32, 12, -1, -35, -5, -21, -19, -5, -7, 4, -3, 2, 0, 4, -4, -5, 10, -2, -4, -9, -18, -10, -5, -20, -6, -10, 4, 18, 18, 21, 25, -28, -7, -19, -16, -7, -13, -11, -6, -19, -6, -10, -3, -9, -12, -9, -8, -9, -9, -9, -11, -21, 8, 39, -2, -12, 13, 11, -6, 2, 2, 0, -5, 3, -7, -8, -12, -8, -9, -19, -12, -13, -6, 1, -7, 6, 11, 4, -4, 7, 29, 31, 3, -8, 11, -7, -1, 18, 11, 7, 2, -11, 9, -3, 1, -9, -9, -3, -3, 5, -8, 1, 10, -10, 9, -2, 7, -22, 42, 39, -11, -5, -13, 20, 13, -1, -9, -11, -5, -12, -26, -14, -9, -14, -7, -10, -16, -18, -14, -18, -26, -8, -3, -12, 7, -33, 13, 21, 3, 2, -13, -4, 22, -9, -31, -6, -23, -12, -20, -9, -27, -12, -22, -27, -16, -26, -14, -27, -8, -13, -10, -28, -13, -29, -11, 7, -3, -1, 6, -5, 0, -11, -17, -9, -35, -45, -44, -41, -16, 0, -45, -24, 3, -2, -10, 4, -18, 26, -2, 2, -38, 4, -12, -5, 3]]}}, {"scale": 2.544825110817328e-05, "zero_point": 0, "tensor": {"shape": [5], "dtype": "INT32", "name": "sequential/dense/BiasAdd/ReadVariableOp/resource", "tensor": [339, 10360, -5000, -3711, 6293]}}], "outputs": [{"scale": 0.0588817298412323, "zero_point": 23, "tensor": {"shape": [1, 5], "dtype": "INT8", "name": "sequential/dense/MatMul;sequential/dense/BiasAdd", "tensor": null}}]}, {"description": "TANH", "op_type": "TANHLUT", "name": "TANHLUT", "inputs": [{"scale": 0.0588817298412323, "zero_point": 23, "tensor": {"shape": [1, 5], "dtype": "INT8", "name": "sequential/dense/MatMul;sequential/dense/BiasAdd", "tensor": null}, "LUT": [-128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -127, -127, -127, -127, -127, -127, -127, -127, -127, -126, -126, -126, -126, -125, -125, -125, -124, -124, -123, -123, -122, -122, -121, -120, -119, -118, -117, -115, -114, -112, -110, -108, -106, -103, -101, -98, -94, -91, -87, -82, -78, -73, -68, -62, -56, -50, -43, -37, -30, -22, -15, -8, 0, 8, 15, 22, 30, 37, 43, 50, 56, 62, 68, 73, 78, 82, 87, 91, 94, 98, 101, 103, 106, 108, 110, 112, 114, 115, 117, 118, 119, 120, 121, 122, 122, 123, 123, 124, 124, 125, 125, 125, 126, 126, 126, 126, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127]}], "outputs": [{"scale": 0.0078125, "zero_point": 0, "tensor": {"shape": [1, 5], "dtype": "INT8", "name": "sequential/dense/Tanh", "tensor": null}}]}, {"description": "FULLY_CONNECTED", "op_type": "FULLY_CONNECTED", "name": "FULLY_CONNECTED", "inputs": [{"scale": 0.0078125, "zero_point": 0, "tensor": {"shape": [1, 5], "dtype": "INT8", "name": "sequential/dense/Tanh", "tensor": null}}, {"scale": 0.005604765843600035, "zero_point": 0, "tensor": {"shape": [32, 5], "dtype": "INT8", "name": "sequential/dense_1/MatMul", "tensor": [[-50, 15, 112, 46, -95], [13, 85, 65, -44, -83], [-37, 57, 84, -7, 14], [14, 79, -52, 2, -89], [54, -5, -1, -78, 88], [4, 59, -64, -48, 21], [44, 64, -25, 34, -77], [-52, -83, 65, 50, -37], [65, -35, 70, -32, 101], [45, -71, 80, -90, 13], [-56, 67, 40, 49, 45], [71, 7, -71, -47, 89], [-73, -116, 125, -82, -27], [-31, 50, -10, 6, 92], [-21, 81, 35, -36, -23], [-89, 5, -76, -67, 37], [-67, -30, 11, 57, 100], [-30, -40, -75, -48, 40], [61, -84, 32, 15, -58], [90, -73, 7, -57, -94], [35, -50, 14, 127, 90], [85, 29, 68, 62, 83], [-78, -52, -64, -97, -74], [77, 74, 83, -49, -3], [-5, 71, -57, -79, 45], [-18, 32, -100, 119, -66], [-91, -4, 107, -25, -94], [-79, 21, 42, 85, 87], [67, 75, 91, -62, 87], [101, -35, -69, -2, -45], [22, 18, 81, 77, -85], [44, 85, 33, 104, -69]]}}, {"scale": 4.378723315312527e-05, "zero_point": 0, "tensor": {"shape": [32], "dtype": "INT32", "name": "sequential/dense_1/BiasAdd/ReadVariableOp/resource", "tensor": [-1339, 2136, -1206, 3468, -166, 776, -3900, -1618, 651, 6173, -1230, -1160, 1197, 3551, 360, -1451, 1897, 1595, -1574, -961, -1423, -652, -369, -1254, -939, -1414, -317, 2894, -2679, 2019, 1780, 2206]}}], "outputs": [{"scale": 0.017320988699793816, "zero_point": -1, "tensor": {"shape": [1, 32], "dtype": "INT8", "name": "sequential/dense_1/MatMul;sequential/dense_1/BiasAdd", "tensor": null}}]}, {"description": "TANH", "op_type": "TANHLUT", "name": "TANHLUT", "inputs": [{"scale": 0.017320988699793816, "zero_point": -1, "tensor": {"shape": [1, 32], "dtype": "INT8", "name": "sequential/dense_1/MatMul;sequential/dense_1/BiasAdd", "tensor": null}, "LUT": [-125, -125, -125, -125, -124, -124, -124, -124, -124, -124, -124, -123, -123, -123, -123, -123, -123, -122, -122, -122, -122, -122, -121, -121, -121, -121, -120, -120, -120, -120, -119, -119, -119, -119, -118, -118, -118, -117, -117, -116, -116, -116, -115, -115, -114, -114, -113, -113, -112, -112, -111, -111, -110, -110, -109, -108, -108, -107, -107, -106, -105, -104, -104, -103, -102, -101, -100, -100, -99, -98, -97, -96, -95, -94, -93, -92, -91, -90, -88, -87, -86, -85, -84, -82, -81, -80, -78, -77, -75, -74, -72, -71, -69, -68, -66, -64, -63, -61, -59, -58, -56, -54, -52, -50, -48, -47, -45, -43, -41, -39, -37, -35, -33, -30, -28, -26, -24, -22, -20, -18, -15, -13, -11, -9, -7, -4, -2, 0, 2, 4, 7, 9, 11, 13, 15, 18, 20, 22, 24, 26, 28, 30, 33, 35, 37, 39, 41, 43, 45, 47, 48, 50, 52, 54, 56, 58, 59, 61, 63, 64, 66, 68, 69, 71, 72, 74, 75, 77, 78, 80, 81, 82, 84, 85, 86, 87, 88, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 100, 101, 102, 103, 104, 104, 105, 106, 107, 107, 108, 108, 109, 110, 110, 111, 111, 112, 112, 113, 113, 114, 114, 115, 115, 116, 116, 116, 117, 117, 118, 118, 118, 119, 119, 119, 119, 120, 120, 120, 120, 121, 121, 121, 121, 122, 122, 122, 122, 122, 123, 123, 123, 123, 123, 123, 124, 124, 124, 124, 124, 124, 124, 125, 125, 125, 125, 125]}], "outputs": [{"scale": 0.0078125, "zero_point": 0, "tensor": {"shape": [1, 32], "dtype": "INT8", "name": "sequential/dense_1/Tanh", "tensor": null}}]}, {"description": "FULLY_CONNECTED", "op_type": "FULLY_CONNECTED", "name": "FULLY_CONNECTED", "inputs": [{"scale": 0.0078125, "zero_point": 0, "tensor": {"shape": [1, 32], "dtype": "INT8", "name": "sequential/dense_1/Tanh", "tensor": null}}, {"scale": 0.005759012419730425, "zero_point": 0, "tensor": {"shape": [64, 32], "dtype": "INT8", "name": "sequential/dense_2/MatMul", "tensor": [[25, 1, -23, 35, -62, -63, -63, 81, 5, -19, 8, -28, -8, 13, -8, 40, 35, 2, 27, -29, 15, -34, -10, -76, -83, 56, -6, 75, -30, 31, -1, 35], [11, -9, -49, 0, -24, -10, -25, 28, -57, 12, -48, -31, -26, -77, -11, 28, -43, 19, 36, 72, -42, -12, 31, -8, -2, 46, 25, -29, -51, -4, -37, -14], [29, 66, 76, -1, 3, -16, 3, 34, -35, 45, 18, -74, 69, -14, 77, 13, 42, -42, -1, -46, -74, 22, 11, 21, -47, -63, 28, 14, 28, -23, 18, -4], [11, -45, -43, 50, -65, -2, 36, 15, -63, -11, -31, 7, -60, -65, -54, -53, 24, -14, 49, -6, 7, -10, 10, -18, -61, 84, 26, 12, -81, 27, 34, 45], [-46, 22, -29, 81, 6, 32, 22, -80, -39, -72, 30, 18, -99, 33, -28, 4, 1, 28, -42, -10, -27, -6, -28, -13, 47, 51, -31, 8, 20, 44, -22, 51], [-57, -55, -21, -23, 42, 8, -26, -61, -5, 54, -28, 36, -18, 9, -20, 49, 36, 53, 6, 46, -26, 13, 65, 2, 10, 23, -19, -50, 5, 41, -6, -28], [62, 46, 45, 0, 26, -42, -3, 31, 57, -6, -67, 27, -16, -51, -16, -52, -34, -12, -2, 87, -63, -24, -17, 17, 16, 8, 38, -49, 20, 18, 52, 47], [-44, 26, -23, 33, -3, 50, -29, -67, -38, 24, -94, 59, -10, 11, -31, -10, -64, 17, 21, 47, -54, -4, 27, -29, 7, -41, -68, -32, -17, 96, -26, -36], [59, -7, 36, -6, -19, 15, 20, -32, 7, -9, -8, -34, 42, 35, 44, 16, -13, -11, 5, -49, -14, -15, -26, 28, -12, -26, 23, 8, 9, -31, 50, -5], [-2, 20, 35, 21, 38, -17, 16, -32, 42, 0, 6, -22, -13, 14, 10, 26, -14, -43, -49, -16, -50, 37, 13, 56, -12, -69, -22, -21, 9, -43, -39, -33], [-22, 19, -25, 41, -18, 75, 62, 6, -43, -51, 38, 52, -67, -35, 46, 20, -42, -7, -81, -14, 10, -16, 38, -22, 64, 43, 36, -44, 17, -36, 15, 28], [-54, -12, -57, 66, 65, 95, -15, -33, -43, 8, -59, 27, -8, 43, -29, 59, -80, 54, -30, -32, 7, -18, 28, 1, 26, 1, 19, -88, -42, 35, -78, -58], [2, -15, -36, 29, 2, -25, -12, -12, -27, 25, 14, -20, -33, 4, -41, -9, 0, -16, 42, 45, 15, -13, -40, 29, 23, 32, -61, -39, -5, 40, 46, 34], [-16, -37, 19, -23, 4, -52, -32, -14, 52, 52, -57, 13, 23, -49, -74, -8, 1, 14, 1, 42, 87, 32, -52, -30, -39, 2, -7, 28, -2, 64, 33, 30], [-40, -77, 11, 24, -21, 22, -20, -28, -25, -73, 43, -8, -35, 46, -23, 34, 72, 7, 0, -44, 91, 37, -41, -73, -17, 14, -70, 67, -23, -28, -25, -44], [-1, 3, 15, -67, -32, -10, -64, 49, 32, -4, 46, 20, 59, -33, -44, -53, 56, 14, 18, -10, 4, 36, 6, -4, -67, -63, 49, 4, 15, -30, -19, 2], [-46, 43, 8, -12, 64, 39, -10, -7, 14, 62, -13, 74, -5, 35, 40, -22, 38, -1, -23, -15, 40, 67, -50, -3, 12, -5, -25, 38, 52, 20, -3, 36], [-13, -44, -60, -11, -33, 9, 62, 12, 12, 21, -88, 14, -48, -66, 1, -45, -14, 49, -4, 49, 48, -36, -15, 24, -6, -15, -56, -73, 28, 75, 5, 48], [-48, 48, 27, 4, 10, -7, 26, -11, -4, 35, 22, 32, 8, -6, -35, -73, -14, -33, -21, 35, 22, 54, 5, 59, -56, 29, -18, 38, -22, 46, 36, 70], [-53, 0, -2, 4, 1, -2, -52, -31, 18, -44, 53, 33, -36, 79, -57, 17, 64, 73, -54, -48, 39, -15, 50, -75, 24, 7, -69, 18, -26, -25, -17, -4], [43, 54, -11, -11, 13, -29, 52, -9, 43, -10, 15, 21, 23, -17, 22, -5, -28, -32, 43, 58, -43, 39, 23, 53, -29, -6, 17, -49, 32, 15, 26, 13], [-48, 5, 2, -7, -2, 36, 33, 12, -50, -9, -9, 38, 2, -15, -5, 62, -50, 75, -18, 41, -68, -86, 95, -20, 30, -12, 53, -17, -23, 41, 4, -2], [17, 14, -17, 15, 39, 4, -65, 2, 30, 44, -7, -28, 30, 39, -1, 7, 14, 71, -58, -39, -20, -13, -20, -15, -25, -29, -31, 32, -37, 28, 7, -60], [-46, 6, -29, 4, 27, 9, 22, 17, 9, -40, -38, 25, 15, -22, 16, 41, -16, -19, -32, 25, -11, -4, 46, 47, 62, -26, 10, 2, 31, 9, 3, -42], [-31, 37, 7, 49, 8, -37, 68, -5, 21, 17, -48, -23, -21, -3, -20, -13, -46, -32, 58, 75, 1, 52, 17, -16, -22, 14, -37, -22, -28, 82, 54, 63], [-52, 12, 39, -30, 83, 31, -26, -11, 77, 96, 31, -13, 22, 56, 12, 59, 14, -8, -56, 17, -9, -20, 5, 59, 63, -57, 8, 37, 34, -8, -44, -8], [-21, -47, -8, -33, -23, -26, 4, -11, -27, 57, -28, -10, 24, 16, -16, 26, 5, 45, 28, 35, -49, -27, 62, -32, -19, -2, 10, -46, -17, -9, -24, -37], [-5, 12, 8, 47, 25, 7, -23, 22, -5, 9, -36, 15, -9, 14, 26, -32, 11, -45, 34, -8, 39, 42, -47, -19, -44, 53, -8, 7, -12, 41, 54, -9], [58, 60, 5, -2, -53, 27, 30, -38, 40, 9, 35, -34, -37, 33, -19, -7, -26, -81, 18, -23, 45, 36, -73, 21, -6, -17, 47, 1, 8, -28, 25, 39], [-37, -29, 25, -11, 30, 18, -92, 36, 35, 83, -25, -7, 76, 1, 19, 45, -27, -28, -41, 28, 13, 34, -20, -14, 49, -61, 21, 15, 67, -52, 34, -49], [11, -41, -37, 20, 7, -22, -23, 28, -21, -18, 7, 48, 4, -18, -64, -45, -8, -11, 50, 26, 48, 50, -16, -13, -27, -18, -55, -41, -23, 71, 8, -24], [39, -32, 22, -29, -52, -113, -73, 62, 43, 31, -26, -18, 81, -24, -15, -19, 59, -54, 72, 59, -11, -28, -30, -27, -38, -63, 65, 35, -40, -9, 42, 25], [24, 53, 31, -14, -23, -10, 24, -25, 55, 0, 44, 49, -47, 74, 21, 6, 40, 39, -46, -62, -36, -6, -22, 10, 2, 14, -52, 67, 26, -11, 27, 22], [49, -29, 26, 19, -68, -19, 35, 2, -64, -30, -7, -51, -8, -34, -8, -1, 58, -35, -44, -75, 16, 9, 15, -84, -9, 38, 46, 74, -40, -16, 6, -7], [27, -31, -2, 10, -20, 4, -5, -21, 25, 17, -48, 29, 9, 44, -54, -31, 47, 37, -16, 19, 62, -21, -32, 27, -25, 33, -56, -21, 6, 37, 40, -9], [28, -8, 44, -73, 49, -33, -14, 76, 27, 56, 32, 33, 84, 25, -42, -35, 42, 35, 7, 20, 0, 55, -13, 2, -57, -84, 27, 15, 2, -66, 34, -53], [24, -1, -24, -18, -19, 8, 0, -30, 18, 14, 16, 3, 20, 44, 49, 52, 53, -17, -36, -26, 3, -46, -31, -40, 47, -33, -19, 53, -9, -82, 16, -37], [18, 11, -31, 11, -37, -14, 12, 44, -3, 60, -26, -1, 29, -7, -4, -4, 30, 31, 56, 8, -18, -51, 33, -50, -13, 12, 30, -40, 2, -32, 7, -48], [-35, -42, 44, 19, -4, -9, -12, -58, -42, -73, 58, -3, -66, 49, -26, 35, 3, -12, -89, -74, -18, 28, -16, -54, 54, -3, 17, -12, -45, -35, -44, 3], [4, 36, 76, 27, -8, 32, -28, 11, 17, -5, 9, 3, -48, 27, 4, -25, 28, 5, -33, -80, -16, 1, -16, 42, -31, -34, 38, 53, 65, -11, 46, -24], [-19, 28, -2, -35, -42, 42, 13, 36, 7, -4, -58, 3, 35, -47, -41, 56, 30, 57, -5, 45, -75, -92, 99, -80, 45, 19, 10, -17, -73, -14, -31, -72], [-21, -40, -8, -49, 38, 0, -17, 4, -3, 23, 15, 32, 2, 34, -62, 27, 44, 67, 26, -36, 66, 20, -24, -33, -10, 18, 24, 34, 28, -28, -43, -8], [-44, -74, -12, -49, -5, -53, -16, 16, -15, 26, 16, 2, -37, 20, -67, -23, 25, -17, -19, -5, 80, 38, -26, -14, 24, 42, -39, 34, -8, 26, 22, -33], [26, -25, 26, 60, -39, -28, 23, 20, -19, -31, 53, -40, 8, 23, 48, 15, -40, -59, 20, 23, -35, 29, -7, -27, -55, 72, 52, -9, -38, -11, 74, 51], [-40, -30, 24, -42, 16, -50, 9, 7, -25, -31, 3, 33, -25, -27, -23, 8, 63, 34, -11, 29, 75, 41, -6, -39, -73, -15, 7, -14, -14, 14, 27, 44], [-60, 1, 7, 27, 17, 74, -3, -47, -31, -4, 1, 0, 10, 33, -23, 56, -8, 42, -71, 3, -2, 27, -11, 4, 84, -47, -44, 6, -29, -46, -5, -33], [-47, -64, 2, -27, -52, -29, 16, 34, -30, -10, 24, -43, -45, -19, -20, 26, 57, 40, 34, -49, 42, 27, -6, -91, -42, 74, -9, 58, -24, -7, -7, -11], [-45, 42, -18, -44, 61, 42, 33, -62, 43, 28, -17, 54, -56, 62, 49, 5, 13, -49, 25, -11, 50, 60, -44, 75, -15, -50, -58, -22, -9, -21, 38, 5], [-42, 52, -19, 1, 7, 59, -16, -21, 19, -9, -20, 48, -8, 64, 16, 8, -51, 48, -60, -69, 34, -33, -50, 4, 35, 37, -34, 41, 32, -31, -47, 53], [15, 20, -18, -25, 41, 21, -26, -33, -37, 8, -71, 30, 22, -46, -14, 42, -51, -4, -8, 67, -29, -32, 0, 10, -9, 29, 18, -91, -47, 16, -45, -17], [-89, -33, 5, -53, 12, 41, -8, -41, 53, -4, 3, 62, -74, -10, -44, 35, 7, -18, -6, 20, 23, -14, -44, 39, 27, 39, -98, 10, -27, 19, -62, -36], [-12, 7, 20, -72, 35, -31, -10, 27, 60, -2, -43, 62, 65, -17, 10, 60, -10, 43, 2, -3, -38, -1, 22, 4, 48, -52, -43, -21, 34, -55, -45, -79], [-21, -42, -46, 4, 10, 9, -34, 48, 22, -4, 6, 33, 37, 51, -24, 15, 70, -6, -17, -13, 68, 16, -4, -13, -11, -35, -23, 66, -10, 22, -2, -20], [68, 18, -16, -52, 6, -9, 24, 20, 11, 8, 7, -48, 29, -45, -49, 6, -25, -37, 68, 56, 12, 35, 32, -33, -35, -66, 23, -21, 48, 53, 62, 40], [11, -5, 19, -24, 4, 49, -24, -59, 3, -67, 60, 47, -36, 64, 17, 42, 0, 45, -63, -46, 40, -52, -2, -59, 2, 62, 5, 51, -3, -20, -46, 18], [-50, 46, -23, 31, -31, 45, 15, -46, -3, 1, 24, 7, 26, -8, 13, -32, 11, 6, -6, -25, -51, 12, 10, 46, 24, 45, 27, -15, 13, 51, -13, 37], [46, -26, 13, 0, 28, -65, -33, 74, 36, -31, 13, -58, 56, 8, -31, -30, 84, -14, -59, -80, -1, 34, -6, -49, -71, 7, -2, 91, -54, -22, -8, 15], [55, -23, 66, 17, -22, -37, 43, 48, 0, 26, 77, -40, -37, 28, 43, -6, 23, -48, 15, 20, -26, 10, 4, 35, 32, 20, 7, 33, 58, -43, 45, 46], [16, 55, 16, 63, 7, 45, -30, -44, -5, 35, 27, -44, -10, -3, 62, -22, -33, 19, 10, 14, -16, -38, 35, 45, 45, -29, 58, 29, -7, -33, 53, 23], [-34, 37, -31, -19, 101, 5, -39, -61, 127, 17, 17, 91, 0, 50, -18, 2, -12, -15, 21, -49, 53, 81, -30, -21, 32, -59, -58, -9, 91, 15, -65, -58], [-53, -76, -45, -58, 12, 24, -11, -2, -26, -48, -14, 47, -23, 41, -40, -30, 54, 13, 41, -4, 95, 31, -9, 25, 24, 69, -82, 69, -6, 35, -20, 19], [-26, 6, -61, 52, -1, -8, -10, 32, -26, -5, -79, 33, 53, -45, 10, 6, -18, 53, 38, 35, -25, -34, 72, -46, -52, -2, -20, -55, -17, 74, 31, -53], [-18, -71, -59, 19, 6, -59, 25, 82, -40, -24, -17, 30, -1, 19, -90, -12, 68, 22, 77, -43, 20, 38, -57, -68, -66, 61, 8, 16, -6, -9, 21, 22], [7, 42, 27, 35, 10, -37, 12, 38, 0, -2, -15, -33, 26, -22, 9, -56, -34, -35, -3, 28, -6, 48, -30, 51, 13, -55, -19, 37, 71, -53, -5, 49]]}}, {"scale": 4.4992284529143944e-05, "zero_point": 0, "tensor": {"shape": [64], "dtype": "INT32", "name": "sequential/dense_2/BiasAdd/ReadVariableOp/resource", "tensor": [4472, -30, 2909, 1377, 2122, 873, -2747, 5191, -392, -2425, -8410, 2958, 3044, 2985, -1966, -632, -352, 1842, 5484, 3215, 392, 879, 3552, -2522, 920, 2188, -402, 5988, 211, 4471, 1692, -2214, 4136, -2503, 3205, -2606, 666, 430, -2113, 3772, -714, -528, -1760, 4101, 293, -4, 17, 2527, 3857, -2239, -3287, -2395, -65, -5920, 161, 7381, 5178, -3742, 2549, 1689, -1736, -384, -221, 2099]}}], "outputs": [{"scale": 0.029838241636753082, "zero_point": -2, "tensor": {"shape": [1, 64], "dtype": "INT8", "name": "sequential/dense_2/MatMul;sequential/dense_2/BiasAdd", "tensor": null}}]}, {"description": "TANH", "op_type": "TANHLUT", "name": "TANHLUT", "inputs": [{"scale": 0.029838241636753082, "zero_point": -2, "tensor": {"shape": [1, 64], "dtype": "INT8", "name": "sequential/dense_2/MatMul;sequential/dense_2/BiasAdd", "tensor": null}, "LUT": [-128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -127, -126, -126, -126, -126, -126, -126, -126, -126, -126, -125, -125, -125, -125, -125, -125, -124, -124, -124, -124, -123, -123, -123, -123, -122, -122, -121, -121, -121, -120, -120, -119, -119, -118, -118, -117, -116, -116, -115, -114, -113, -113, -112, -111, -110, -109, -108, -106, -105, -104, -103, -101, -100, -98, -97, -95, -93, -91, -89, -87, -85, -83, -81, -79, -76, -74, -71, -68, -66, -63, -60, -57, -54, -51, -47, -44, -41, -37, -34, -30, -26, -23, -19, -15, -11, -8, -4, 0, 4, 8, 11, 15, 19, 23, 26, 30, 34, 37, 41, 44, 47, 51, 54, 57, 60, 63, 66, 68, 71, 74, 76, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 98, 100, 101, 103, 104, 105, 106, 108, 109, 110, 111, 112, 113, 113, 114, 115, 116, 116, 117, 118, 118, 119, 119, 120, 120, 121, 121, 121, 122, 122, 123, 123, 123, 123, 124, 124, 124, 124, 125, 125, 125, 125, 125, 125, 126, 126, 126, 126, 126, 126, 126, 126, 126, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127]}], "outputs": [{"scale": 0.0078125, "zero_point": 0, "tensor": {"shape": [1, 64], "dtype": "INT8", "name": "sequential/dense_2/Tanh", "tensor": null}}]}, {"description": "FULLY_CONNECTED", "op_type": "FULLY_CONNECTED", "name": "FULLY_CONNECTED", "inputs": [{"scale": 0.0078125, "zero_point": 0, "tensor": {"shape": [1, 64], "dtype": "INT8", "name": "sequential/dense_2/Tanh", "tensor": null}}, {"scale": 0.00546546746045351, "zero_point": 0, "tensor": {"shape": [32, 64], "dtype": "INT8", "name": "sequential/dense_3/MatMul", "tensor": [[4, 22, 14, -23, -24, -37, 97, 7, -18, 32, 8, -82, 60, 21, -11, 5, 65, 23, 3, -72, 70, 51, -27, 17, 44, 2, -46, -3, 56, 69, -33, 46, 39, 1, -70, -35, -21, -25, -40, 25, 32, 15, -63, 20, -55, -34, 8, 48, -31, 35, -33, 45, -18, 67, -74, -11, 6, 2, 63, 34, -79, 22, -91, -2], [5, 45, 4, 103, 74, -3, 21, 73, 11, -32, 39, 64, -9, -62, -34, -81, -37, -8, 47, -45, -13, 69, 27, 41, 48, -86, 25, -36, 25, -63, 40, -8, -38, 12, -6, -99, -10, 35, -16, -5, 37, -23, -50, -11, 23, 67, -9, -22, 4, 83, 32, 32, -37, -54, -13, 10, -24, 15, 37, -77, -40, 46, 33, 20], [-5, -42, 9, 17, -47, -9, 26, -17, 49, 60, -38, -82, -38, -5, -1, 76, 83, -10, -34, -8, 31, -74, 38, 45, -17, 11, -19, -5, 61, 52, -45, -21, 19, 35, -43, 73, 60, -2, 32, 116, -32, -11, -23, 20, -35, -12, 14, -21, 48, -26, -24, -34, 49, -26, 8, -42, -34, 88, 59, -28, -48, -38, -29, 29], [89, 15, 57, 31, -2, 14, -15, 33, -11, -53, -42, -34, 35, -25, 42, -16, -27, -34, 33, 4, -19, 54, 14, -3, -34, -8, 1, 53, -70, 42, 31, 16, 32, 34, 20, 49, 57, 27, -23, 15, 40, -11, -38, -37, 40, -35, 50, 17, 2, -36, 13, -23, 46, -29, -23, 40, 91, -70, 1, -25, -15, 3, 70, 0], [57, -19, 11, -50, -1, -45, 64, -12, 32, 59, 18, 2, 21, -61, -45, 26, -7, -44, -2, -47, 13, 22, -35, -14, 46, -15, -53, -18, -3, -25, -41, 39, -7, 23, -7, -46, -28, -19, -31, 56, -41, -17, -12, 12, 0, -22, 10, -59, 6, -49, -63, -40, -47, 63, 1, 36, -9, 78, 5, 64, -42, -43, -27, 68], [-6, 50, 34, 3, -22, 48, 8, -26, 43, 6, -18, 32, -60, -38, -10, 50, -63, -2, 18, 87, -1, -25, 79, -11, -58, 35, 51, -32, -42, 63, -63, 26, -30, 8, 7, 57, 55, -10, -9, -10, 73, 6, -20, -29, -35, 59, 16, -17, 2, 28, 50, 51, 52, -61, -9, 10, -34, 4, 11, -3, 35, 34, -29, 23], [-30, 9, -4, 83, -42, -54, 7, -27, 5, 0, -28, -45, 19, -13, 34, 20, -65, 74, -26, -39, 6, 14, -45, 37, 64, -25, 58, -8, -56, -7, 38, 65, -95, 10, -10, -7, -59, 84, -72, -32, 43, -19, -5, -2, 3, 18, 30, 11, -70, 26, -4, 17, 41, 64, -35, -34, -10, -38, -49, -127, 55, 75, 2, -27], [-37, 38, -21, 16, -76, 15, 26, -37, -61, 24, -26, -18, 1, -42, -39, 67, -41, 3, -54, 6, 4, 59, 64, -2, 5, -9, 25, -3, -61, -18, -37, 43, 3, 4, 30, 59, -32, 34, 6, -31, 62, 37, -26, -70, -2, 14, -25, 15, -18, 25, 62, 36, -21, 28, 19, -40, 62, -17, -33, 3, -30, 62, -40, 16], [61, 52, 13, 22, -50, -57, 50, 48, 6, -26, -20, 26, 3, 6, -56, 38, 26, 3, 56, -63, 39, -40, -56, -28, 45, -42, -43, 4, 20, 42, 36, 48, -28, 42, 32, 42, -59, -34, 15, -35, -32, -3, -6, 69, -20, -59, -26, -13, -52, 17, -41, -41, -33, 22, -51, -51, -25, 32, 4, -36, 21, 52, 34, 50], [9, -19, -9, 53, -34, 83, 24, 48, -69, -9, -42, 19, 61, 16, -8, -73, 29, 16, 20, 0, 14, 35, 38, 15, 22, 41, -26, -7, 7, 4, 44, -37, -25, -98, 63, -79, -55, 34, -35, 30, 7, -2, 27, 4, -46, -14, -30, 69, -38, 91, 21, 19, -6, 12, -50, 71, -35, -57, -67, 18, 69, -17, 7, -12], [16, -38, -61, -14, -32, -33, 17, -34, -34, 8, -31, -64, -9, 74, 34, 16, 71, 52, 55, 11, 3, -76, 38, -50, 42, -8, 6, 15, 39, 69, 46, 49, 13, 59, 78, 70, -33, -1, -44, -24, -58, 14, 30, -4, 19, -30, -8, 48, -11, -73, 22, -27, 49, 61, 0, 0, 5, 7, -39, 6, 12, -55, 37, -7], [14, -27, -11, -17, -53, 50, -77, -39, -23, 25, -13, -12, 7, 71, 6, 54, 52, -15, -63, 86, -42, -33, 78, -1, -73, 68, 23, -22, -61, 13, -25, 43, 12, -54, 63, 7, 64, 30, -74, 41, 25, 54, 30, -68, -10, 28, 30, -24, 5, -5, -2, 56, 41, 1, -3, -32, 31, -8, -39, -30, 67, -27, 24, -43], [70, 36, 26, -26, -69, -35, 2, -36, -8, -33, -76, -42, 0, -31, 41, 20, 41, -48, -52, -37, -41, -35, 29, -22, -35, 10, -10, 31, -39, -17, 37, 79, -17, 30, -35, 34, 40, -25, -24, 23, 13, 25, 7, 31, 33, -41, 60, -7, 2, -2, -24, 36, -38, 50, -36, -58, 33, 28, 12, -24, 45, 29, 40, 2], [8, -14, -83, 78, 66, -9, -15, -28, -59, 3, 77, 47, 2, -59, 17, -46, -23, -7, -44, 63, -6, 18, -32, 34, -21, -40, -3, -2, 6, -72, 6, 19, -43, 52, -58, -6, -45, 10, 66, -40, 75, 29, -3, -35, 4, 37, -2, -41, -16, 41, 54, -5, -7, -65, 62, -5, 12, -7, -8, -64, 44, -32, -25, -6], [-54, -16, -39, -52, 24, -31, 55, -55, 1, 47, 28, -32, 10, -24, -32, 15, 68, 28, 16, -7, 50, -50, -27, 23, -30, 73, -48, -11, -8, -10, 45, 9, 49, -12, 68, 64, -28, -29, -58, 30, 5, 29, -7, -3, 66, 9, -30, 58, 73, -3, 24, -13, 55, 21, -37, -30, -48, 73, -33, -3, -5, -61, -22, 16], [48, 27, 4, -28, -14, 21, -52, 14, 15, -58, 35, -4, -20, -2, 59, -55, -54, -37, -67, 84, -65, 20, 3, -55, -58, -14, -9, -20, -61, -57, -35, 12, -38, -6, -26, -57, 63, 38, 40, -47, 30, 15, 46, 2, 28, -13, 19, -70, 30, 33, -4, -55, -20, 1, 61, 28, 1, -65, -55, -11, 63, 39, 59, -62], [29, 2, -54, 15, 2, 26, 34, -5, -65, 0, 43, 43, 54, -27, 34, -7, -15, 62, 64, 55, 2, -29, -44, -17, 67, -63, -45, 57, -26, -57, -15, -28, 47, 20, -7, -41, -69, -34, 34, 14, -37, -21, -14, -16, 27, -9, 6, 58, -17, -38, 45, -17, -47, -5, 8, -18, 23, -13, 36, -19, 37, 21, 48, -38], [48, -38, -31, 28, -1, -13, -38, 22, -42, -43, -21, -56, 43, 25, 12, 51, -25, 24, -13, 45, 3, -83, 13, 5, 17, 1, -11, 80, -24, -48, 60, -38, -34, -29, 91, -24, 20, -71, 15, 25, -7, 55, 80, 15, -4, 24, 60, 30, -12, -2, 56, -31, 58, -58, 49, 18, 16, -7, 19, 27, 3, -45, 71, 63], [10, 39, -50, 10, 58, 4, -40, 53, 9, -39, 20, -1, 79, 34, 28, -35, -7, 59, 60, 15, -24, -55, -53, 9, 21, -19, -23, 33, 43, -51, 45, -27, -42, -5, 18, -19, 10, -53, 24, 3, -81, 17, -21, 40, 40, 16, 20, -8, 20, 26, 1, -76, -16, 51, 19, -6, -29, -10, -23, -38, 62, -22, 77, 51], [45, -4, 25, 73, 79, -6, 38, 72, 39, -18, -7, 72, 6, 22, 14, -57, -12, 68, 25, -25, 46, -14, 13, -26, 39, -8, 13, 90, 10, -25, -19, -76, 58, -16, 16, -47, -57, 12, 12, 38, -65, -36, -28, 20, -16, -24, 28, 55, 57, -11, -25, -57, -35, -13, 23, 59, 1, 14, 18, 23, -20, 2, 34, 51], [-74, -18, -34, -12, 75, -31, -60, -64, 18, -32, 38, 6, 13, 42, 74, -58, 14, 14, 46, 58, -44, -36, -6, -36, -22, 14, -57, 15, 34, -17, 29, -58, 15, -18, 70, -26, 11, -73, 39, -3, -17, 26, 23, -13, 7, 27, 9, 60, 84, -31, 86, 10, 0, -28, 30, 27, 52, -40, -42, 42, 49, -50, 52, -26], [-12, 71, 9, 52, -58, 17, 34, -19, -4, -26, 44, -13, 53, 15, 15, 55, 0, 60, 42, -56, -8, -13, -78, -29, -33, -72, -15, -9, -28, -17, -23, -1, -47, -53, 20, -3, -58, 3, -51, -56, -20, 58, 56, -4, 29, -5, -2, 56, 13, 43, -8, -40, 35, 67, -16, -13, 48, 45, -61, -89, 40, 44, 66, -2], [68, 21, 65, -44, 25, -52, 3, -53, 33, 50, 59, -4, -18, -93, 5, -16, -2, -61, 6, 66, 38, 14, 22, -32, -4, -27, -15, -43, 24, 19, -42, -53, 66, 25, -12, -15, 23, 39, 37, 45, 17, 18, -9, 55, -60, 40, 71, -23, 7, -38, -63, 0, -54, -45, 32, 16, 13, 95, 27, -50, -26, -10, 39, 46], [-25, 8, -9, -45, 12, 47, -34, 58, -25, 17, -47, 40, -18, 46, 65, 12, 7, -30, -6, 34, -28, 2, 5, 41, -17, -29, 51, 7, -29, 57, -4, -20, -10, 21, 41, 4, -5, 26, 47, 29, -8, 59, -17, -46, 18, 16, -25, 45, -40, 55, -40, 60, 36, -34, 47, 2, -29, -55, -57, -15, 25, 6, 49, 7], [9, 7, -36, 10, -36, -59, -12, -27, -36, 41, -33, -17, 4, 58, 40, 55, 36, 56, 25, 9, 16, -60, -8, -43, 71, 50, -45, 52, 52, 61, -35, 26, 27, -49, 48, -19, -32, 20, -65, -12, -68, -25, 54, -12, 39, 24, 0, 44, 31, -53, 4, 42, 17, 25, -58, 23, -31, 33, -4, 39, 60, 2, -29, 12], [-19, 24, -35, 54, 31, -10, -3, 11, -19, 46, -47, -2, 40, -9, -56, 13, -31, 13, 1, 36, 37, -20, -17, 23, 2, -29, -32, 43, 48, -32, -56, 31, 64, -60, 25, 28, -43, -19, 25, 52, -25, -60, 38, 14, -29, -22, -35, -11, 35, -26, 47, 24, -26, -36, -33, 42, 37, 34, 67, -18, 2, -45, 21, 34], [48, -30, 13, 28, -9, -46, 10, 11, 19, 14, -84, -22, 64, 13, -67, -1, 52, -7, 78, -51, -18, -4, 45, -58, -2, 14, 39, 38, 10, 27, 19, 84, -23, -12, 37, -22, 20, 4, -47, 44, -63, 40, 23, 38, 33, -11, -25, 46, -43, -4, -3, -35, -4, -11, -23, 3, 51, -12, -6, 49, -31, 14, -10, 42], [-44, 11, -19, -23, -2, -57, -28, -88, -10, 41, -14, -59, -1, -31, 55, -13, -20, 22, -40, 54, -58, -55, -8, 10, 11, 57, -66, -13, 50, 13, -51, -14, -10, -14, -12, -9, 3, -31, -14, 79, -33, 1, 20, 75, 12, -2, 55, 54, -29, -18, 3, -22, -27, 41, 19, -44, -3, 46, 52, 32, -14, -94, 52, -4], [-32, 17, -6, -23, -27, 58, 37, 65, -10, -16, -14, -10, 16, 38, -28, 37, 31, 50, 45, -90, 46, 67, -33, 5, 22, 65, 30, -54, 24, 60, 32, 39, -8, -58, -7, 17, 22, -24, -48, -48, 79, -40, 26, -61, -30, 29, -75, -21, -32, 29, 29, 22, -21, 59, -48, -33, 22, -44, -18, 37, -10, 84, -6, 14], [19, -5, 62, 40, 26, -62, -33, 62, 72, -33, 31, 10, 18, 32, 6, 23, -28, 30, -49, 52, 13, 63, -18, 8, 23, -33, 41, -7, 19, -19, -18, 19, -54, -3, -40, -56, 0, 66, -31, 37, 41, 28, 0, 88, 17, -18, 44, -25, -70, 28, -39, -54, -21, 41, -60, -56, 11, 37, -29, 11, -3, 55, 106, 71], [50, 23, 12, -2, -25, 18, 11, 17, 2, -51, -43, 9, 0, 28, -9, 40, 8, -28, 29, -10, -27, -29, 56, -40, 20, -12, -35, 75, -5, -39, 13, 54, 32, 16, 18, -6, -16, 41, 4, 20, 23, -29, -20, 31, -1, -61, 94, 12, -62, 11, -58, -71, 26, 5, -18, 14, 90, 20, 35, 39, -25, 10, 51, 18], [41, -21, -78, 61, 16, 3, -6, 13, -32, -40, 8, -23, -27, 6, 35, -30, -52, 21, -44, 2, -5, -1, 36, -14, -3, -9, 44, -35, -64, -6, 45, -9, -10, -31, 23, 35, 40, 16, -1, -47, 27, 4, 60, -21, 56, -9, 37, -31, -57, 6, 78, -51, 15, -3, -19, -69, -18, -50, -82, 36, 60, -3, -4, -54]]}}, {"scale": 4.269896453479305e-05, "zero_point": 0, "tensor": {"shape": [32], "dtype": "INT32", "name": "sequential/dense_3/BiasAdd/ReadVariableOp/resource", "tensor": [-3579, 3306, -398, 6731, -1717, -307, -2681, -1692, -2866, 6787, 1382, 1869, 0, -4871, -3913, -100, 3784, 3923, 2053, 6552, 154, -3833, -79, 4157, 4926, 4823, 8102, -900, -694, -1373, 4113, -2620]}}], "outputs": [{"scale": 0.06396041810512543, "zero_point": -2, "tensor": {"shape": [1, 32], "dtype": "INT8", "name": "sequential/dense_3/MatMul;sequential/dense_3/BiasAdd", "tensor": null}}]}, {"description": "TANH", "op_type": "TANHLUT", "name": "TANHLUT", "inputs": [{"scale": 0.06396041810512543, "zero_point": -2, "tensor": {"shape": [1, 32], "dtype": "INT8", "name": "sequential/dense_3/MatMul;sequential/dense_3/BiasAdd", "tensor": null}, "LUT": [-128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -128, -127, -127, -127, -127, -127, -127, -127, -127, -126, -126, -126, -126, -125, -125, -125, -124, -124, -123, -123, -122, -121, -120, -119, -118, -117, -115, -114, -112, -110, -107, -105, -102, -99, -95, -91, -87, -83, -78, -72, -66, -60, -54, -47, -40, -32, -24, -16, -8, 0, 8, 16, 24, 32, 40, 47, 54, 60, 66, 72, 78, 83, 87, 91, 95, 99, 102, 105, 107, 110, 112, 114, 115, 117, 118, 119, 120, 121, 122, 123, 123, 124, 124, 125, 125, 125, 126, 126, 126, 126, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127, 127]}], "outputs": [{"scale": 0.0078125, "zero_point": 0, "tensor": {"shape": [1, 32], "dtype": "INT8", "name": "sequential/dense_3/Tanh", "tensor": null}}]}, {"description": "FULLY_CONNECTED", "op_type": "FULLY_CONNECTED", "name": "FULLY_CONNECTED", "inputs": [{"scale": 0.0078125, "zero_point": 0, "tensor": {"shape": [1, 32], "dtype": "INT8", "name": "sequential/dense_3/Tanh", "tensor": null}}, {"scale": 0.007192021235823631, "zero_point": 0, "tensor": {"shape": [10, 32], "dtype": "INT8", "name": "sequential/dense_4/MatMul", "tensor": [[94, -12, -18, -47, -65, -48, 56, 30, -63, -2, -40, -8, -14, 74, -62, -64, 32, -30, 20, -25, -13, 82, -74, -28, -16, 44, -82, -11, 83, -78, -84, -53], [-76, -44, 58, -43, -30, 63, 88, -65, 78, -56, 4, 83, 40, -31, -70, 76, -37, 17, -18, -65, -60, 106, 98, 21, -75, -29, -26, 13, -120, 76, 1, 71], [-2, -8, -57, 50, -29, -36, -7, 31, 15, 105, 14, -9, 55, -11, -53, 63, 49, 36, 64, 32, -15, 49, -68, 102, 9, 9, 98, -12, 3, -49, 70, 48], [-47, 49, 19, 86, 50, 3, -14, -67, -50, -58, -36, -39, 89, 47, -61, 68, 24, 8, 77, 48, 26, -35, 45, -61, -43, 69, -45, 55, -8, 32, 15, -11], [59, -17, 15, -67, 51, 67, -23, 11, -77, -41, 85, 74, -24, -5, 45, -21, -7, 57, -28, -31, 39, -55, 7, 21, 68, 78, 46, -15, -15, -58, -54, -55], [-42, 59, 11, -33, -14, -1, -50, -29, -34, -44, -30, -49, -104, -30, -41, 32, -91, 12, -58, 39, -71, -50, 82, 66, -55, -26, -59, -98, -76, 18, -53, -36], [-27, -6, -86, -81, -59, 35, 30, 97, -15, -10, -20, -13, -34, 34, -19, 96, -88, 45, -38, -99, 68, -26, -31, 49, 44, -50, -88, -21, 106, -70, -82, 94], [-3, 66, 64, -41, 85, -24, 28, -37, 35, 47, -27, -13, 43, -69, 127, -28, 40, 34, 59, 6, -22, 83, 114, 0, 119, 39, 5, 82, 40, 37, 14, -20], [33, 70, -6, 52, 67, 43, 31, 58, 52, -36, -56, -7, 42, -18, -69, 60, -17, -1, -56, -37, -2, -58, 68, 18, -7, -22, 40, -93, 7, 36, 47, -14], [78, -90, -39, -53, 40, -82, -92, -72, 91, -46, 80, -52, 24, 46, 53, 12, 0, -105, -91, 0, -80, -106, -22, -76, -37, -8, 32, 20, -26, -107, 62, -17]]}}, {"scale": 5.618766590487212e-05, "zero_point": 0, "tensor": {"shape": [10], "dtype": "INT32", "name": "sequential/dense_4/BiasAdd/ReadVariableOp/resource", "tensor": [-6542, -3076, 7991, 4063, -2759, 4251, -4819, -771, 941, -2874]}}], "outputs": [{"scale": 0.07752569019794464, "zero_point": 6, "tensor": {"shape": [1, 10], "dtype": "INT8", "name": "sequential/dense_4/MatMul;sequential/dense_4/BiasAdd", "tensor": null}}]}, {"description": "SOFTMAX", "op_type": "SOFTMAX", "name": "SOFTMAX", "inputs": [{"scale": 0.07752569019794464, "zero_point": 6, "tensor": {"shape": [1, 10], "dtype": "INT8", "name": "sequential/dense_4/MatMul;sequential/dense_4/BiasAdd", "tensor": null}}], "outputs": [{"scale": 0.00390625, "zero_point": -128, "tensor": {"shape": [1, 10], "dtype": "INT8", "name": "Identity1", "tensor": null}}]}, {"description": "DEQUANTIZE", "op_type": "DEQUANTIZE", "name": "DEQUANTIZE", "inputs": [{"scale": 0.00390625, "zero_point": -128, "tensor": {"shape": [1, 10], "dtype": "INT8", "name": "Identity1", "tensor": null}}], "outputs": [{"scale": null, "zero_point": null, "tensor": {"shape": [1, 10], "dtype": "FLOAT32", "name": "Identity", "tensor": null}}]}], "operators": 12, "input": [{"scale": null, "zero_point": null, "tensor": {"shape": [1, 784], "dtype": "FLOAT32", "name": "dense_input", "tensor": null}}], "output": [{"scale": null, "zero_point": null, "tensor": {"shape": [1, 10], "dtype": "FLOAT32", "name": "Identity", "tensor": null}}]}